[
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/queue-using-two-stacks--115418/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:22:00.884506",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Queue using two Stacks",
      "difficulty": "Easy",
      "accuracy": "68.68%",
      "submissions": "670+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Implement a Queue using 2 stacks s1 and s2.\nA Query q is of 2 Types\n(i) 1 x (a query of this type means  pushing 'x' into the queue)\n(ii) 2   (a query of this type means to pop an element from the queue and print the popped element)\nNote: If there is no element return -1 as the answer while popping.\nExamples:\nInput: queries = [[1, 2],[1, 3],[2],[1, 4],[2]]\nOutput: 2 3\nExplanation:\n1 2 the queue will be {2}\n1 3 the queue will be {2 3}\n2   poped element will be 2 the queue will be {3}\n1 4 the queue will be {3 4}\n2   poped element will be 3.\nInput: queries = [[1, 2],[2],[2],[1, 4]]\nOutput: 2 -1\nExplanation:\n1 2 the queue will be {2}\n2   poped element will be 2 and\nthen the queue will be empty\n2   the queue is empty and hence -1\n1 4 the queue will be {4}.\nConstraints:\n1 <=queries.size() <= 100\n1 <= x <= 100"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(n)"
    },
    "tags": {
      "company_tags": [
        "Flipkart",
        "Morgan Stanley",
        "Accolite",
        "Amazon",
        "Microsoft",
        "D-E-Shaw",
        "Hike",
        "MakeMyTrip",
        "Oracle",
        "Walmart",
        "Goldman Sachs",
        "MAQ Software",
        "Adobe",
        "InfoEdge",
        "InMobi"
      ],
      "topic_tags": [
        "Stack",
        "Queue",
        "STL",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Maq Software Interview Experience Set 10 On Campus",
        "url": "https://www.geeksforgeeks.org/maq-software-interview-experience-set-10-on-campus/",
        "content_summary": "1. Written Round : 1) 30 Aptitude questions(30 min). 2) 2-Coding questions(30 min). 2-a) Write an algorithm for dutch national flag problem 2-b) Write an algorithm for n-queens problem Total 40 people were selected for second round. 2.Technical Round 1 (around 1Hr 15min):- 1) What is web technology. 2) Write some Basic syntax of HTML. 3) Given 2 tables of employee containing employee_id,employee_name and department containing employee_id(foreign key), dept_id find the name of the employee who worked in maximum no. of departments. 4) Discussion about projects which I had written in resume. 5) What is inheritance, overloading and over-riding. 6) Difference between Encapsulation and abstraction. 7) What is indexing in databases. 8) What are clustered and non-clustered indexes. 9) Real life application of Data Structures. 10) Which Data structure used in printer. 11) Which Data structure used for maintaining Dictionary.(Trie) 12) What is the searching and space complexity of your Trie for maintaining Dictionary. 13) 2 simple puzzle. 14) Add 2 numbers a and b without using ?+? operator. 15) find nth Fibonacci number. (Gave O(logn) solution) 3.Technical Round 2 (around 1 Hr):- 1) How many square in (8*8) chess board. 2) Give general formula for square in (n*n) board and prove it. 3) Write code for Sudoku Game Problem and discuss time complexity of the code which was written by me. Discuss many thing about that code he said to optimise the code then i optimise some portion of code then we move on to the next question. 4) puzzle:- 2 jar one contain 4 red and other one 4 blue randomly select any jar maximize the probability of selecting red ball by rearranging the balls. Puzzel#6 http://www.crazyforcode.com/probability-puzzles-interview/ 5) Write code for calculating factorial of big number (Array). 6) Puzzel:-Given a pastry. someone eat it from one side how you divide it into 2 equal parts. 7) Egg droping Puzzel. I give solution of 2 egg 100 floor puzzle but then said to give the generalized formula for it then i solve it using DP. 4. HR+Technical Round(around 1 Hr) :- Q1-Tell me about yourself? Q2-Family background? Q3-Discussion about projects which I had written in resume. Q4-Write code for making Queue using 2 stack. Discuss about time complexity and space complexity and he said optimise the code. Q5-Write code for Water Jug problem (check condition are we able to make any given number in any of the jug or not). Q6-Puzzel:-Given a rectangle and a circle and a point lie on circle and center lie line y=x and 1 point of rectangle lie on origin. circle put into rectangle find the radius of circle. A total of 3 students were offered the job(I was one of them). 2 students were offered the intern. Thank you so much geeksforgeeks team.\nRelated Practice Problems\nThe Nth Fibonnaci\nQueue using two Stacks\nTwo water Jug problem\nAll Practice Problems for MAQ Software !\n\nComment\nMore info\nCampus Training Program\nNext Article\nMAQ Software Interview Experience | Set 10 (On-Campus)"
      },
      {
        "title": "Walmart Lab Interview Experience Set 8 Off Campus 3 Years Experience",
        "url": "https://www.geeksforgeeks.org/walmart-lab-interview-experience-set-8-off-campus-3-years-experience/",
        "content_summary": "Round 1 (Coding round): 1) Range [L, R] is given. Need to find what is the maximum repeating digit in prime numbers between L and R (both inclusive). If more number of digits is repeated max times, return whichever digit is maximum Eg: [2, 13] - maximum repeating digit is 1 among {2, 3, 5, 7, 11, 13} [2, 9] - answer 7 2) Given a number \"S\", find out how many number of ways a, b, c, d (all > 1) can exist such that a+b+c+d = S; Round 2: 1) OOPS Concepts 2) Reverse alternate nodes in linked list Eg: 1->2->3->4->5 ahould become 2->1->4->3->5 3) Iterative post order traversal of binary tree 4) Queue implementation using stacks Round 3 (Java): 1) Arraylist, Linkedlist - when to use what 2) Hashmap, Hashtable, concurrent hash map 3) Hashcode, Equals, Hashmap implementation 4) Serializable interface 5) AbstractClass Vs Interface 6) Multi threading, Difference between extends thread, implements runnable 7) Callable interface, Executor framework 8) Collections sorting, comparable interface 9) Best thing I have done so far what I proud of Round 4: 1) Given NxN matrix, (X,Y) position. Find how many ways You can reach from (X,Y) to (N,N). You are allowed to traverse in 2 directions - Right, Down 2) Find loop in linked list. Find starting node of loop 3) Binary tree zigzag traversal 4) Given list of stock prices. You are allowed to buy and sell only once. a) Find the maximum gain you can get b) Find the maximum loss you can get 5) Binary tree is height balanced or not. (Every node in tree should be height balanced) 6) Implement String trim algorithm 7) Write a multi-threaded program - launch 10 threads and exit from main thread after all those threads completed Round 5 (Manager): 1) Given a number in form of array, maximize the number w.r.t allowed number of swaps (can swap only adjacent elements) - maximize(int[] data, int numSwaps) Eg: 1265 is number - if 1 swap allowed - maximum number we can get out of it is 2165 1265 is number - if 3 swaps allowed - maximum number we can get out of it is 6215 2) Questions on my projects 3) So many behavioural questions Round 6 (HR): Why do you want to change? What You are expecting? and some other HR questions.\nAll Practice Problems for Walmart !\nRelated Practice Problems\nCount all possible paths from top left to bottom right\nCheck for Balanced Tree\nStock buy and sell\nLargest number in K swaps\nDetect Loop in linked list\nQueue using two Stacks\nFind the highest occurring digit in prime numbers in a range\nFind the highest occurring digit in prime numbers in a range\n\nComment\nMore info\nCampus Training Program\nNext Article\nWalmart Lab Interview Experience | Set 8 (Off-Campus 3 Years Experience)"
      },
      {
        "title": "Makemytrip Interview Experience Set 9 Off Campus For Sr Android Developer",
        "url": "https://www.geeksforgeeks.org/makemytrip-interview-experience-set-9-off-campus-for-sr-android-developer/",
        "content_summary": "First round (Written) : 1. 4 Android questions: a) What's Recyclerview? Describe all components of Recyclerview with all callbacks and the benefits of Recyclerview. b) Difference between thread, async task and service (in tabular format). c) Callbacks invoked during addition of a fragment to back stack and while popping back from back stack. d) Scenario in which only onDestroy is called for an activity without onPause() and onStop() 2. Describe a scenario in which deadlock occurs and a solution to overcome it. 3. Given an array, find the maximum difference between two array elements A[m] and A[n], such that n>m. 4. The relation between group of friends is transitive. So if student A is friends with student B, and B is friends with C, A becomes friends with C. They form a circle of friends. Given a matrix N*N and N students, each matrix entry indicating 'Y' or 'N' if they're friends or if they're not friends. We need to determine the number of circles. Eg - 6 students, A,B,C,D,E,F. A is friends with B, B with C. D is friends with E. F is friends with none. Output : 3 circles. F2F Round 1: Starting with Java basics : 1. Uses of final, string pool concept, serialization, synchronization (how it can be done) 2. How can you implement thread pool executor. 3. Is it possible to declare final variable in abstract class. 4. What is externalization. Android : Lots of basic questions: You need to provide more area for checking/unchecking checkbox than the default area of checkbox. How would you do it. How would you implement zoom in zoom out functionality in Android. How do you implement GCM push notifications. What things would you do in each lifecycle method of activity? What is IllegalStateException in Android? Any scenario when you encounter it and how to solve it? Advantages and disadvantages of using fragment. How would you implement swipe animation in Android. How do you detect whether keyboard is open in an Android app. And some more. But I don't exactly remember. DS: Implement queue using 2 stacks. After this, the interviewer seemed satisfied with my responses. F2F Round 2 : Android design questions: 1. You have a textview(3 lines) and a button below it. On clicking the button textview whole content should show. (Content is very large but due to 3 lines initially its not shown completely). You need to add animation while showing the full text of textview. How would you design this. 2. Some question related to showing images (for adult and child, like in flight booking system, we have 2 buttons for adding and removing adults/child). When there is 1 adult and 1 child, it should show as AC where A and C are icons for adult and child. On adding 1 more adult, it should show as AAC instead of ACA. How would you design such a system. Got stuck in this round, and was rejected.\nAll Practice Problems for MakeMyTrip !\nRelated Practice Problems\nMaximum Difference\n\nComment\nMore info\nCampus Training Program\nNext Article\nMakeMyTrip Interview Experience | Set 9 (Off-Campus for Sr. Android developer))"
      },
      {
        "title": "Adobe Interview Experience Set 48 Campus",
        "url": "https://www.geeksforgeeks.org/adobe-interview-experience-set-48-campus/",
        "content_summary": "Coding Round:\nA variation of Knapsack\nEasy string manipulation problem\nA brute-force based string matching problem\nTechnical Round 1:\nFinding the length of a Linked-List with a cycle.\nDifference between a stack and a heap with respect to Virtual Memory\nGiven a cube in 3D space with integer dimensions, print all the lattice points on the surface of the cube.\nTechnical Round 2:\nPrint Pyramid of 1's with given height.\nAllocate 2D arrays in C with both dimensions accepted as input.\nCan C programs without main() function exist? (Object Files, Shared and Static Libraries, and how to create them using GCC)\nWhat is a graph traversal?\nPrint all nodes with shortest distance k from a given root node in a graph.\nHow does Breadth-first Search work?\nTechnical Round 3:\nCreate a queue from a 2 stacks\nPrint Fibonacci sequence in order using only recursion and no extra space.\nCreate a function to match a simple regex.\nHR Round:\nWhy want to join Adobe?\nWhat is the team preference?\nWhat are your shortcomings?\nGiven a table of data, where each row determines a metric, convert it to a single column of data where the new data item indicates the metric with reasonable accuracy (Principal Component Analysis)\nHaving a research background, why want to join a software company?\nDetails about college events\nIf you don't like the team you are assigned to, how will you tackle this?\n\nComment\nMore info\nCampus Training Program\nNext Article\nAdobe Interview Experience | Set 48 (On-Campus)"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/largest-element-in-array4009--142158/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:22:19.136229",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Maximum Element in Array",
      "difficulty": "Basic",
      "accuracy": "84.77%",
      "submissions": "3K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Given an array arr[]. The task is to find the largest element and return it.\nExamples:\nInput: arr = [1, 8, 7, 56, 90]\nOutput: 90\nExplanation: The largest element of the given array is 90.\nInput: arr = [5, 5, 5, 5]\nOutput: 5\nExplanation: The largest element of the given array is 5.\nInput: arr = [10]\nOutput: 10\nExplanation: There is only one element which is the largest.\nConstraints:\n1 <= arr.size()<= 106\n0 <= arr[i] <= 106"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Infosys",
        "Oracle",
        "Wipro",
        "Morgan Stanley"
      ],
      "topic_tags": [
        "Arrays",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/level-order-traversal-line-by-line/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:22:30.005857",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Level Order Line by Line",
      "difficulty": "Easy",
      "accuracy": "53.78%",
      "submissions": "83K+",
      "avg_time": "20m"
    },
    "content": {
      "problem": "Given a Binary Tree, your task is to find its level order traversal.\nNote: The driver code prints the levels '$' separated.\nExamples:\nInput: root = [1, 4, N, 4, 2]\n1\n/\n4\n/   \\\n4    2\nOutput:1 $ 4 $ 4 2 $\nExplanation: At first level 1 present then at second level 4 present then at third level 4 2 present.\nInput: root = [10, 20, 30, 40, 60]\n10\n/    \\\n20      30\n/     \\\n40     60\nOutput: 10 $ 20 30 $ 40 60 $\nExplanation: At first level 10 present then at second level 20 30 present then at third level 40 60 present.\nInput: root = [10. 20, 30, 40, 70]\n10\n/    \\\n20      30\n/     \\\n40     70\nOutput: 10 $ 20 30 $ 40 70 $\nExplanation: At first level 10 present then at second level 20 30 present then at third level 40 70 present.\nConstraints:\n1 <= number of nodes <= 1000\n0 <= node->data <= 100"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(n)"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "Snapdeal",
        "Hike"
      ],
      "topic_tags": [
        "Tree",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Hike Interview Experience Set 5",
        "url": "https://www.geeksforgeeks.org/hike-interview-experience-set-5/",
        "content_summary": "Round I 1.Implement expiry cache system : every page in cache have id and expiry time (TTL of few seconds). After page expires it behaves as free space and can be used for new pages/replacement. Had a long discussion on everything. Round II very boring round 1. Nodes at given distance in binary tree 2.Check Mirror in N-ary tree 3. Largest Sum Contiguous Subarray Round III very boring round 1.Level order traversal Line by Line 2. ZigZag traversal of tree 3. Search in a Rotated Array 4.Value equal to index value finally something new.. 5. given a sorted array say A : (-4,-2,0,1,4,6,8,10). There is a function f(x) = a*x^2 + b*x + c , apply this function on A where x is any ith element from array A and a,b,c belongs to set of real numbers. Will f(A) will be sorted, if not then sort it in O(n). It is very easy if you still remember concepts of quadratic equation from maths. I did not remember so he helped me. Logic is that any quadratic equation is represented by parabola on graph and graph has minimum value at dy/dx = 0,i.e, 2*a*x + b = 0. Both sides of this point graph keeps increasing/decreasing to the infinity depending upon value of a. Calculate value of x = -b/(2*a). find it in sorted array or find its ceiling in log n. starting from this point to both ends, perform merge sort. Round IV 1. implement LRU cache 2. Implement following. There are three type of request : i) www.someurl.com/conn_id=?&timeout=? -: for this conn_id you will wait for timeout sec and after that return reponse, in meantime you can get some more requests of any one of three types ii) www.someurl.com/stat/ -: return all id waiting to timeout along with their remaining timeout interval ii) www.someurl.com/kill/conn_id=? -: end wait timeout of this conn_id and return response for this conn_id I gave a solution with heap. He asked how to handle case when a request is waiting for timout and new request came in meantime. How to do server side scalability in this case. 3. He asked about current work and technologies I am working upon. I said Java, Spring MVC for backend and html,css, javascript for front end and suddenly he asked what is difference between Java and javascript. Could not figure out at that time. Javascript is also an object oriented language an can be used at server side like node js. Still there are lot of differences.\n  Related Practice Problems\nTwo Mirror Trees\nLevel order traversal Line by Line\nNodes at given distance in binary tree\nLRU Cache\nSearch in a Rotated Array\nLevel order traversal in spiral form\nKadane's Algorithm\nAll Practice Problems for Hike !\n\nComment\nMore info\nCampus Training Program\nNext Article\nHike Interview Experience | Set 5"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/reverse-an-array/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:22:42.878696",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Reverse an Array",
      "difficulty": "Easy",
      "accuracy": "55.32%",
      "submissions": "189K+",
      "avg_time": "5m"
    },
    "content": {
      "problem": "You are given an array of integers arr[]. Your task is to reverse the given array.\nNote: Modify the array in place.\nExamples:\nInput: arr = [1, 4, 3, 2, 6, 5]\nOutput: [5, 6, 2, 3, 4, 1]\nExplanation: The elements of the array are 1 4 3 2 6 5. After reversing the array, the first element goes to the last position, the second element goes to the second last position and so on. Hence, the answer is 5 6 2 3 4 1.\nInput: arr = [4, 5, 2]\nOutput: [2, 5, 4]\nExplanation: The elements of the array are 4 5 2. The reversed array will be 2 5 4.\nInput: arr = [1]\nOutput: [1]\nExplanation: The array has only single element, hence the reversed array is same as the original.\nConstraints:\n1<=arr.size()<=105\n0<=arr[i]<=105"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Bloomberg",
        "Facebook",
        "TCS",
        "Adobe",
        "Google",
        "Infosys",
        "Capgemini",
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "Apple",
        "Yahoo",
        "PayPal",
        "Uber"
      ],
      "topic_tags": [
        "Arrays",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/buy-stock-2/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:22:53.591345",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Stock Buy and Sell – Max one Transaction Allowed",
      "difficulty": "Easy",
      "accuracy": "49.33%",
      "submissions": "92K+",
      "avg_time": "10m"
    },
    "content": {
      "problem": "Given an array prices[] of length n, representing the prices of the stocks on different days. The task is to find the maximum profit possible by buying and selling the stocks on different days when at most one transaction is allowed. Here one transaction means 1 buy + 1 Sell. If it is not possible to make a profit then return 0.\nNote: Stock must be bought before being sold.\nExamples:\nInput: prices[] = [7, 10, 1, 3, 6, 9, 2]\nOutput: 8\nExplanation: You can buy the stock on day 2 at price = 1 and sell it on day 5 at price = 9. Hence, the profit is 8.\nInput: prices[] = [7, 6, 4, 3, 1]\nOutput: 0\nExplanation: Here the prices are in decreasing order, hence if we buy any day then we cannot sell it at a greater price. Hence, the answer is 0.\nInput: prices[] = [1, 3, 6, 9, 11]\nOutput: 10\nExplanation: Since the array is sorted in increasing order, we can make maximum profit by buying at price[0] and selling at price[n-1].\nConstraint:\n1 <= prices.size()<= 105\n0 <= prices[i] <=104"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Bloomberg",
        "Facebook",
        "Intel",
        "Infosys",
        "Zoho",
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "Samsung",
        "Yahoo",
        "PayPal",
        "Nvidia",
        "Oracle",
        "Visa",
        "Walmart",
        "Goldman Sachs",
        "TCS",
        "Adobe",
        "Google",
        "IBM",
        "Accenture",
        "Apple",
        "Uber"
      ],
      "topic_tags": [
        "Greedy",
        "Arrays"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/add-two-numbers-represented-by-linked-lists/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:23:04.724657",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Add Number Linked Lists",
      "difficulty": "Medium",
      "accuracy": "34.52%",
      "submissions": "338K+",
      "avg_time": "30m"
    },
    "content": {
      "problem": "Given the head of two singly linked lists num1 and num2 representing two non-negative integers. The task is to return the head of the linked list representing the sum of these two numbers.\nFor example, num1 represented by the linked list : 1 -> 9 -> 0, similarly num2 represented by the linked list: 2 -> 5. Sum of these two numbers is represented by 2 -> 1 -> 5.\nNote: There can be leading zeros in the input lists, but there should not be any leading zeros in the output list.\nExamples:\nInput: num1 = 4 - > 5, num2 = 3 -> 4 -> 5\nOutput: 3 -> 9 -> 0\nExplanation: Given numbers are 45 and 345. There sum is 390.\nInput: num1 = 0 -> 0 -> 6 -> 3, num2 = 0 -> 7\nOutput: 7 -> 0\nExplanation: Given numbers are 63 and 7. There sum is 70.\nConstraints:\n1 <= size of both linked lists <= 106\n0 <= elements of both linked lists <= 9"
    },
    "complexity": {
      "time_complexity": "O(n + m)",
      "space_complexity": "O(max(n, m))"
    },
    "tags": {
      "company_tags": [
        "Flipkart",
        "Morgan Stanley",
        "Accolite",
        "Amazon",
        "Microsoft",
        "Snapdeal",
        "MakeMyTrip",
        "Qualcomm"
      ],
      "topic_tags": [
        "Linked List",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Accolite Interview Experience Set 7 On Campus",
        "url": "https://www.geeksforgeeks.org/accolite-interview-experience-set-7-on-campus/",
        "content_summary": "Accolite visited our campus for full time Software development. First round: MCQ round consists of 30 questions 30 minutes. Questions on C aptitude, four to five general aptitude, two puzzle based aptitude questions. Around 120 wrote test, 10 were selected for next round. Second round: It took around 1 and half hour two people were there. All rounds were purely technical. Questions are, Tell me about yourself. Implementation of queue using two stacks and some modification on that. Finding pair in a given array such that sum is equal to given value. Then he modified for negative numbers. Check if a given tree is binary search tree or not with full code. Child sum problem on binary tree told to write code also. One puzzle related to coin and two rooms. Third round: Only one question in this round. I have to design a dictionary of words such that if any word is entered then it should give meaning for all anagrams for that word. We discussed for one hour. First I told about using try data structure to make dictionary and generate all anagrams of that word then searching each words. But he is not satisfied. Then I came up with some modification in structure of try data structure still not satisfied. Then I come up with multilevel hashing Technique. He somewhat satisfied. Fourth round: It was final round and only two people were selected for this. Puzzle: There will be 17 buckets and some 2197(don’t remember exact number) apples. You have to put these apples in buckets such that if I ask any number of apples then just give any number of buckets such that apples in those buckets should equal to that value. Hint, arranged as bits arranged in binary representation of numbers. Finding loop in a linked list. He first asked you already know this question I told yes sir. Then he asked will it work if by changing fast pointer and slow pointer with difference of 3, 4, 5 nodes. Addition of two linked lists with full code. Numbers are in reverse order and all border conditions should be considered like, lengths are not equal. First he told to write for positive numbers I wrote using recursion. Then he told to write negative numbers. We both were told to wait outside. After few minutes they told only I am selected. Thanks geeksforgeeks.\nRelated Practice Problems\nSum of two numbers represented as arrays\nAdd two numbers represented by linked lists\nCheck for BST\nCombination Sum - Part 2\nAll Practice Problems for Accolite !\n\nComment\nMore info\nCampus Training Program\nNext Article\nAccolite Interview Experience | Set 7 (On-Campus)"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/minimum-element-in-a-sorted-and-rotated-array3611/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:23:39.552206",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Sorted and Rotated Minimum",
      "difficulty": "Easy",
      "accuracy": "40.57%",
      "submissions": "152K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "A sorted array of distinct elements arr[] is rotated at some unknown point, the task is to find the minimum element in it.\nExamples:\nInput: arr[] = [5, 6, 1, 2, 3, 4]\nOutput: 1\nExplanation: 1 is the minimum element in the array.\nInput: arr[] = [3, 1, 2]\nOutput: 1\nExplanation: Here 1 is the minimum element.\nInput: arr[] = [4, 2, 3]\nOutput: 2\nExplanation: Here 2 is the minimum element.\nConstraints:\n1 ≤ arr.size() ≤ 106\n1 ≤ arr[i] ≤ 109"
    },
    "complexity": {
      "time_complexity": "O(log n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "Samsung",
        "Snapdeal",
        "Adobe",
        "Times Internet"
      ],
      "topic_tags": [
        "Searching",
        "Algorithms"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/count-the-numbers2359/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:23:49.755276",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Digits in a set",
      "difficulty": "Easy",
      "accuracy": "47.84%",
      "submissions": "12K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Given a number n, count the numbers from 1 to n, which comprise only digits from set {1, 2, 3, 4, 5}.\nExamples:\nInput: n = 20\nOutput: 10\nExplanation: The numbers whose digits are from the given set are: 1, 2, 3, 4, 5, 11, 12, 13, 14, 15.\nInput: n = 100\nOutput: 30\nConstraints:\n1 ≤ n ≤ 105"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley"
      ],
      "topic_tags": [
        "Arrays",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/largest-element-in-array4009/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:23:59.718286",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Largest Element in Array",
      "difficulty": "Basic",
      "accuracy": "67.48%",
      "submissions": "471K+",
      "avg_time": "20m"
    },
    "content": {
      "problem": "Given an array arr[]. The task is to find the largest element and return it.\nExamples:\nInput: arr[] = [1, 8, 7, 56, 90]\nOutput: 90\nExplanation: The largest element of the given array is 90.\nInput: arr[] = [5, 5, 5, 5]\nOutput: 5\nExplanation: The largest element of the given array is 5.\nInput: arr[] = [10]\nOutput: 10\nExplanation: There is only one element which is the largest.\nConstraints:\n1 <= arr.size()<= 106\n0 <= arr[i] <= 106"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Infosys",
        "Oracle",
        "Wipro",
        "Morgan Stanley"
      ],
      "topic_tags": [
        "Arrays",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/binary-tree-to-dll/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:24:10.077151",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Binary Tree to DLL",
      "difficulty": "Hard",
      "accuracy": "53.36%",
      "submissions": "162K+",
      "avg_time": "60m"
    },
    "content": {
      "problem": "Given a Binary Tree (BT), convert it to a Doubly Linked List (DLL) in place. The left and right pointers in nodes will be used as previous and next pointers respectively in converted DLL. The order of nodes in DLL must be the same as the order of the given Binary Tree. The first node of Inorder traversal (leftmost node in BT) must be the head node of the DLL.\nNote: h is the tree's height, and this space is used implicitly for the recursion stack.\nExamples:\nInput:\n1\n/  \\\n3    2\nOutput:\n3 1 2\n2 1 3\nExplanation: DLL would be 3<=>1<=>2\nInput:\n10\n/   \\\n20   30\n/   \\\n40   60\nOutput:\n40 20 60 10 30\n30 10 60 20 40\nExplanation: DLL would be 40<=>20<=>60<=>10<=>30.\nConstraints:\n1 ≤ Number of nodes ≤ 105\n0 ≤ Data of a node ≤ 105"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(height of the tree)"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley",
        "Accolite",
        "Amazon",
        "Microsoft",
        "Snapdeal",
        "Goldman Sachs",
        "Salesforce"
      ],
      "topic_tags": [
        "Linked List",
        "Tree",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/nth-node-from-end-of-linked-list/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:24:20.775951",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Kth from End of Linked List",
      "difficulty": "Easy",
      "accuracy": "41.18%",
      "submissions": "420K+",
      "avg_time": "30m"
    },
    "content": {
      "problem": "Given the head of a linked list and the number k, Your task is to find the kth node from the end. If k is more than the number of nodes, then the output should be -1.\nExamples\nInput: LinkedList: 1->2->3->4->5->6->7->8->9, k = 2\nOutput: 8\nExplanation: The given linked list is 1->2->3->4->5->6->7->8->9. The 2nd node from end is 8.\nInput: LinkedList: 10->5->100->5, k = 5\nOutput: -1\nExplanation: The given linked list is 10->5->100->5. Since 'k' is more than the number of nodes, the output is -1.\nExpected Time Complexity: O(n).\nExpected Auxiliary Space: O(1).\nConstraints:\n1 <= number of nodes <= 106\n1 <= node->data , x <= 106\n1 <= k <= 106"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Flipkart",
        "Morgan Stanley",
        "Accolite",
        "Amazon",
        "OYO Rooms",
        "Samsung",
        "Snapdeal",
        "FactSet",
        "Hike",
        "MAQ Software",
        "Adobe",
        "Qualcomm",
        "Epic Systems",
        "Citicorp",
        "Monotype Solutions"
      ],
      "topic_tags": [
        "Linked List",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Maq Software Interview Experience Set 8 Off Campus For Software Engineer 1",
        "url": "https://www.geeksforgeeks.org/maq-software-interview-experience-set-8-off-campus-for-software-engineer-1/",
        "content_summary": "First Round (Technical Round on Skype (45 minutes ) Q1-some Questions from my resume. Q2-Program for Factorial and how to calculate factorials of large numbers. Q3-Detect a loop in linked list and find the middle node in linked list. Q4-Given a stream of number which are added to the array A[]. find the middle element of the stream. Q5-What is indexing and hashing in DBMS. Q6-Interface in Java. Q7-Difference between Abstraction and Encapsulation. Q8-Multithreading in Java. Second Round Techincal on Skpye (1:30 Hour) Q1-Find the common element in three sorted arrays. optimized approach. Q2-Project Discussion and limitations of the project(First Project).and how you will handle the limitations. Q3-Given 100 balls in which one ball is defective.you also have a balance tell minimum number of steps to find the defective ball. Q4- Write the complexity of the Above puzzle & generalize it for n balls. Q5-Given an linked list find the nth element from the last node. Q6-What is deadlock.what are the conditions for occurring deadlock. Q7-What is Semaphore? Types of semaphore. Q8-What are joins in SQl.Difference between left outer join and right outer join? Q9-write Three commands for DDL,DML,DCL? Q10-What is Transaction in DBMS and also tell the ACID properties? Q11-What is RollBack & savepoint in Transactions. Q12-you have given a employee table in which you have their salary and employee name.      Write a query to find the nth highest salary and the employee name. Third Round Skype ( 1:30 Hour) Q1-Project Discussion Summery Generator using probabilistic model in deep.What was your role in the project.What are the advantages of the project. Q2-Why did you used probabilistic model? why did you not used Vector space model. Q3-On Which technology you have worked till now? Q4-Given a series (6+6*4+6*4*4+6*4*4*4+....so on). write a code to find the nth term of the series. Q5-Tower of Hanoi Problem & time complexity. Q6-What is polymorphism? type of polymorphism. Q7-Static Keyword in c++. Q8-Final keyword in java. Q9-What is constructor and types of constructor. Q10-Life Cycle of a Applet in Java beacuse i had used java applets in my project GUI. Q11-what is Function Overloadig & function overriding and virtual functions. Fourth Round Skpye (30 minutes) Q1-Tell me about yourself? Q2-Tell me your strength and weekness. Q3-Family background? Q4-why do you want to join? Thanks Geeksforgeeks Team.\nAll Practice Problems for MAQ Software !\n\nComment\nMore info\nCampus Training Program\nNext Article\nMAQ Software Interview Experience | Set 8 (Off Campus for Software Engineer-1)"
      },
      {
        "title": "Accolite Interview Experience Set 3 On Campus",
        "url": "https://www.geeksforgeeks.org/accolite-interview-experience-set-3-on-campus/",
        "content_summary": "Written MCQ There were 20 multiple choice questions to be done in 30 minutes time and most of the technical questions were from https://www.geeksforgeeks.org/, one blood and relation question and one simple probability question. There was no negative marking. Paper Coding round 21 students were shortlisted from the 1st MCQ round and in this round we were asked to write the codes (function only) of 3 questions in 1 hour time. Q1. You are given a matrix of size MxN and only possible values in the matrix are 0 - representing empty position 1 – representing a fresh apple 2 – representing a rotten apple A rotten apple converts all the fresh apples to rotten ones which are adjacent to it in 1 unit of time. Given an input the matrix and you have to calculate the amount of time in which all the fresh apples become rotten. Also determine whether all fresh apples could be made rotten in finite time or not. (20 marks) Input 2 1 0 2 1 1 0 1 2 1 1 0 0 2 1 After 1 time unit, the matrix will be transformed to 2 2 0 2 2 2 0 2 2 2 1 0 0 2 2 After 2 time units the matrix will look like 2 2 0 2 2 2 0 2 2 2 2 0 0 2 2 Hence output should be 2 time units. (Definition of adjacent only included the left , right, bottom and upper cell and NOT diagonal cell) Q2. You are given a Binary tree and you need to find out the maximum path sum between any 2 leaf nodes of the binary tree (The maximum path sum may or may not pass through root of tree). To be done in O(n) time (20 marks) Q3. You are given an unsorted array of integers and you need to find out whether there exists a majority element in it. (Majority element is one which appears more than n/2 times in an array of size n). To be done in O(n) time (10 Marks) The result of this round was declared late in the night. Some 7 or 8 students were called for the face to face interview rounds. I was the first one to be called and F2F rounds started at 11.30 PM and ended up in 5 AM in the morning :-p I was lucky to be free around 1.15 AM Face 2 Face Round 1 Q1. I couldn’t complete my Paper coding round question 1 (rotten apples). She (the interviewer) asked me to rectify the problem in it. I did it with the help of MxN extra space for visited[][] matrix. She said do it inplace. I did by modifying the Matrix values to 3 , 4 , etc. Q2. Find 5th from last element in a singly linked list. Firstly I gave a solution which took two traversals. She said to do it in 1 traversal only. I did it by taking two pointers and maintaining a distance of 5 nodes between them. Q3. You are given a string for example if input string is “I am abc xyz”. Output should be the modified string as “xyz abc am I” .This was to be done inplace and in O(n) time. Q4. You are given a unsorted array of both positive and negative integers. You need to find out the maximum sum subarray in O(n) time. You need to find the start and ending indexes along with the sum. Q5. You are given a BST and two keys k1 and k2. You need to find out the lowest common ancestor of the two keys Iteratively. I suggested the solution of storing the path in a vector and finding the 1st mismatch of key value in the root to k1 and root t k2 path. Face to Face round 2 Q1. Take the example of paper coding round rotten apples question and suggest some algorithm where you are allowed to change the position of rotten and fresh apples in such a way that the resultant matrix converts least number of fresh apples to rotten apples. I suggested an approach where I would first count the number of rotten and fresh apples initially and arrange all fresh apples in a sub-matrix starting from (0, 0) position and similarly arrange all rotten apples in sub-matrix from (N-1, M-1) position. He was satisfied with this approach Q2. You are given an elevator system with 3 elevators, you have to suggest some algorithm in which the amount of time that a person waiting on some x floor and has pressed the up or down button should wait for least amount of time and also the person inside the elevator also should not wait for too long to reach his destination floor. Q3. Asked some general questions as to what are tokens of a language. What is a grammar and production rules. Then he asked me to check whether a given code in some language is syntactically correct or not. You are provided the set of valid tokens for this language and also symbol table. Q4. You are given a text file storing characters or words. Suggest some way to compress the file such that there is always some amount of space compression possible. I suggested to use a trie tree as all the prefixes will share the space. He said this approach is dependent on whether the input has common prefixes or not. Suggest some other way. I then said that we can use Huffman Encoding and assign smallest code to most frequent word in the file and so on. He said again this approach also is dependent on whether your input has frequently occurring words or not. Then I suggested that since all characters can be represented in terms of 8 bits or 1 byte. We can take the XOR of prev and next character and store it in the current character position. This way I would be able to always get a n/2 size reduction in the encoded file. The idea was similar to https://www.geeksforgeeks.org/xor-linked-list-a-memory-efficient-doubly-linked-list-set-1/ He was satisfied and this was the end of my 2nd F2F round. He told me to get some sleep because you will be having a skype interview with our technical manager followed by HR round in the morning. 3rd round (Skype) Q1. He asked me to define NP and NP hard problems followed by the definition of automata and regular language. He then asked me are regular expressions. Q2. He shared a google doc with me and gave me a regular expression like abab*(a|b) and an input string s. I needed to write a code to check whether the given input string could be generated from this regular expression or not. Return a Boolean true or false value. I coded it up in 5 minutes :-p Q3. You are given a N-ary tree and a value K. You need to return true if there exists some root to leaf path having sum = k and false otherwise. I did it using recursion and in O(n) time. He told me that you’ll be having your final HR round in some time. I knew that I was going well because he seemed to be quite satisfied with my answers. Final HR round That was the round for which I’ve been waiting for hours She (the HR) started off with some general questions like tell me about yourself and your aims and goals in life. What are your hobbies. I told her that I love art and craft. She asked me what will I make for her if tomorrow is her birthday :-p She was very friendly and nice to talk to. It didn’t seem that I was talking to the HR. It was more like talking to a friend. She asked me what I liked about Accolite and why do I wish to join the company and stuff. Finally we discussed about the pay-scale and work culture in Accolite.\nRelated Practice Problems\nXOR Linked List\nMaximum path sum\nMajority Element\nn'th node from end of linked list\nLowest Common Ancestor in a BST\nReverse words in a given string\nKadane's Algorithm\nRotten Oranges\nAll Practice Problems for Accolite !\n\nComment\nMore info\nCampus Training Program\nNext Article\nAccolite Interview Experience | Set 3 (On-Campus)"
      },
      {
        "title": "Adobe Interview Experience For Mts 1 2",
        "url": "https://www.geeksforgeeks.org/adobe-interview-experience-for-mts-1-2/",
        "content_summary": "First, there was an online round on cocubes of 1 hr 30 min. 1hr was for aptitude which consisted of 60 questions(mental ability, comprehensive, reasoning) and next 30 min was for 2 coding questions that were very basic. Accuracy required in aptitude as coding questions were done by all and aptitude made all the difference. Candidates shortlisted were called for interview in their office. Round 1: \nFirst, he asked me to brief about yourself and there was a long discussion about my projects and their applications. As I mentioned the github link for all the projects, he visited my profile and checked my repositories and asked about github and the tools I have used.\nDetect the loop in the linked list and then find the point from where the loop started. he then asked to write the code. https://www.geeksforgeeks.org/problems/detect-loop-in-linked-list/1\nSearch in row-wise and column wise sorted matrix. https://www.geeksforgeeks.org/problems/search-in-a-matrix17201720/1  he emptied some cells in the matrix and asked how to insert the number in the matrix. only logic was required.\nWhat are threads and processes? Can two threads in a process communicate? Is communication possible between two threads of two different processes? https://www.geeksforgeeks.org/inter-thread-communication-java/   https://www.geeksforgeeks.org/inter-process-communication/\nRound 2:\nFirst the small introduction and then he asked to rate my favorite(java) programming language.\nAgain the same question of the linked list was asked in the 2nd round but this time he asked me to prove my solution. Proof of solution of slow and fast pointer concept to find the meeting point was asked. He wants me to answer that the point where slow and fast pointer meets is the midpoint of the whole linked list. https://www.geeksforgeeks.org/problems/detect-loop-in-linked-list/1\nFind the nth node from the end of a linked list and write the code. https://www.geeksforgeeks.org/problems/nth-node-from-end-of-linked-list/1\nPostorder traversal of a tree and code it.\nDifference between mutex and semaphore. Difference between the mutex and binary semaphore.\nAt last, a long discussion of about 45min on the implementation of hashmap was held. He made a class where hashcode method and equals method of object class was overridden. the object of the class was the key and many values were put in the hashmap and the output was asked along with the size of an array used in a hashmap and then their time complexity. He changed the implementation of the above 2 methods 4 times and then asked the same questions. For Ex, if hashcode return 1 and equals method return true always then every time value is overwritten and size of an array is 1 and complexity is O(1) as the complexity of hashcode and equals method is O(1).\nThen again discussion continued on hashmap. Given a class of city which contains all the malls in it and a class of mall which contains cities in which it is present. what should be done to make both city and mall to act as a key of the hashmap. Here runtime polymorphism was used where a base class was made with equals and hashcode method which is inherited by both city and mall class. https://www.geeksforgeeks.org/internal-working-of-hashmap-java/\nRound 3:\nhttps://www.geeksforgeeks.org/problems/rotate-by-90-degree-1587115621/1\nif you have a directory of many files then how will you find the duplicate files or which data structure is best for performing that search of duplicate files. Ans: hashmap. this technique is used by WhatsApp to remove all the duplicate messages like forwarded messages.\nHe scanned my resume and asked me to detail about my all the projects and many questions were asked related to it. All the technical problems faced etc.\nAs I was the vice-captain of volleyball so he asked about the duties of a captain. Is it possible to have a captain and a vice-captain not in playing six?\nRound 4 (HR): General discussion. The evaluation was not done in this round. Asked me about good and bad of adobe. He explained everything about Adobe its culture its spread its new technologies. My Feedback from previous interviewers was discussed. Finally, I got the offer. Thank you, Geeks For Geeks for providing study material.It helped a lot.\n\nComment\nMore info\nAdvertise with us\nNext Article\nAdobe Interview Experience (For MTS-1)"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/swap-kth-node-from-beginning-and-kth-node-from-end-in-a-singly-linked-list/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:24:37.583395",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Swap Kth nodes from ends",
      "difficulty": "Medium",
      "accuracy": "35.5%",
      "submissions": "61K+",
      "avg_time": "45m"
    },
    "content": {
      "problem": "A singly linked list and an integer of k are given. You need to swap the kth node from the beginning and the kth node from the end of the linked list. Swap the nodes through the links. Do not change the content of the nodes.\nNote: The driver code will output \"true\" if you successfully swap the nodes.\nExamples:\nInput: LinkedList: 1->2->3->4, k = 1\nOutput: true\nExplanation: Here k = 1, hence after swapping the 1st node from the beginning and end the new list will be 4->2->3->1.\nInput: LinkedList: 1->2->3->4->5, k = 7\nOutput: true\nExplanation: k > n. Swapping is invalid. Return the head node as it is.\nExpected Time Complexity: O(n)\nExpected Auxillary Space: O(1)\nConstraints:\n1 <= number of nodes <= 103\n1 <= node->data <= 106\n1 <= k <= 103"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley",
        "Amazon"
      ],
      "topic_tags": [
        "Linked List",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/clone-a-linked-list-with-next-and-random-pointer/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:24:48.263389",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Clone List with Next and Random",
      "difficulty": "Hard",
      "accuracy": "64.8%",
      "submissions": "112K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "You are given a special linked list with n nodes where each node has two pointers a next pointer that points to the next node of the singly linked list, and a random pointer that points to the random node of the linked list.\nConstruct a copy of this linked list. The copy should consist of the same number of new nodes, where each new node has the value corresponding to its original node. Both the next and random pointer of the new nodes should point to new nodes in the copied list, such that it also represent the same list state. None of the pointers in the new list should point to nodes in the original list.\nReturn the head of the copied linked list.\nNOTE : Original linked list should remain unchanged.\nExamples:\nInput: head = [[1, 3], [3, 3], [5, NULL], [9, 3]]\nOutput: head = [[1, 3], [3, 3], [5, NULL], [9, 3]]\nExplanation:\nNode 1 points to Node 2 as its NEXT and Node 3 as its RANDOM.\nNode 2 points to Node 3 as its NEXT and Node 3 as its RANDOM.\nNode 3 points to Node 4 as its NEXT and NULL as its RANDOM.\nNode 4 points to NULL as its NEXT and Node 3 as its RANDOM.\nInput: head = [[1, 3], [2, 1], [3, 5], [4, 3], [5, 2]]\nOutput: head = [[1, 3], [2, 1], [3, 5], [4, 3], [5, 2]]\nExplanation:\nNode 1 points to Node 2 as its NEXT and Node 3 as its RANDOM.\nNode 2 points to Node 3 as its NEXT and Node 1 as its RANDOM.\nNode 3 points to Node 4 as its NEXT and Node 5 as its RANDOM.\nNode 4 points to Node 5 as its NEXT and Node 3 as its RANDOM.\nNode 5 points to NULL as its NEXT and Node 2 as its RANDOM.\nInput: head = [[7, NULL], [7, NULL]]\nOutput: head = [[7, NULL], [7, NULL]]\nExplanation:\nNode 1 points to Node 2 as its NEXT and NULL as its RANDOM.\nNode 2 points to NULL as its NEXT and NULL as its RANDOM.\nConstraints:\n1 <= n <= 100\n0 <= node->data <= 1000"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Flipkart",
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "OYO Rooms",
        "Snapdeal",
        "D-E-Shaw",
        "MakeMyTrip",
        "Ola Cabs",
        "Walmart",
        "Adobe",
        "BankBazaar"
      ],
      "topic_tags": [
        "Linked List",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Bankbazaar Com Interview Experience Set 7 Senior Android Developer",
        "url": "https://www.geeksforgeeks.org/bankbazaar-com-interview-experience-set-7-senior-android-developer/",
        "content_summary": "Position : Senior Android Developer The competency would be Tech Fit (Problem Solving, Data Structures & Algorithm) First Round: Telephonic Round: 1. Clone a linked list with next and random pointer https://www.geeksforgeeks.org/a-linked-list-with-next-and-arbit-pointer/ 2. You have to design a data structure where you have a list. You need to do 3 operations 1. Insert at position. 2. Get Value from an index. 3. Update all index All in time complexity O(1). Hint : I have used count for each index and have extra variable to store value if user call Update all index. With the help of count you can determine if you have to pick value from index or from extra update variable. On-site round in banglore Second round: 1. Question related to project. 2.We have n cards with each card numbered from 1 to n. All cards are randomly shuffled. We are allowed only operation MoveCard(n) which moves the card with value n to the top of the pile. We need to sort the pile of cards with minimum number of MoveCard operations. The naive approach which i can think of is start with MoveCard(n), MoveCard(n-1), MoveCard(n-2).... MoveCard(1). This approach will solve the problem in n MoveCard operations. https://stackoverflow.com/questions/21852309/sort-a-deck-of-cards-with-minimum-number-of-moves Third Round: 1. It was the variation of tree Common Ancestor problem and linked-list Y node problem. I don't remember exactly but if you know these two you will be able to answer. 2. Longest Increasing Subsequence https://www.geeksforgeeks.org/dynamic-programming-set-3-longest-increasing-subsequence/ Fourth Round: 1. 100 people are standing in a circle with gun in their hands. 1 kills 2, 3 kills 4, 5 kills 6 and so on till we are left with only one person. Who will be the last person alive. Write code to implement this efficiently. 2. java circular dependency questions. 3. Some basic questions 4. Write a program with two threads (A and B), where A prints 1 , B prints 2 and so on until 50 is reached. Thanks GFG  \nRelated Practice Problems\nClone a linked list with next and random pointer\nSort the pile of cards\nLongest Increasing Subsequence\nAll Practice Problems for BankBazaar !\n\nComment\nMore info\nCampus Training Program\nNext Article\nBankBazaar.com Interview Experience | Set 7 (For Senior Android Developer)"
      },
      {
        "title": "Ola Cabs Interview Experience Set 2 Android 1 5 Years",
        "url": "https://www.geeksforgeeks.org/ola-cabs-interview-experience-set-2-android-1-5-years/",
        "content_summary": "First Round Written Test 1) Implement Stack Operations. Also maintain count of Largest Integer present in Stack at any given point of Time. 2) Implement Minesweeper Game. 3) Design an Android application to emulate Countdown .. Take Input from the User and start counting down from entered value till Zero with Updating App UI at every count. Show Countdown end message when reached at Zero 1st Round. Lots of Java basics Android Activity lifecycles and detailed discussions about it Services and Fragments Lifecycle. Difference methods of Creating Threads One fragment Related Coding problem where UI of Fragment B has to be updated from fragment A. How Garbage Collector Works in Android. Questions on Dalvik Virtual Machine. Different types of BroadCasts and Broadcast Receivers 2nd Round DS Questions Find Total number of leaf Nodes in B-tree Clone Linklist with random pointers. Find Missing number in AP. Print Left View of B-Tree. Some Java Questions based Exceptions 3rd Round Current Project Discussion. Few questions related to that. Questions on Telephony Class and Geofencing. Problem related to Reverse geocoding. Persistent Storage types in Android. Discussion on Content Providers and Shared Preferences. Coding on Content providers Given a rotated array 'K' times (K unknown), find a number in most efficient way. Scheduling algorithms in OS. (Implement LRU using choice of your language) BFS traversal of B Tree. Key is to Stay ultra confident, smile and try solving each problem with whatever way you know. Good Luck.\nRelated Practice Problems\nCount Leaves in Binary Tree\nLevel order traversal\nClone a linked list with next and random pointer\nArithmetic Number\nAll Practice Problems for Ola-Cabs !\n\nComment\nMore info\nCampus Training Program\nNext Article\nOLA Cabs Interview Experience | Set 2 (For Android - 1.5 Years)"
      },
      {
        "title": "Makemytrip Interview Experience Set 4",
        "url": "https://www.geeksforgeeks.org/makemytrip-interview-experience-set-4/",
        "content_summary": "Round 1 : Written : Q1. Given a stream of around billion numbers in an array, which has approximately only 1000 unique numbers. Print the unique numbers. Complexity should be less than O(n). Eg: Input: 1,1,1,1,….2,2,2,…3,4,4,4,4……1111,1111,……….. Output : 1,2,3,4,1111 Q2: Write a program to print the frequency of all words in a given paragraph. Q3: Write a program to reverse the string word wise. Eg: I/P : “I am a boy” O/P: “boy a am I” Q4: Write a program to explain producer consumer program using threads. Q5: (Only theory) What data structures will you use to design a garbage collector. Round 2: F2F Q1: Given an array in which all numbers except two are repeated once. (i.e. we have 2n+2 numbers and n numbers are occurring twice and remaining two have occurred once). Find those two numbers in the most efficient way Q 2 : Given a linked list with next and arbitrary pointers, clone it. Q 3 : A lot of questions around Spring, Hibernate, REST, Dependency Injection, AOP etc. Q4 : Reverse a linked list in groups of n. Round 3: F2F Q1: Vertical level order traversal of a tree. Q2: Reverse the second half of the linked list in the most efficient way. Q3: Find the merging point of two linked list. Q4: Write a function to generate all possible n pairs of balanced parentheses. For example, if n=1{} for n=2 {}{} {{}} Q5 : Again a lot of drilling questions on Java, Spring, MVC, Singleton, Hibernate, REST. Round 4 : F2F (Manager/Architect) This round had questions more around various technology stacks, Design Patterns ( Interceptor, Singleton, Publisher Subscriber, MVC etc etc ) UI Templates REST Spring Java In memory database Log appenders Round 5: F2F ( H.R. ) Generic questions like why do you want to join Makemytrip. What are your career aspirations. How do you think it aligns with MMT. Thanks to geeksforgeeks for the awesome database of questions, that helped me clear the interview.\nAll Practice Problems for MakeMyTrip !\nRelated Practice Problems\nPrint a Binary Tree in Vertical Order\nIntersection Point in Y Shapped Linked Lists\nClone a linked list with next and random pointer\nReverse a Linked List in groups of given size.\nFinding the numbers\n\nComment\nMore info\nCampus Training Program\nNext Article\nMakeMyTrip Interview Experience | Set 4"
      },
      {
        "title": "Makemytrip Interview Experience Set 8 On Campus",
        "url": "https://www.geeksforgeeks.org/makemytrip-interview-experience-set-8-on-campus/",
        "content_summary": "MakeMyTrip recently visited our campus. There were 4 rounds. Online Round ( 1 Hour ) This round consisted of 20 aptitude questions and 3 coding Questions. Coding Questions: 1. Find ‘x’ in the equation. The input is in the form of a string. Equation consisted of addition operator only and 2 integers and a variable ‘x’. Sample Input Case: x+3=5 output=2 Decoding the string into 2 numbers and an unknown variable took a lot of time. 2. Given two numbers x and y find x^y in log y time. 3. Find the next palindromic number greater than the current number. Had solved all 3 questions and around 15 questions in aptitude. Was shortlisted for the next round. Technical Interview 1 ( 1 Hour 20 mins ) Firstly the interviewer asked me to introduce myself, asked me about my projects. Then he moved on to coding questions and puzzles and some basic object oriented fundamentals: All the questions below were in random order. 1. Questions related to collections, interfaces, JBM, JDE, Polymorphism and Abstraction. 2. Coding question : Full codes to be written a> Given an array comprising of only 1’s and 0’s , find the maximum length along with the starting indexand ending index which consisted equal number of 1’s and 0’s. I could not do it, the interviewer gave me another question: Given an array comprising of any number ( both positive and negative), find the maximum length alongwith starting and ending index which had sum equal to 0. I was able to do this one. The interviewer told me to solve the previous question now. I told him that replace all the 0’s with -1’s and the question becomes entirely the same. b> To Check whether a binary tree is a BST or not? 3. Puzzles: 1. There are 3 switches outside a room. Inside the room there is only 1 bulb. You could go inside the room only once, how will you know with which bulb the switch is associated with. 2. There are 100 coins in a table. 20 coins are heads and others are tails (facing upwards). Find the optimal cut(2 piles) such that both have equal number of heads facing up.Technical Interview 2 ( 1 hr ) Technical Interview 2 ( 1 hr ) Coding Questions: 1. Cloning Linked List with every node comprising of next and (random pointer to any other node). 2. Detect Loop in a Linked List and remove it. 3. In-place reversing of a string. Questions about abstract data type, abstract keyword, difference between C++ and Java, garbage collection in Java and OOPS concepts were asked. HR Round ( 20 mins ) Basic details, family background and why do you want to join this company? Where do you see yourself after 5 years and questions about weakness and strengths.\nAll Practice Problems for MakeMyTrip !\nRelated Practice Problems\nPower of Numbers\n\nComment\nMore info\nCampus Training Program\nNext Article\nMakeMyTrip Interview Experience | Set 8 (On-Campus)"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/remove-loop-in-linked-list/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:25:12.866994",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Remove loop in Linked List",
      "difficulty": "Medium",
      "accuracy": "27.66%",
      "submissions": "515K+",
      "avg_time": "45m"
    },
    "content": {
      "problem": "Given the head of a linked list that may contain a loop.  A loop means that the last node of the linked list is connected back to a node in the same list. The task is to remove the loop from the linked list (if it exists).\nCustom Input format:\nA head of a singly linked list and a pos (1-based index) which denotes the position of the node to which the last node points to. If pos = 0, it means the last node points to null, indicating there is no loop.\nThe generated output will be true if there is no loop in list and other nodes in the list remain unchanged, otherwise, false.\nExamples:\nInput: head = 1 -> 3 -> 4, pos = 2\nOutput: true\nExplanation: The linked list looks like\nA loop is present in the list, and it is removed.\nInput: head = 1 -> 8 -> 3 -> 4, pos = 0\nOutput: true\nExplanation:\nThe Linked list does not contains any loop.\nInput: head = 1 -> 2 -> 3 -> 4, pos = 1\nOutput: true\nExplanation: The linked list looks like\nA loop is present in the list, and it is removed.\nConstraints:\n1 ≤ size of linked list ≤ 105"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "VMWare",
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "Snapdeal",
        "MakeMyTrip",
        "Oracle",
        "Walmart",
        "Goldman Sachs",
        "Adobe",
        "Qualcomm",
        "Kuliza",
        "Netskope"
      ],
      "topic_tags": [
        "Linked List",
        "two-pointer-algorithm",
        "Data Structures",
        "Algorithms"
      ]
    },
    "interview_experiences": [
      {
        "title": "Vmware Interview Experience Set 9 Internship Rd",
        "url": "https://www.geeksforgeeks.org/vmware-interview-experience-set-9-internship-rd/",
        "content_summary": "Vmware conducted their online exam via hirepro. Round 1 : There were 3 sections quants, Technical questions and OOPs based questions, no section had negative marks and all questions were MCQs. The quantitative section had 10 questions and we were given 15 minutes, the questions covered all the typical quants topics (like time and work, mixtures & allegations etc.). The questions were hard and were time consuming the trick was to identify the questions you could solve(I could solve only 4). Next there were 23 technical questions, they were easy and medium level, from all topics(OS, CN, Computer Architecture etc.). Then we had a choice before the OOPs section to opt for either Java or C++, I chose java and had to answer 7 tricky questions mostly focusing on inheritance and how constructors work with inheritance. Around 150 students gave the first round from which 42 progressed. Round 2: This was a face to face technical round. I introduced myself and then the interviewer directly jumped onto my projects and asked me to talk about them. I had made an android app which I showed him(I carried my phone) my second project particularly took his attention which was based on Machine Learning I had to explain my project in detail for about 15-20 minutes. He asked me questions on all topics like OOPS, Data Structures, OS, CN. Before beginning he asked me to rate my proficiency in c,c++& JAVA on a scale from 1 to 10. To the best of my memory the questions were: 1) Explain properties of OOPS. (tried to confuse me) 2) Types of constructors. (wanted to hear copy constructor and how it is defined in different ways in c++ and java.) 3) Gave me a typical inherent scenario and asked me how parent class and child class default constructors are called. 4) Asked me to detect& remove loop in a linked list. (I told him I already knew the algo. so we moved on) 5) Asked me to write the expression for height of a complete binary tree. 6) Array to BST (tried to convince me a solution which could give a skewed tree was better) 7) Asked me about different CPU scheduling algo and made me solve a given scenario for wait time and turn around time using different scheduling algos. 8) Asked me about gateway routers and asked me to calculate subnet mask for a given range of IPs. The interviewer tried to pressure me into changing my answers being confident was the key. Round 2 : This was the second technical face to face round. My interviewer was problem-solvingmmediately made me comfortable. After talking about my project in detail, he moved on to problem solving and asked me just 2 questions. 1) Given a sparse 2D matrix (containing 0s and 1s) I had to make all entries of a row and column '1' which had at least one entry as '1'. I gave a O(n^2) solution using hashing he asked me to write down the complete code. 2) In a binary tree find the the level with maximum number of nodes. A typical solution would be Level order traversal but I gave a different solution by connecting all the nodes in a particular level. 6 students cleared the 2nd technical round. Round 3: It was a managerial discussion round, which was basically a telephonic interview with the manager. Other students were asked few technical questions , the interview was more focused on judging your attitude and if you were a good fit for the team. My telephonic interview was mostly about my Machine Learning project, mild business acumen and why I wanted to do an internship at Vmware. Round 4: The final round was the hr round, I was asked about my family background and what would be my reaction if I don't get this internship. Finally all 6 who cleared the technical rounds were selected for a 6 months internship at Vmware, Bangalore. Also we were given vmware bottles :p\nRelated Practice Problems\nMaximum Width of Tree\nRemove loop in Linked List\nHeight of Binary Tree\nArray to BST\nBoolean Matrix Problem\nAll Practice Problems for VMWare !\n\nComment\nMore info\nCampus Training Program\nNext Article\nVmware Interview Experience | Set 9 (Internship (R&D))"
      },
      {
        "title": "Walmart Labs Interview Experience Set 2 On Campus",
        "url": "https://www.geeksforgeeks.org/walmart-labs-interview-experience-set-2-on-campus/",
        "content_summary": "1st round (Written Test) It was an online test of 90 minutes and was conducted on Hackerearth. It consisted of 10 MCQ’s and 3 coding questions. MCQ’s consisted of general aptitude questions, questions related to networking, programming etc and very easy. The coding questions were as follows: 1. http://www.spoj.com/problems/FARIDA/. The question was exactly this. (standard dp problem). (35 marks for this question). 2. Given arrival and departure time of employees in an office. Find the maximum no of chairs needed so that at no instance, an employee has to stand. (30 marks question). Example- Input- 5.00 6.00 7.00 6.30 7.00 8.00 Output-2 It is similar to this. The main thing in this question was reading the input as number of employees was not given beforehand. It was also asked to check for all INVALID inputs and return -1 in those cases. 3. Given a 2D matrix of n x m. The matrix contained integers. Given a source position of a person and a destination position, find the number of ways in which that person can reach destination from source fulfilling the following conditions- (i) Movement can be only in north, south, east or west direction. (ii) A person can move from one cell to other if and only if that cell has value less than the value in current cell. (standard bfs problem). (25 marks question). 2nd round (Technical Interview)- 1. Given a binary tree, print its bottom view. She asked me to write the code on paper. 2. Given a character array and a dictionary, find the no. of valid sentences that can be made by putting space after any character in this array. A valid sentence is the one whose all the words are present in the dictionary. Write code on paper. Example- Input- catsanddog Output- 2 (cat sand dog & cats and dog) 3. Given an array of random integer, find the maximum length of subsequence in it such that the elements of subsequence are consecutive. Example- input [25,1,26,2,27,3,29,28] Ans=5 (subsequence 25,26,27,29,28} I told her a brute force method of O(n^2) and a O(nlogn) solution but she was looking for a O(n) dp solution. This round lasted for about 1 hour. 3rd round (Technical Interview)- 1. Given an array and a frog, there can be a bridge from any index to any index in forward direction and a tunnel from any index to any other index in backward direction. Frog is initially at -1 index. Given an integer k, from can hop at most k-1 times. i.e. if k=4 and frog initially is at -1, then it can reach cell 0,1,2 (3 hops at max). A frog on landing on a cell containing a bridge or a tunnel can avoid using that bridge or tunnel and stay there only. Find the minimum no. of steps in which the frog can reach a given destination ‘D’. I converted the whole problem into a graph where each node will have connections to its next k-1 nodes and also connection to a node to which a bridge or tunnel on that node leads (if any bridge or tunnel is there at that node) and then Applied BFS. He then asked me to write code on paper. Complexity-O(n*k) 2. Given a linked list having loop, detect the loop and return the starting point of that loop. 3. He asked me about what is map (general concept of map not language specific as in c++ or java). He then told me to design a data structure using the basic data structures such that searching in that can be done in O(1) in 95% cases and in 5% cases searching can take more than O(1) and the element to be searched can be an integer or a string. I told him to take hash of string in any way (multiplying by prime nos etc.) and then take modulo 10^6 as maximum size of array can be 10^6. He then asked me how will I remove collisions occurring due to same hash value. I told him to use chaining with a balanced BST at the collision index in order to achieve minimum complexity (o(logn)). He then asked me that if suppose during 1 year only 100 elements were required to be stored in array and searched in above problem and after 1 year elements become 10^6, then during 1 year a lot of memory will be wasted if I allocate 10^6 initially; he asked me how would I do this. I told him that initially allocate memory of array of 100 size and then after 1 year, allocate a new memory of 10^6 elements and copy elements from original array to new array. This round lasted for about 1 hour. 4th round (Managerial Round)- It was a short round of nearly 10-15 minutes. The interviewer asked me to introduce myself. He then asked me why do I want to join Walmart. Why don’t I want to pursue higher studies, difference between job and career and what does I want, job or a career? He then asked me what do I want to achieve in the next 5 Years. He then asked a brief description about the project mentioned in my resume. 5th round (HR Round)- It was also a short round of nearly 5-10 minutes. HR asked me to introduce myself. Asked me about my hobbies. One of my hobbies mentioned was reading newsfeed on quora so she asked whether Iwas active on quora and what all topics do I follow on quora. She then asked me why do I want to join Walmart, where do I see myself in 2 years. She asked me if I had interest in programming and on what websites do I take part in coding competition. I mentioned codeforces, codechef, hackerrank. She then told me about work at Walmart and asked me whether I would like to work on web development front and back end or back end of logistics. Advice: Prepare all the data structures from geeksforgeeks, maximum question asked were from geeks only. Think aloud in the interview. The interviewer will help by giving hints whenever u will be stuck at any problem.\n\nAll Practice Problems for Walmart !\nRelated Practice Problems\nBottom View of Binary Tree\nLongest consecutive subsequence\nWord Break\nRemove loop in Linked List\nMinimum Platforms\n\nComment\nMore info\nCampus Training Program\nNext Article\nWalmart Labs Interview Experience | Set 2 (On-Campus)"
      },
      {
        "title": "Makemytrip Interview Experience Set 8 On Campus",
        "url": "https://www.geeksforgeeks.org/makemytrip-interview-experience-set-8-on-campus/",
        "content_summary": "MakeMyTrip recently visited our campus. There were 4 rounds. Online Round ( 1 Hour ) This round consisted of 20 aptitude questions and 3 coding Questions. Coding Questions: 1. Find ‘x’ in the equation. The input is in the form of a string. Equation consisted of addition operator only and 2 integers and a variable ‘x’. Sample Input Case: x+3=5 output=2 Decoding the string into 2 numbers and an unknown variable took a lot of time. 2. Given two numbers x and y find x^y in log y time. 3. Find the next palindromic number greater than the current number. Had solved all 3 questions and around 15 questions in aptitude. Was shortlisted for the next round. Technical Interview 1 ( 1 Hour 20 mins ) Firstly the interviewer asked me to introduce myself, asked me about my projects. Then he moved on to coding questions and puzzles and some basic object oriented fundamentals: All the questions below were in random order. 1. Questions related to collections, interfaces, JBM, JDE, Polymorphism and Abstraction. 2. Coding question : Full codes to be written a> Given an array comprising of only 1’s and 0’s , find the maximum length along with the starting indexand ending index which consisted equal number of 1’s and 0’s. I could not do it, the interviewer gave me another question: Given an array comprising of any number ( both positive and negative), find the maximum length alongwith starting and ending index which had sum equal to 0. I was able to do this one. The interviewer told me to solve the previous question now. I told him that replace all the 0’s with -1’s and the question becomes entirely the same. b> To Check whether a binary tree is a BST or not? 3. Puzzles: 1. There are 3 switches outside a room. Inside the room there is only 1 bulb. You could go inside the room only once, how will you know with which bulb the switch is associated with. 2. There are 100 coins in a table. 20 coins are heads and others are tails (facing upwards). Find the optimal cut(2 piles) such that both have equal number of heads facing up.Technical Interview 2 ( 1 hr ) Technical Interview 2 ( 1 hr ) Coding Questions: 1. Cloning Linked List with every node comprising of next and (random pointer to any other node). 2. Detect Loop in a Linked List and remove it. 3. In-place reversing of a string. Questions about abstract data type, abstract keyword, difference between C++ and Java, garbage collection in Java and OOPS concepts were asked. HR Round ( 20 mins ) Basic details, family background and why do you want to join this company? Where do you see yourself after 5 years and questions about weakness and strengths.\nAll Practice Problems for MakeMyTrip !\nRelated Practice Problems\nPower of Numbers\n\nComment\nMore info\nCampus Training Program\nNext Article\nMakeMyTrip Interview Experience | Set 8 (On-Campus)"
      },
      {
        "title": "Adobe Interview Experience Shecodes Software Engineer",
        "url": "https://www.geeksforgeeks.org/adobe-interview-experience-shecodes-software-engineer/",
        "content_summary": "Recently, I gave an interview for Adobe for the position of Software Engineer. Hiring was done underAdobe Shecodes Hiring 2020 Batch so as the name suggests only female candidates from the Circuit Branches were eligible. There were 6 rounds in total.\nFirst Round -ONLINE TEST - (120 students) :\nSection I: Aptitude and Logical Section Number of Questions: 60 Time Duration: 60 min Level of Difficulty: Medium-High\nType of Questions No. of  Questions\nQuantitative 20\nLogical and Reasoning 20\nVerbal 20\nSection II: Coding Section Number of Questions: 2 Time Duration: 60 min Level of Difficulty: Easy-Medium Type of Questions:  String Manipulation and Tree-based Question. Only 20 students were shortlisted for further rounds.\n**The further mentioned rounds were held in ADOBE  Noida Campus.**\n  Second Round –PEN PAPER ROUND –(20 students*): It was a non-eliminatory round comprising of 3 sections with a total time of 30 minutes.\nSection I: Technical MCQ’s Number of Questions: 20 Level of Difficulty: Medium-High Programming Output questions and questions from CN, DBMS, OS, and DS were asked. Section II: Aptitude and Logical Section Number of Questions: 10 Level of Difficulty: Easy Section III: Coding Section Number of Questions: 2 Level of Difficulty: Easy-Medium Question 1: https://www.geeksforgeeks.org/problems/leaders-in-an-array-1587115620/1 Question 2: https://www.geeksforgeeks.org/problems/spirally-traversing-a-matrix-1587115621/1 *Candidates from other colleges were also there. 20 Students were shortlisted from my college.\nThird Round –TECHNICAL INTERVIEW 1\nThe interview went for about 75-80 minutes. I was not able to answer almost all the answers correctly but gave almost 75% correct answers. The interviewer mainly focused on the problem-solving ability and the quality of conceptual knowledge. We were judged on 5 criteria in all the technical Interviews- DSA, Coding, Puzzles, Testing Questions and Operating system. 1: Basic Introductory Questions 2: 2-3 Puzzle Questions which we can easily find on https://www.geeksforgeeks.org/puzzles/ i: You have a birthday cake and have to cut it into 8 equal pieces by making 3 cuts only. How do you do it? ii: You are standing before two doors. One of the paths leads to heaven and the other one leads to hell. There are two guardians, one by each door. You know one of them always tells the truth and the other always lies, but you don’t know who the honest one is and who the liar is.You can only ask one question to one of them in order to find the way to heaven. What is the question? 3: Some basic Questions on DSA- about stacks, queue, arrays, memory storage accessing, Advantages and Dis of the Linked list over arrays, 4: Operating System: In all the rounds, Operating System questions were asked in abundance. Though the questions were basic, they focused more on our concepts like how easily we were able to explain it to them. Questions on Kernels, Types of Kernel, Why OS, memory allocation in OS were asked. 5: Test Cases Question: We have to think and answer the possible questions while testing the cases. i: Test cases for a login page window. 6: Heavy discussions on the projects I have done. Why we preferred to use a particular technology. What was my role in the project and so on. 7: I was asked to code some questions. i: https://www.geeksforgeeks.org/problems/mirror-tree/1 ii: https://www.geeksforgeeks.org/problems/find-second-largest-element2406/1 iii: https://www.geeksforgeeks.org/problems/remove-loop-in-linked-list/1 After a wait of about 15 minutes, I was called for my second round of Interview.  \nFourth Round -TECHNICAL INTERVIEW 2\nThis round of interview was taken by a senior person of the company. It was a bit lengthy as we had more of a discussion rather than just a QnA round. The interview went for more than 90 minutes and was tougher than the first round. 1: There was a long discussion on what I have written in my resume. The projects I had done, Extracurricular and co-curricular activities I had written on the resume, the skills I have mentioned. All of it. So be careful of whatever you mention in the resume. 2: Next he asked me a bunch of coding questions which were some very popular ones i: https://www.geeksforgeeks.org/problems/anagram-1587115620/1 ii: Implementation of Merge Sort https://www.geeksforgeeks.org/merge-sort/ iii: Implementing Queue using stacks and Stack using queues. iv:  https://www.geeksforgeeks.org/problems/find-first-repeated-character4108/1 I was asked to code in my preferred language. So there wasn’t any language barrier and for all the questions the interviewer asked for the most optimized approach. As I was able to answer all the questions, I wasn’t asked any more questions. 3: After the coding questions, I was asked a lot of questions about Operation System and OOPS. i:   Fragmentation- Internal and External ii:  Concepts of Kernel iii:  File Management iv:  Virtual functions and Friend Functions v:  Function Overloading And Overriding vi: What is paging and Demand Paging? 4: Interview puzzles: i: The mislabeled Jar puzzle https://www.geeksforgeeks.org/puzzle-mislabeled-jars/ ii: Maximize probability of White Ball https://www.geeksforgeeks.org/puzzle-12-maximize-probability-of-white-ball/ iii:  100 Prisoners with Red/Black Hats https://www.geeksforgeeks.org/puzzle-13-100-prisoners-with-redblack-hats/ 5:  Testing Based Questions- i: Five new inventions in a glass frame and the test cases to test the working a frame. ii: Design test cases for a shopping application. The interviewer was quite satisfied with the test cases I answered. As the main trick to solve these kinds of interview questions is to design the test cases by giving every small function an eye and then forming all possible scenarios for the same.  \nFifth Round -TECHNICAL INTERVIEW 3 + MANAGERIAL ROUND\n  This was also similar to the last two Technical Interviews and was also easier from them. The interview went for about 70 minutes and It was tilted more towards the managerial side and less Technical was asked. 1: Program to Count set bits in an integer. (I answered 4 possible solutions to him and he was satisfied)  https://www.geeksforgeeks.org/problems/set-bits0143/1 2: Working of Bubble Sort and Insertion Sort ( I was asked to dry run the solution mainly to check the internal working of swapping and comparison) 3: Torch and Bridge https://www.geeksforgeeks.org/puzzle-18-torch-and-bridge/ 4:  Some Mathematical Puzzles 5: Design test cases for OLA Application 6: Design test cases for GMAIL Application 7: Situation based questions 8: What is a Semaphore and operations on a semaphore? 9: What is context switching?  \nSixth Round - HR INTERVIEW\nIt was the last round and an eliminatory round as well.  The interviewer was pretty cool. After the introduction, I was asked questions like where are you from? What is special about you?  Why should we select you? Which was your favorite subject last semester? Which Adobe products you liked the most and why? It was a 20 minutes long discussion round about college life, interests, and hobbies. The HR also asked our preferred joining location between Noida and Bangalore which gave us many hopes of our selection. Three candidates from our college went to the HR Round. Two days later we received the confirmation mail that two students are selected. HOPE THIS INTERVIEW EXPERIENCE HELPS YOU!!!\n\nComment\nMore info\nAdvertise with us\nNext Article\nAdobe Interview Experience | SHECODES-Software Engineer"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/finding-middle-element-in-a-linked-list/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:25:31.835285",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Middle of a Linked List",
      "difficulty": "Easy",
      "accuracy": "57.93%",
      "submissions": "372K+",
      "avg_time": "20m"
    },
    "content": {
      "problem": "Given the head of a linked list, the task is to find the middle. For example, the middle of 1-> 2->3->4->5 is 3. If there are two middle nodes (even count), return the second middle. For example, middle of 1->2->3->4->5->6 is 4.\nExamples:\nInput: Linked list: 1->2->3->4->5\nOutput: 3\nExplanation: The given linked list is 1->2->3->4->5 and its middle is 3.\nInput: Linked list: 2->4->6->7->5->1\nOutput: 7\nExplanation: The given linked list is 2->4->6->7->5->1 and its middle is 7.\nExpected Time Complexity: O(n)\nExpected Auxiliary Space: O(1)\nConstraints:\n1 <= no. of nodes <= 105"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "VMWare",
        "Zoho",
        "Flipkart",
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "Samsung",
        "Hike",
        "Payu",
        "MAQ Software",
        "Adobe",
        "Wipro",
        "SAP Labs",
        "Qualcomm",
        "Nagarro",
        "GE",
        "Veritas",
        "IgniteWorld",
        "Netskope"
      ],
      "topic_tags": [
        "Linked List",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Vmware Interview Experience Set 4 Campus",
        "url": "https://www.geeksforgeeks.org/vmware-interview-experience-set-4-campus/",
        "content_summary": "Recently, VMWare has visited our campus for hiring interns and they have put a CGPA cut off of 7/10. There were 2 rounds in total. An objective round initially which is then followed by a skype interview round. Round 1 : Online objective round This round was quite similar to the Set-3 VMWare Experience wherein we had 42 objective questions to be solved in 65min with no negative marking. There were 3 sections in total. First section was Logical and Aptitude and there were 15 questions in total. Difficulty : High (There was also a time limit of 15min to solve these 15 questions) Second section was Technical which included 20 questions on Networking (High level questions on SSH, TelNet, TCP/IP etc)& OS concepts (like Memory management and Scheduling algorithms ) Difficulty : High (There was a time limit of 35min to solve these 20 questions) For third section, I was asked to choose between C++/JAVA and there were 7 output based questions Difficulty : Medium (There was a time limit of 15min for these 7 questions) These were mainly based on concepts of OOPS like polymorphism, Inheritance. Round 2 : Skype Interview(Technical) This was a bit easier. The interviewer has asked me to code some basic questions like : Algorithmic : 1) Mirror tree 2) Validity of BST 3) Height of a tree 4) Cycle in a linked list 5) Middle node in a linked list in one traversal (Use 2 pointers) 6) kth largest element in an array Networking and OS : Demand paging, Interpreter vs Compiler, Virtual memory s Real Memory, DHCP vs Static IP. Puzzle : 2 eggs, 100 floor puzzle Then we had a discussion on my previous interns and my projects. He seemed to be highly focused on my Data Mining and Machine Learning projects as he asked me to dive deep into them. A big thank you to GeeksforGeeks for providing such invaluable material for preparation.  \nRelated Practice Problems\nMirror Tree\nHeight of Binary Tree\nCheck for BST\nDetect Loop in linked list\nFinding middle element in a linked list\nK’th smallest element\nAll Practice Problems for VMWare !\n\nComment\nMore info\nCampus Training Program\nNext Article\nVMware Interview Experience | Set 4 (On-Campus)"
      },
      {
        "title": "Veritas Interview Experience Set 2 Campus",
        "url": "https://www.geeksforgeeks.org/veritas-interview-experience-set-2-campus/",
        "content_summary": "Veritas\nvisited our college for campus hiring. The CTC offered was 9.26 LPA. There were a total of 105 candidates eligible for the recruitment test. The selection process included an aptitude test, 2 tech interviews, and HR interview.\nROUND 1:(Aptitude+Technical test)\nThe aptitude test was on HackerRank. It had 20 MCQs based on CS concepts, C/C++ output questions, oops concepts(constructor, inheritance, overloading, overriding), etc. There were also 2 coding questions:- Q.1 Write a function to detect a loop in the linked list. return \"YES\" or \"NO\".\nDetect loop in the linked list\nQ.2 Write a function to delete all those nodes in the linked list which contain data greater than a value k. return head node. My approach was to 1) Traverse the LinkedList using two pointers prev & curr. 2) When curr value is greater than k, make prev->next point to curr->next. 3) Delete curr node. 4) Make new curr point to prev->next. 5) Repeat till curr is not NULL. There were some more edge cases to be covered. Round 1 was easy. Around 30 students out of 105, were shortlisted for the Tech interview. All those who passed all the test cases of both the coding questions easily were selected, few with partial submission were also selected.\nROUND 2: Technical Interview\nQ.1 Tell me about yourself. (Just a formality, interviewer is thinking about questions to ask) Q.2 Rate yourself out of 10 in following subjects: C,\nC++\n, OOPS,\nOS\n, System programming / Compiler Design, Quality Testing. Q.3\nStorage Classes\nQ.4\nStack and Heap memory representation\nQ.5 Bombarding of OOPS Concepts Inheritance in depth, access specifiers, difference between privately, publicly, protected inherited Output questions Q.6 Pointers in depth. much attention paid to syntax. dereferencing double pointers Q.7\nThis question on ternary search\nQ.8\nMiddle element in linked list\nQ.9 Explain all sorting techniques you know. Q.10 Write code for\nInsertion sort\nQ.11\nMerge sort linked list\n ROUND 3: Technical Interview-II\nQ.1 Tell me about yourself. Q.2 Projects Discussion. Q.3 Booting process in OS. Q.4 Linux commands. Q.5\nProcess vs Threads\nQ.6\nMutex vs Semaphore\nQ.7\nPaging in OS\nin depth Q.8 Practical use of paging and segmentation. Q.9\nReverse words in a sentence\nwithout using any extra space.\n ROUND 4: HR Interview\nQ.1 Tell about yourself. Q.2 Extracurriculars. Q.3 Why Veritas? Q.4 Areas who need to improve? Q.5 Where do you see yourself after 5 years? Q.6 Strengths and weaknesses. Some more typical HR questions. Then they say \"YOU ARE SELECTED\" All of the students who made it till the HR Round were selected. Overall, 7 were selected from 30.\n\nComment\nMore info\nCampus Training Program\nNext Article\nVeritas Interview Experience | Set 2 ( On Campus )"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/swap-kth-elements5500/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:25:46.518685",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Swap kth elements",
      "difficulty": "Basic",
      "accuracy": "52.76%",
      "submissions": "77K+",
      "avg_time": "15m"
    },
    "content": {
      "problem": "Given an array arr[], swap the kth element from the beginning with the kth element from the end.\nNote: 1-based indexing is followed.\nExamples :\nInput: arr[] = [1, 2, 3, 4, 5, 6, 7, 8], k = 3\nOutput: [1, 2, 6, 4, 5, 3, 7, 8]\nExplanation: 3rd element from beginning is 3 and 3rd element from end is 6, so we replace 3 & 6.\nInput: arr[] = [5, 3, 6, 1, 2], k = 2\nOutput: [5, 1, 6, 3, 2]\nExplanation: 2nd element from beginning is 3 and from end is 1.\nConstraints:\n1 ≤ arr.size(), k ≤ 106\n-109 ≤ arr[i] ≤ 109"
    },
    "complexity": {
      "time_complexity": "O(1)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley",
        "Rockstand"
      ],
      "topic_tags": [
        "Arrays",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/delete-alternate-nodes/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:25:57.066624",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Delete Alternate Nodes",
      "difficulty": "Easy",
      "accuracy": "56.09%",
      "submissions": "87K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Given a Singly Linked List, Delete all alternate nodes of the list ie delete all the nodes present in even positions.\nExamples :\nInput: LinkedList: 1->2->3->4->5->6\nOutput: 1->3->5\nExplanation: Deleting alternate nodes ie 2, 4, 6 results in the linked list with elements 1->3->5.\nInput: LinkedList: 99->59->42->20\nOutput: 99->42\nExpected Time Complexity: O(n)\nExpected Auxiliary Space: O(1)\nConstraints:\n1 <= number of nodes <= 105\n1 <= node->data <= 103"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley"
      ],
      "topic_tags": [
        "Linked List",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/remove-duplicate-elements-from-sorted-array/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:26:07.699535",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Remove Duplicates Sorted Array",
      "difficulty": "Easy",
      "accuracy": "38.18%",
      "submissions": "293K+",
      "avg_time": "20m"
    },
    "content": {
      "problem": "Given a sorted array arr. Return the size of the modified array which contains only distinct elements.\nNote:\n1. Don't use set or HashMap to solve the problem.\n2. You must return the modified array size only where distinct elements are present and modify the original array such that all the distinct elements come at the beginning of the original array.\nExamples :\nInput: arr = [2, 2, 2, 2, 2]\nOutput: [2]\nExplanation: After removing all the duplicates only one instance of 2 will remain i.e. [2] so modified array will contains 2 at first position and you should return 1 after modifying the array, the driver code will print the modified array elements.\nInput: arr = [1, 2, 4]\nOutput: [1, 2, 4]\nExplation: As the array does not contain any duplicates so you should return 3.\nConstraints:\n1 ≤ arr.size() ≤ 105\n1 ≤ ai ≤ 106"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Zoho",
        "Morgan Stanley",
        "Microsoft",
        "Samsung",
        "Google",
        "Wipro",
        "Xome"
      ],
      "topic_tags": [
        "two-pointer-algorithm",
        "Arrays",
        "Data Structures",
        "Algorithms"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/stock-buy-and-sell2615/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:26:18.690291",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Stock Buy and Sell – Multiple Transaction Allowed",
      "difficulty": "Medium",
      "accuracy": "13.43%",
      "submissions": "174K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "The cost of stock on each day is given in an array price[]. Each day you may decide to either buy or sell the stock i at price[i], you can even buy and sell the stock on the same day. Find the maximum profit that you can get.\nNote: A stock can only be sold if it has been bought previously and multiple stocks cannot be held on any given day.\nExamples:\nInput: prices[] = [100, 180, 260, 310, 40, 535, 695]\nOutput: 865\nExplanation: Buy the stock on day 0 and sell it on day 3 => 310 – 100 = 210. Buy the stock on day 4 and sell it on day 6 => 695 – 40 = 655. Maximum Profit = 210 + 655 = 865.\nInput: prices[] = [4, 2, 2, 2, 4]\nOutput: 2\nExplanation: Buy the stock on day 3 and sell it on day 4 => 4 – 2 = 2. Maximum Profit = 2.\nConstraints:\n1 <= prices.size() <= 105\n0 <= prices[i] <= 104"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Paytm",
        "Flipkart",
        "Morgan Stanley",
        "Accolite",
        "Amazon",
        "Microsoft",
        "Samsung",
        "D-E-Shaw",
        "Hike",
        "MakeMyTrip",
        "Ola Cabs",
        "Oracle",
        "Walmart",
        "Goldman Sachs",
        "Directi",
        "Intuit",
        "SAP Labs",
        "Quikr",
        "Facebook",
        "Salesforce",
        "Pubmatic",
        "Sapient",
        "Swiggy"
      ],
      "topic_tags": [
        "Arrays",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Ola Interview Experience Set 7 For Sde 1",
        "url": "https://www.geeksforgeeks.org/ola-interview-experience-set-7-for-sde-1/",
        "content_summary": "I was recently interviewed by OLA, I could not make it after the last round. All rounds I had were telephonic, in the last round I was asked to code on collabedit. Round 1 (around 35 min): 1. Given a matrix containing 0's and 1's. Find all the rows which are having 1's at same position. Give all sets satisfying this. 2. In a stock market given are price of shares spread over a week. On what day should I buy and what day should i sell to get maximum profit. 3. Being a computer engineer why did I not opt for system side programming than web domain. (I had expr in web domain) 4. I had expr in web domain so he asked: What is the difference between web browser request and ajax call request. -- It is simple, by ajax call partial web page can be loaded. 5. Have you worked on ruby on rails? Round 2 : 1. Given a matrix containing numbers. Find the 0's and make all the rows and columns corresponding to that index as 0. 2. Design a structure for a File Uploader service (eg. Dropbox, google drive). It is a service where multiple people can upload data at the same time and it also lists the top five uploaders (who uploaded the maximum number of files). 3. Puzzle: There is an employer and a worker, the employer has a gold bar of 7 units and he has to give 1unit each on a day for 7 days. The employer has a magical knife which doesn't work once it performs two cuts(1 cut divides the bar into two parts) on the bar. How will you cut so that 1 unit on each day can be given to the worker. 4. Print left view of binary tree. Round 3 : 1. He discussed what things they work on Ola. How these things are implemented. Like he mentioned of bar code a product has and catalog kind of thing. 2. I had to explain what project I am working on currently, what is the team size. 3. a)Since I had worked on SQL and databases, so he asked me what data structure will I use to implement a database. --I gave hashmap as a soln (the key is our primary key and other fields we can store in an object which will be value for hashmap) b)Now, If in case you want to find all names starting with a particular word (eg. ram....).How will you do that? -- gave trie structure as soln. c)Now you need to find students whose marks are between a range i.e. between two numbers. How will you do, what data structure will you take in this case? -- a simple solution was that, take binary search tree and do inorder traversal of that (I couldn't answer this, not clicked me) 4. Do you want to ask anything? Round 4 : 1. The server receives a ping every 30 secs. The ping is load avg on the machine at that time. Find 90% percentile of the load average on the machine at any time instant. 2. Find missing number in an AP.\nRelated Practice Problems\nStock buy and sell\nMaximum Difference\nAll Practice Problems for Ola-Cabs !\n\nComment\nMore info\nCampus Training Program\nNext Article\nOLA Interview Experience | Set 7 (For SDE-1)"
      },
      {
        "title": "Accolite Interview Experience Set 4 On Campus",
        "url": "https://www.geeksforgeeks.org/accolite-interview-experience-set-4-on-campus/",
        "content_summary": "Round 1 (Written) \nAround 140 students appeared for the offline test. \n\n\nThere were 20 MCQs that to be done in (30 minutes), questions were from OS,DBMS,Datastructures. \nAfter that coding round was there (paper coding) in which 3 questions were given and we have to attempt any 2 (1 hour) \n\n1. Write your own sqrt() function. the function should return square root if it is a perfect square else return floor(sqrt(x)) \n2. Given an array containing positive and negative integers. you have to find the smallest missing positive number. your code should run in O(n) time and O(1) space. \n3. Given an array of strings, find whether the strings can be chained or not to form a circle. A string x can be put before another string y if last character of x is same as first character of y. \n\nAfter round-1 , 19 people were shortlisted for the interviews. \n\n\n\n\nRound 2 (Technical) (1:30 hr) \n1. Tell me about yourself. Meanwhile he(interviewer) looked into my CV and asked about my projects. \nI have done 3 projects so he started discussion CUDA and parallel programming and how you implemented over images to detect edges and how much gain factor achieved. \nsecondly,I have made an project on online voting system so he asked me to draw E-R diagram, schemas and the relationship between them and their functionalities.About (25-30) minutes discussion. \n\n2. Given a BST, you have to find the kth smallest element in it in O(n) time and O(1) space. \n\n3. Suppose you have server where multiple requests are coming at time to,t1,t2...Now suppose a user hits at any particular time t on the server then server should return the last request. you have to design the datastructure for the same. \nI suggested that we can use stack that will return the last request, he then asked me to do for last 10 requests then I suggested to use array of structures which will store request no. and timestamp along with them.Now at any time t we can move 10 elements back but he said that suppose user hits frequently then every time i will have to traverse back again and again so time complexity will be much high, I agreed and suggested another solution similar to LRU implementation so that the requests which are coming frequently can be processed faster. then he modified question that user wants requests of last 1 minute and he gave a hint that is it necessary to store all requests can we not just store requests of every 1 min only,then suddenly it clicked to me, I suggested to use deque for 60 secs now suppose request arrives at 61st sec then we can just add that at rear and remove one from front maintaining a window of 60 seconds.He was satisfied but he want that no deletion should be there so I told him to use circular deque so that we can replace previous elements.He was completely satisfied now with the approach.(About 35 min. discussion) \n\n4. Given an array containing prices of a share of 30 days.A person has 1 share which he can buy and sell any number of times, you have to find the maximum profit which can be earned. \nI suggested one approach to create two auxiliary array MIN from left and MAX from right and traverse both simultaneously if difference between MAX[i] and MIN[i] is greater than maxDiff then update maxDIff and store current index and add to sum if index+1 is not equal to current iteration index and finally return sum.He tried some test cases over my code and found that for some cases it was giving wrong answer,then he asked me that how is my command over dynamic programming,I told I know only the standard ones and no other experience,then he said this question is of DP but he was happy to see my approach.(About 20-25 min.) \n\n\n\n\nRound 3 (Technical) (1:30 hr) \n1. She(interviewer) asked me if I attempted 3rd question in written test, I said I attempted only 1st and 2nd, then she gave me paper and told to implement the 3rd question. \nI suggested an approach to use two arrays of structures(for first characters and last characters) which will contain boolean value to mark presence of character in string and also its index. Now compare two arrays and see that if both arrays have same boolean value and different indices for all first and last characters. If so then strings can form a chain else not.She was in doubt for my solution so she found a testcase where my code was giving wrong answer,so she told me to look for another solution,I came up with another approach and told her that we can make a directed graph from first and last characters and then traverse it in DFS, now suppose if the visited node is visited again and count of total visited nodes is same as total nodes then we can say that strings will form a chain, now she was satisfied with approach and asked me to write code, now as my graph was weak i was in shock,so she said to just write the pseudocode. \n\n2. Given a BST, you have to find the kth largest element in it in O(n) time and O(1) space. \nI suggested to declare a static variable count which will increment count if node visited in inorder and if count becomes k, I will print that node's data and return. Then she asked me how static works and difference between global and static. \n\n3. Given a mobile keypad of say nokia phone and a dictionary which has all the meaningful words which can be formed, suppose now user types some number(input) then your program must suggest all the meaningful words which are present in dictionary.Before implementing this she asked me the datastructure to store the dictionary efficiently and then how will you use this datastructure to make code. \nAt first, I suggested I will store dictionary in 2-D array and lexicograpphically sort it, now suppose user types a number the string starting with that character is searched in the array. she said to reduce complexity because dictionary may contain 1000s of words,then I suggested to use trie datastructure to store and search the string, she was satisfied now and asked me to explain the concept. \n4.Given preorder and postorder of a graph, how can you construct the graph. \nAs I heard this question, i was stuck for 2 minutes but then I said as far as graph is concerned I dont know about it but a unique tree cannot be constructed with preorder and postorder so as graph,so inorder is needed, she was happy and agreed on answer. \n\n\n\n\nRound 4 (Technical) (2:30 hr) \n1. Suppose a linked list is given and there is a loop, you have to find orphan nodes in O(n) time. orphan nodes are the nodes outside the loop. \n\n2. Design a BRTS traffic signalling system such that no two vehicle clashes. Note that BRTS bus will follow the BRTS traffic lights B1,B2,B3,B4 in 4 directions and regular traffic will follow regular traffic lights R1,R2,R3,R4 only. In input only maximum cycle time was given(time after which the process repeates) check for all corner cases (traffic lights have two states only (RED and GREEN)).you have to tell any one possible combination of traffic lights under maximum cycle time. (About 1hr discussion). \n\n3. Suppose a linked list is given but we dont know the count of nodes, you have to find the kth node from last without counting the nodes. \n4. Given an array of n integers such some elements are in the range 0 to n-1 and some out of range may be negative.You have to rearrange array such that all elements which are in range appear on their index and rest appear in sorted manner for indexes not present.This should be done in O(n) time and O(1) space. \nEg- suppose n=6 ,4 5 2 3 6 -3 output= -3,6,2,3,4,5 \n\n5. How can you implement stack using queue/queues. \n6. How can you sort the elements with the help of queue. \nI suggested one O(n) time solution along with O(n) extra space.He asked to do in O(1) space so I suggested deque, he seemed satisfied. \n\nonly 4 were selected till this round (I was one of them) \n\nRound 5 (Bar Raiser) (30 minutes) \n\n1. find the length of longest palindrome in a string starting from index 0. \n2. find if a string A is present in string B or not. \n3. find the length of longest prefix in a string \n\nAfter this 2 were selected finally and unfortunately I was not amongst them as they might have thought i was little stress out. At last I would suggest that your approach and concepts must be strong as they always give questions with some variations. \n\nRelated Practice ProblemsSmallest Positive missing numberCount SquaresCircle of stringsCheck for subsequenceStock buy and sellLongest Palindrome in a String\n\n \n\n\nAll Practice Problems for Accolite ! \n\n\n \n \nComment\nMore info\nCampus Training Program\nNext Article\nAccolite Interview Experience | Set 4 (On-Campus)"
      },
      {
        "title": "One97paytm Interview Experience",
        "url": "https://www.geeksforgeeks.org/one97paytm-interview-experience/",
        "content_summary": "Written 1: Technical and Aptitude. Written 2: Written Coding\nWritten 1 was Normal Written exam based on fundamentals of Aptitude and Computer Science.\nWritten 2: Few Questions I remembered : Q1:\n \n     char a;\n     int i = 300;\n     a = &i;\n     a++;\n     *a=2;\n     printf(\"%d\",i); \nQ2:\n Imagine you have a special keyboard with the following keys:\n        A\n        Ctrl+A\n        Ctrl+C\n        Ctrl+V \nwhere CTRL+A, CTRL+C, CTRL+V each acts as one function key for “Select All”, “Copy”, and “Paste” operations respectively. If you can only press the keyboard for N times (with the above four keys), please write a program to produce maximum numbers of A. If possible, please also print out the sequence of keys. That is to say, the input parameter is N (No. of keys that you can press), the output is M (No. of As that you can produce). Q3: Consider a Binary Tree not necessarily BST, Remove all nodes which don’t lie in any path with sum>= k. Q4: Given an array arrange it in the form a<b>c<d>e<f>g.......... Q5: Given an array of numbers arrange it in the form of a single number such that the concluded number is the maximum. e.g. given : 99, 8, 76, 45, 66, 9, 7, 33, 5, 42 O/P : 99987766654233 Sectional Cut-off for O/P and Coding Questions. Marking was done against the correct approach, not the exact answers.\nRound 1 (Technical): Q1: How will you store 800 Million records in database. Q2: Data storage of double and float differs in C/C++ and Java How is it ??? Q2: Transfer data between a program written in Java and C#. Q3: I need to establish a network in which I will be sure of security, How will you proceed Q4: A and B are two sets Write a non-nested query so that I can get the data in B but not in A. Q5: 000..............? 11111111111111111111................? Write a Program which finds the index of the start of series 11111111.....?.\nRound 2 (Technical): Q1: Give your introduction along with your technical skills. Q2: Explain your project \"Stock Prediction\" Q3: I want to retrieve records from a table from date 1 - 15. I don't want to use range Queries Suggest optimal solutions... I suggest Indexing on the date column. He insisted on alternate ways. \"he said what you think you can do......\" Q4: What is Unique and NULL Constraint? Difference between Primary Key and Unique. How many maximum records in Unique can be NULL? Q5: Write the Most optimized algorithm for finding a Word in the sentence. (I used the Trie approach, he scolded me for not asking the sentence is sorted or not. the used Binary search.) Q6: Difference between thread and process. What is PCB? What is synchronization ?? What is Semaphore? Explain and solve the Producer-Consumer Problem using Semaphore? What is Drawback here What is the monitor? Solve Producer-Consumer Problem using Monitor and explain the pros and cons. Final 8 candidates from Delhi region selected.\nRound 3(Final Round Managerial and Technical): Q1: What you want to do in your Life ?? Discussion life as a placement coordinator? What you did ? your duties? differences you made ... Q2: Doing Post Market Analysis of a Stock Market of Previous Month. Write a Program of Stock Buy Sell to Maximize Profit. Q3: Explain Cursor ? its types? differences between them? What to use when? Q4: Explain Matrix? Matrix Multiplication? Difference ways of Matrix Multiplication? Explain Both. Q5: What are you doing right now ??? will you join us ?? Why ??\nStudents from 30 Colleges of India are evaluated and Top 25 are offered the JOB. I was not one of them.\nAll Practice Problems for Paytm !\nRelated Practice Problems\nConvert array into Zig-Zag fashion\nStock buy and sell\nLargest Number formed from an Array\n\nComment\nMore info\nCampus Training Program\nNext Article\nOne97(Paytm) Interview Experience"
      },
      {
        "title": "Paytm Interview Experience Set 4 Walk In Drive",
        "url": "https://www.geeksforgeeks.org/paytm-interview-experience-set-4-walk-in-drive/",
        "content_summary": "I got a chance to participate in walk-in drive at Paytm Headquarters. Went through the following process.\nWritten test: It contained 20 objective questions having a mix of C, networking and Database questions and 2 subjective questions. Subjective questions: Stock buy sell maximum profit and Find sub string in a string\nTech round conducted by SE: Ques 1: Reverse a given linked list Ques 2: Reverse linked list in group of size 3 Ques 3: Minimum distance between two given characters of a string\nTech round conducted by tech lead: Ques 1: Tell me about yourself. Technology stack which you used while working. Ques 2: Matrix multiplication (buy c++ book from Sumita Arora class XII level for answer :P) Ques 3: Coin change problem (solved it using DP)\nInterviewer was impressed with solution of coin change and later he discussed what were the most difficult data structure problems which I had solved. I told some like phone number keypad problem, sudoku solver etc. I was only possible because of all the stuff I prepared regularly from geeksforgeeks which I could not have found anywhere else. Thanks to geeks for geeks.\nAll Practice Problems for Paytm !\nRelated Practice Problems\nCoin Change\nMultiply Matrices\nMinimum distance between two numbers\nReverse a Linked List in groups of given size.\nReverse a linked list\nStock buy and sell\n\nComment\nMore info\nCampus Training Program\nNext Article\nPaytm Interview Experience | Set 4 (Walk-in Drive)"
      },
      {
        "title": "Walmart Lab Interview Experience Set 8 Off Campus 3 Years Experience",
        "url": "https://www.geeksforgeeks.org/walmart-lab-interview-experience-set-8-off-campus-3-years-experience/",
        "content_summary": "Round 1 (Coding round): 1) Range [L, R] is given. Need to find what is the maximum repeating digit in prime numbers between L and R (both inclusive). If more number of digits is repeated max times, return whichever digit is maximum Eg: [2, 13] - maximum repeating digit is 1 among {2, 3, 5, 7, 11, 13} [2, 9] - answer 7 2) Given a number \"S\", find out how many number of ways a, b, c, d (all > 1) can exist such that a+b+c+d = S; Round 2: 1) OOPS Concepts 2) Reverse alternate nodes in linked list Eg: 1->2->3->4->5 ahould become 2->1->4->3->5 3) Iterative post order traversal of binary tree 4) Queue implementation using stacks Round 3 (Java): 1) Arraylist, Linkedlist - when to use what 2) Hashmap, Hashtable, concurrent hash map 3) Hashcode, Equals, Hashmap implementation 4) Serializable interface 5) AbstractClass Vs Interface 6) Multi threading, Difference between extends thread, implements runnable 7) Callable interface, Executor framework 8) Collections sorting, comparable interface 9) Best thing I have done so far what I proud of Round 4: 1) Given NxN matrix, (X,Y) position. Find how many ways You can reach from (X,Y) to (N,N). You are allowed to traverse in 2 directions - Right, Down 2) Find loop in linked list. Find starting node of loop 3) Binary tree zigzag traversal 4) Given list of stock prices. You are allowed to buy and sell only once. a) Find the maximum gain you can get b) Find the maximum loss you can get 5) Binary tree is height balanced or not. (Every node in tree should be height balanced) 6) Implement String trim algorithm 7) Write a multi-threaded program - launch 10 threads and exit from main thread after all those threads completed Round 5 (Manager): 1) Given a number in form of array, maximize the number w.r.t allowed number of swaps (can swap only adjacent elements) - maximize(int[] data, int numSwaps) Eg: 1265 is number - if 1 swap allowed - maximum number we can get out of it is 2165 1265 is number - if 3 swaps allowed - maximum number we can get out of it is 6215 2) Questions on my projects 3) So many behavioural questions Round 6 (HR): Why do you want to change? What You are expecting? and some other HR questions.\nAll Practice Problems for Walmart !\nRelated Practice Problems\nCount all possible paths from top left to bottom right\nCheck for Balanced Tree\nStock buy and sell\nLargest number in K swaps\nDetect Loop in linked list\nQueue using two Stacks\nFind the highest occurring digit in prime numbers in a range\nFind the highest occurring digit in prime numbers in a range\n\nComment\nMore info\nCampus Training Program\nNext Article\nWalmart Lab Interview Experience | Set 8 (Off-Campus 3 Years Experience)"
      },
      {
        "title": "Makemytrip Interview Experience Set 7 On Campus",
        "url": "https://www.geeksforgeeks.org/makemytrip-interview-experience-set-7-on-campus/",
        "content_summary": "Recently makemytrip visited our Campus and I got selected in recruitment drive.The placement drive consisted of 4 rounds. Round1: MCQ and coding round It was an online test of 60 minutes consisting of 20 aptitude question and 3 coding question. Platform used for the test was of makemytrip and slightly difficult to understand. Question1: Calculate the power of a ^ b mod c using logn approach.The thing that was to be taken care of was that you did not needed to return or print your answer but you had to store it in their predefined global variable. You could easily find the solution on geeksforgeeks site. Question2: Given a sentence you were supposed to calculate the count of Capital , small letter and number.Question seemed to be quite easy but the pick was that you needed to store the answer in char* output variable in the form of c1:c2:c3 where c1 represent count of capital letter c2 represent count of small letter and c3 represent count of number. (Hint use sprintf to store your answer in formatted way in the variable sprintf(output,\"%d:%d:%d\",c1,c2,c3); ) Question3: Activity Scheduling problem You are given 2 arrays representing the starting and finishing time of activities . Determine the maximum number of non conflicting activities that you can achieve. (Hint : make a structure of start and finish time and sort according to finishing interval) I solved 2 completely and 1 partially Tip:Since they have only one sample test case so even you are not able to solve the coding question just store the hard coded answer in that variable. I did that in last :P) Out of 110 students 30 students got selected for Personal Interview round. Round 2: Personal Interview Since I was last candidate in that list waiting from 10:30 am My turn came at 10:30 PM.The interviewer was very cool and friendly.He started with asking tell me about yourself and what projects I have done.After half hour rigerous discussion over my project and making schema of databases I used in project He started asking question on ds. Question1: Sort a linklist consisting of 0,1,2's. (Hint: I used hashmap of stl in c++ to store the count of 0,1 and 2) Question 2: Given a stock You need to find the maximum profit you can earn .You are allowed to buy and sell as many number of time you can.) Question 3:Design a treeset in java. (Hint:I told him to use BST but he told to think of more optimized way so Ii told AVL and wrote functions for insertion in AVL tree) Question4:Diffrentiate between method overloading and method overriding.What are static blocks in java. Question5: Drilling question on deployment descriptor,struts,mysql. Round3: Personal Interview The interviewer seemed to be exhausted . He asked me that Since you are the last person so all the question you would have asked. So tell me what all question you have asked. I told him distinct palindromic substring in string, LIS, LCS etc students told that you are asking.He thought for a while and told me to write standard bfs code for graph traversal. Question2: You have been given a matrix of character and a dictionary.You need to find the valid words that you can obtain from it and print it. (Hint:I used dfs to find the valid sequence and assumed that all words are stored in a hashmap) After these He asked 6 puzzles to be solved in a given time. Puzzle 1 : 1.5 hen give 1.5 egg in 1.5 day. How many hens are required to have 4 dozen of egg in 6 days. Puzzle 2: 2 ropes and take 1hr to burn. Calculate 45 min Puzzle 3:10 jar with 10gm marble in each jar.One jar contain 9gm marbles only.Find the defective jar in one turn. Puzzle4:150 person are standing in a queue in sorted order.A blind person comes and wants to be at right position in queue.So he asks any person whether he can stand in front of him.He will reply in Yes or No . You have to find the right place after 2Yes. Give a strategy to find the correct place. (Hint:This puzzle can be reduced to egg drop puzzle) Puzzle 5:25 horse having race find top 3 Puzzle 6:A person is riding a car and he sees a milestone A. After 1hr he sees milestone B which has digits reversed of A.After one hour more he finds a milestone C which contains all the digits of A and B . Given that A < B < C find the speed of car. (Other question that were asked from my friend 1.Distinct Palindrome in string 2.Transaction minimize problem 3.LCS and LIS (dp approach) 4.Diameter of tree 5.Pattern Matching Algorithm (KMP)) HR round: He asked me about my family background,what I do ,hobbies.What I know about makemytrip.What location I would prefer , whether I am satisfied with package or not,Working environment etc, It lasted for half hour. Tip:(Be expressive,Think out loud,Be confident. They need to know your approach not the solution)\nAll Practice Problems for MakeMyTrip !\nRelated Practice Problems\nN meetings in one room\nStock buy and sell\nWord Boggle\nDistinct palindromic substrings\nDiameter of Binary Tree\nLongest Prefix Suffix\nPower of Numbers\nGiven a linked list of 0s, 1s and 2s, sort it.\nLongest Common Subsequence\n\nComment\nMore info\nCampus Training Program\nNext Article\nMakeMyTrip Interview Experience | Set 7 (On-Campus)"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/find-minimum-number-of-laptops-required--170645/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:26:44.020827",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Find minimum number of Laptops required",
      "difficulty": "Medium",
      "accuracy": "51.13%",
      "submissions": "22K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "There are N jobs and the start and finish time of the jobs are given in arrays start[] and end[] respectively. Each job requires one laptop and laptops can't be shared. Find the minimum number of laptops required given that you can give your laptop to someone else when you are not doing your job.\nExample 1:\nInput:\nN = 3\nstart[] = {1, 2, 3}\nend[] = {4, 4, 6}\nOutput:\n3\nExplanation:\nWe can clearly see that everyone's supposed to\nbe doing their job at time 3. So, 3 laptops\nwill be required at minimum.\nExample 2:\nInput:\nN = 3\nstart[] = {1, 5, 2}\nend[] = {2, 6, 3}\nOutput :\n1\nExplanation:\nAll jobs can be done using 1 laptop only.\nYour Task:\nYou don't need to read input or print anything. Your task is to complete the function minLaptops() which takes an integer N and two arrays start and end denoting starting and ending time of N jobs and returns minimum laptops required.\nExpected Time Complexity: O(N*logN)\nExpected Auxiliary Space: O(N)\nConstraints:\n1 ≤ N ≤ 105\n1 ≤ start[i] < end[i] ≤ 109"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley"
      ],
      "topic_tags": [
        "Sorting",
        "Algorithms"
      ]
    },
    "interview_experiences": [
      {
        "title": "Morgan Stanley Interview Experience For Summer Internship 2021 Off Campus",
        "url": "https://www.geeksforgeeks.org/morgan-stanley-interview-experience-for-summer-internship-2021-off-campus/",
        "content_summary": "I applied through the career section of Morgan Stanley Official Website. There were three rounds:\nRound 1 (Online Aptitude and Coding test on AMCAT) (90 minutes): There were 3 sections:\nAptitude Section: 10 questions in 20 minutes. These questions were easy-to-medium level MCQs\nDebugging Section:  There were 7 questions based on C/C++ for debugging. (easy) (20 minutes)\nCoding Section: This section had 3 questions to be done in 60 minutes. I don't exactly remember the questions but\n1st was related to Arrays (medium)\n2nd was related to DP (medium)\n3rd was related to DSU (medium)\nI was able to solve 6-7 aptitude questions, all debugging questions, first 2 coding problems.\nI was confident about my test and got results via email after one week.\nRound 2 (Face 2 Face Technical Interview on Zoom) (50-60 minutes):\nFirst of all, I was asked to introduce myself, then I had to share the screen and open Notepad where I had to solve the problems.\nI was first asked What I know about OOPs (so I told the fundamental OOPs concepts)\nTypes of polymorphism, Run time Polymorphism, and Virtual functions\nThen I was asked to Design Netflix using Object Oriented Principles (The interviewer was helpful and gave me hints)\nThen I had to code the problem: Find Kth largest element in an unsorted array\nThen I had to code: Delete a node in LinkedList without head pointer\nThen I had to code the problem: Given the start and Finish time of multiple jobs, find the minimum number of Laptops required. Each Job requires one Laptop. Laptops cannot be shared.\nTip: Give answers confidently. If you don't know the answer -try to think of the solution (even if it is brute-force) otherwise just say confidently 'Sorry, I can't think of the solution right now'.\nI received a call about 1 week later that I had been selected for the Final Round.\nRound 3 (Face 2 Face HR + Technical Round on Zoom) (45 - 50 minutes): The Interviewer was very friendly (very very much). This round was supposed to be HR + Technical round (as I had read in many past experiences), but surprisingly for me It was only HR round.\nFirst I had to Introduce myself.\nI had a Team Project ( I recommend you should also have at least one team project ).\nHe asked questions like: How did it feel working in a team?, How team members used to contact each other for development and discussions? How did you manage your team?\nThen we did a discussion about my Individual project (This was my Main project) (for about 30 minutes): Why I chose that project, Why I used specific technology, What if I had to make it a big scale - how will I raise funds 'n all.\nThen he asked some situational questions like What will you do if you think your approach to doing a task is better than your manager's, but Manager is not agreeing?\nThen He asked me what all subjects I have this semester and what subjects I have studied so far.\nFinally, he asked me if I had any queries (I asked him which technology we will be working on and what is actually the role of an Intern).\nSuggestions:\nRead all the Interview Experiences 2-3 times, you will get an exact idea of what topics you need to focus on.\nRead OOPs and OS\nCoding Questions are only a part of the Interview, Focus on other topics, and your way of answering them also.\nObject-Oriented Design questions are easy, go through Movie-ticket Booking, Snake-n-Ladders, and Parking-lot Object-Oriented design questions to get an Idea.\nMy personal advice: Wear a shirt and sit in nice lighting to create an impact.\nFor Off-campus aspirants: Be patient, results usually come after 1 week.\nI got an E-mail after 1 week That I had been Selected.\n\nComment\nMore info\nAdvertise with us\nNext Article\nMorgan Stanley Interview Experience for Summer Internship 2021 (Off-Campus)"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/queue-using-two-stacks--115418/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:26:57.915394",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Queue using two Stacks",
      "difficulty": "Easy",
      "accuracy": "68.68%",
      "submissions": "670+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Implement a Queue using 2 stacks s1 and s2.\nA Query q is of 2 Types\n(i) 1 x (a query of this type means  pushing 'x' into the queue)\n(ii) 2   (a query of this type means to pop an element from the queue and print the popped element)\nNote: If there is no element return -1 as the answer while popping.\nExamples:\nInput: queries = [[1, 2],[1, 3],[2],[1, 4],[2]]\nOutput: 2 3\nExplanation:\n1 2 the queue will be {2}\n1 3 the queue will be {2 3}\n2   poped element will be 2 the queue will be {3}\n1 4 the queue will be {3 4}\n2   poped element will be 3.\nInput: queries = [[1, 2],[2],[2],[1, 4]]\nOutput: 2 -1\nExplanation:\n1 2 the queue will be {2}\n2   poped element will be 2 and\nthen the queue will be empty\n2   the queue is empty and hence -1\n1 4 the queue will be {4}.\nConstraints:\n1 <=queries.size() <= 100\n1 <= x <= 100"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(n)"
    },
    "tags": {
      "company_tags": [
        "Flipkart",
        "Morgan Stanley",
        "Accolite",
        "Amazon",
        "Microsoft",
        "D-E-Shaw",
        "Hike",
        "MakeMyTrip",
        "Oracle",
        "Walmart",
        "Goldman Sachs",
        "MAQ Software",
        "Adobe",
        "InfoEdge",
        "InMobi"
      ],
      "topic_tags": [
        "Stack",
        "Queue",
        "STL",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Maq Software Interview Experience Set 10 On Campus",
        "url": "https://www.geeksforgeeks.org/maq-software-interview-experience-set-10-on-campus/",
        "content_summary": "1. Written Round : 1) 30 Aptitude questions(30 min). 2) 2-Coding questions(30 min). 2-a) Write an algorithm for dutch national flag problem 2-b) Write an algorithm for n-queens problem Total 40 people were selected for second round. 2.Technical Round 1 (around 1Hr 15min):- 1) What is web technology. 2) Write some Basic syntax of HTML. 3) Given 2 tables of employee containing employee_id,employee_name and department containing employee_id(foreign key), dept_id find the name of the employee who worked in maximum no. of departments. 4) Discussion about projects which I had written in resume. 5) What is inheritance, overloading and over-riding. 6) Difference between Encapsulation and abstraction. 7) What is indexing in databases. 8) What are clustered and non-clustered indexes. 9) Real life application of Data Structures. 10) Which Data structure used in printer. 11) Which Data structure used for maintaining Dictionary.(Trie) 12) What is the searching and space complexity of your Trie for maintaining Dictionary. 13) 2 simple puzzle. 14) Add 2 numbers a and b without using ?+? operator. 15) find nth Fibonacci number. (Gave O(logn) solution) 3.Technical Round 2 (around 1 Hr):- 1) How many square in (8*8) chess board. 2) Give general formula for square in (n*n) board and prove it. 3) Write code for Sudoku Game Problem and discuss time complexity of the code which was written by me. Discuss many thing about that code he said to optimise the code then i optimise some portion of code then we move on to the next question. 4) puzzle:- 2 jar one contain 4 red and other one 4 blue randomly select any jar maximize the probability of selecting red ball by rearranging the balls. Puzzel#6 http://www.crazyforcode.com/probability-puzzles-interview/ 5) Write code for calculating factorial of big number (Array). 6) Puzzel:-Given a pastry. someone eat it from one side how you divide it into 2 equal parts. 7) Egg droping Puzzel. I give solution of 2 egg 100 floor puzzle but then said to give the generalized formula for it then i solve it using DP. 4. HR+Technical Round(around 1 Hr) :- Q1-Tell me about yourself? Q2-Family background? Q3-Discussion about projects which I had written in resume. Q4-Write code for making Queue using 2 stack. Discuss about time complexity and space complexity and he said optimise the code. Q5-Write code for Water Jug problem (check condition are we able to make any given number in any of the jug or not). Q6-Puzzel:-Given a rectangle and a circle and a point lie on circle and center lie line y=x and 1 point of rectangle lie on origin. circle put into rectangle find the radius of circle. A total of 3 students were offered the job(I was one of them). 2 students were offered the intern. Thank you so much geeksforgeeks team.\nRelated Practice Problems\nThe Nth Fibonnaci\nQueue using two Stacks\nTwo water Jug problem\nAll Practice Problems for MAQ Software !\n\nComment\nMore info\nCampus Training Program\nNext Article\nMAQ Software Interview Experience | Set 10 (On-Campus)"
      },
      {
        "title": "Walmart Lab Interview Experience Set 8 Off Campus 3 Years Experience",
        "url": "https://www.geeksforgeeks.org/walmart-lab-interview-experience-set-8-off-campus-3-years-experience/",
        "content_summary": "Round 1 (Coding round): 1) Range [L, R] is given. Need to find what is the maximum repeating digit in prime numbers between L and R (both inclusive). If more number of digits is repeated max times, return whichever digit is maximum Eg: [2, 13] - maximum repeating digit is 1 among {2, 3, 5, 7, 11, 13} [2, 9] - answer 7 2) Given a number \"S\", find out how many number of ways a, b, c, d (all > 1) can exist such that a+b+c+d = S; Round 2: 1) OOPS Concepts 2) Reverse alternate nodes in linked list Eg: 1->2->3->4->5 ahould become 2->1->4->3->5 3) Iterative post order traversal of binary tree 4) Queue implementation using stacks Round 3 (Java): 1) Arraylist, Linkedlist - when to use what 2) Hashmap, Hashtable, concurrent hash map 3) Hashcode, Equals, Hashmap implementation 4) Serializable interface 5) AbstractClass Vs Interface 6) Multi threading, Difference between extends thread, implements runnable 7) Callable interface, Executor framework 8) Collections sorting, comparable interface 9) Best thing I have done so far what I proud of Round 4: 1) Given NxN matrix, (X,Y) position. Find how many ways You can reach from (X,Y) to (N,N). You are allowed to traverse in 2 directions - Right, Down 2) Find loop in linked list. Find starting node of loop 3) Binary tree zigzag traversal 4) Given list of stock prices. You are allowed to buy and sell only once. a) Find the maximum gain you can get b) Find the maximum loss you can get 5) Binary tree is height balanced or not. (Every node in tree should be height balanced) 6) Implement String trim algorithm 7) Write a multi-threaded program - launch 10 threads and exit from main thread after all those threads completed Round 5 (Manager): 1) Given a number in form of array, maximize the number w.r.t allowed number of swaps (can swap only adjacent elements) - maximize(int[] data, int numSwaps) Eg: 1265 is number - if 1 swap allowed - maximum number we can get out of it is 2165 1265 is number - if 3 swaps allowed - maximum number we can get out of it is 6215 2) Questions on my projects 3) So many behavioural questions Round 6 (HR): Why do you want to change? What You are expecting? and some other HR questions.\nAll Practice Problems for Walmart !\nRelated Practice Problems\nCount all possible paths from top left to bottom right\nCheck for Balanced Tree\nStock buy and sell\nLargest number in K swaps\nDetect Loop in linked list\nQueue using two Stacks\nFind the highest occurring digit in prime numbers in a range\nFind the highest occurring digit in prime numbers in a range\n\nComment\nMore info\nCampus Training Program\nNext Article\nWalmart Lab Interview Experience | Set 8 (Off-Campus 3 Years Experience)"
      },
      {
        "title": "Makemytrip Interview Experience Set 9 Off Campus For Sr Android Developer",
        "url": "https://www.geeksforgeeks.org/makemytrip-interview-experience-set-9-off-campus-for-sr-android-developer/",
        "content_summary": "First round (Written) : 1. 4 Android questions: a) What's Recyclerview? Describe all components of Recyclerview with all callbacks and the benefits of Recyclerview. b) Difference between thread, async task and service (in tabular format). c) Callbacks invoked during addition of a fragment to back stack and while popping back from back stack. d) Scenario in which only onDestroy is called for an activity without onPause() and onStop() 2. Describe a scenario in which deadlock occurs and a solution to overcome it. 3. Given an array, find the maximum difference between two array elements A[m] and A[n], such that n>m. 4. The relation between group of friends is transitive. So if student A is friends with student B, and B is friends with C, A becomes friends with C. They form a circle of friends. Given a matrix N*N and N students, each matrix entry indicating 'Y' or 'N' if they're friends or if they're not friends. We need to determine the number of circles. Eg - 6 students, A,B,C,D,E,F. A is friends with B, B with C. D is friends with E. F is friends with none. Output : 3 circles. F2F Round 1: Starting with Java basics : 1. Uses of final, string pool concept, serialization, synchronization (how it can be done) 2. How can you implement thread pool executor. 3. Is it possible to declare final variable in abstract class. 4. What is externalization. Android : Lots of basic questions: You need to provide more area for checking/unchecking checkbox than the default area of checkbox. How would you do it. How would you implement zoom in zoom out functionality in Android. How do you implement GCM push notifications. What things would you do in each lifecycle method of activity? What is IllegalStateException in Android? Any scenario when you encounter it and how to solve it? Advantages and disadvantages of using fragment. How would you implement swipe animation in Android. How do you detect whether keyboard is open in an Android app. And some more. But I don't exactly remember. DS: Implement queue using 2 stacks. After this, the interviewer seemed satisfied with my responses. F2F Round 2 : Android design questions: 1. You have a textview(3 lines) and a button below it. On clicking the button textview whole content should show. (Content is very large but due to 3 lines initially its not shown completely). You need to add animation while showing the full text of textview. How would you design this. 2. Some question related to showing images (for adult and child, like in flight booking system, we have 2 buttons for adding and removing adults/child). When there is 1 adult and 1 child, it should show as AC where A and C are icons for adult and child. On adding 1 more adult, it should show as AAC instead of ACA. How would you design such a system. Got stuck in this round, and was rejected.\nAll Practice Problems for MakeMyTrip !\nRelated Practice Problems\nMaximum Difference\n\nComment\nMore info\nCampus Training Program\nNext Article\nMakeMyTrip Interview Experience | Set 9 (Off-Campus for Sr. Android developer))"
      },
      {
        "title": "Adobe Interview Experience Set 48 Campus",
        "url": "https://www.geeksforgeeks.org/adobe-interview-experience-set-48-campus/",
        "content_summary": "Coding Round:\nA variation of Knapsack\nEasy string manipulation problem\nA brute-force based string matching problem\nTechnical Round 1:\nFinding the length of a Linked-List with a cycle.\nDifference between a stack and a heap with respect to Virtual Memory\nGiven a cube in 3D space with integer dimensions, print all the lattice points on the surface of the cube.\nTechnical Round 2:\nPrint Pyramid of 1's with given height.\nAllocate 2D arrays in C with both dimensions accepted as input.\nCan C programs without main() function exist? (Object Files, Shared and Static Libraries, and how to create them using GCC)\nWhat is a graph traversal?\nPrint all nodes with shortest distance k from a given root node in a graph.\nHow does Breadth-first Search work?\nTechnical Round 3:\nCreate a queue from a 2 stacks\nPrint Fibonacci sequence in order using only recursion and no extra space.\nCreate a function to match a simple regex.\nHR Round:\nWhy want to join Adobe?\nWhat is the team preference?\nWhat are your shortcomings?\nGiven a table of data, where each row determines a metric, convert it to a single column of data where the new data item indicates the metric with reasonable accuracy (Principal Component Analysis)\nHaving a research background, why want to join a software company?\nDetails about college events\nIf you don't like the team you are assigned to, how will you tackle this?\n\nComment\nMore info\nCampus Training Program\nNext Article\nAdobe Interview Experience | Set 48 (On-Campus)"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/largest-element-in-array4009--142158/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:27:18.908322",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Maximum Element in Array",
      "difficulty": "Basic",
      "accuracy": "84.77%",
      "submissions": "3K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Given an array arr[]. The task is to find the largest element and return it.\nExamples:\nInput: arr = [1, 8, 7, 56, 90]\nOutput: 90\nExplanation: The largest element of the given array is 90.\nInput: arr = [5, 5, 5, 5]\nOutput: 5\nExplanation: The largest element of the given array is 5.\nInput: arr = [10]\nOutput: 10\nExplanation: There is only one element which is the largest.\nConstraints:\n1 <= arr.size()<= 106\n0 <= arr[i] <= 106"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Infosys",
        "Oracle",
        "Wipro",
        "Morgan Stanley"
      ],
      "topic_tags": [
        "Arrays",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/level-order-traversal-line-by-line/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:27:30.177290",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Level Order Line by Line",
      "difficulty": "Easy",
      "accuracy": "53.78%",
      "submissions": "83K+",
      "avg_time": "20m"
    },
    "content": {
      "problem": "Given a Binary Tree, your task is to find its level order traversal.\nNote: The driver code prints the levels '$' separated.\nExamples:\nInput: root = [1, 4, N, 4, 2]\n1\n/\n4\n/   \\\n4    2\nOutput:1 $ 4 $ 4 2 $\nExplanation: At first level 1 present then at second level 4 present then at third level 4 2 present.\nInput: root = [10, 20, 30, 40, 60]\n10\n/    \\\n20      30\n/     \\\n40     60\nOutput: 10 $ 20 30 $ 40 60 $\nExplanation: At first level 10 present then at second level 20 30 present then at third level 40 60 present.\nInput: root = [10. 20, 30, 40, 70]\n10\n/    \\\n20      30\n/     \\\n40     70\nOutput: 10 $ 20 30 $ 40 70 $\nExplanation: At first level 10 present then at second level 20 30 present then at third level 40 70 present.\nConstraints:\n1 <= number of nodes <= 1000\n0 <= node->data <= 100"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(n)"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "Snapdeal",
        "Hike"
      ],
      "topic_tags": [
        "Tree",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Hike Interview Experience Set 5",
        "url": "https://www.geeksforgeeks.org/hike-interview-experience-set-5/",
        "content_summary": "Round I 1.Implement expiry cache system : every page in cache have id and expiry time (TTL of few seconds). After page expires it behaves as free space and can be used for new pages/replacement. Had a long discussion on everything. Round II very boring round 1. Nodes at given distance in binary tree 2.Check Mirror in N-ary tree 3. Largest Sum Contiguous Subarray Round III very boring round 1.Level order traversal Line by Line 2. ZigZag traversal of tree 3. Search in a Rotated Array 4.Value equal to index value finally something new.. 5. given a sorted array say A : (-4,-2,0,1,4,6,8,10). There is a function f(x) = a*x^2 + b*x + c , apply this function on A where x is any ith element from array A and a,b,c belongs to set of real numbers. Will f(A) will be sorted, if not then sort it in O(n). It is very easy if you still remember concepts of quadratic equation from maths. I did not remember so he helped me. Logic is that any quadratic equation is represented by parabola on graph and graph has minimum value at dy/dx = 0,i.e, 2*a*x + b = 0. Both sides of this point graph keeps increasing/decreasing to the infinity depending upon value of a. Calculate value of x = -b/(2*a). find it in sorted array or find its ceiling in log n. starting from this point to both ends, perform merge sort. Round IV 1. implement LRU cache 2. Implement following. There are three type of request : i) www.someurl.com/conn_id=?&timeout=? -: for this conn_id you will wait for timeout sec and after that return reponse, in meantime you can get some more requests of any one of three types ii) www.someurl.com/stat/ -: return all id waiting to timeout along with their remaining timeout interval ii) www.someurl.com/kill/conn_id=? -: end wait timeout of this conn_id and return response for this conn_id I gave a solution with heap. He asked how to handle case when a request is waiting for timout and new request came in meantime. How to do server side scalability in this case. 3. He asked about current work and technologies I am working upon. I said Java, Spring MVC for backend and html,css, javascript for front end and suddenly he asked what is difference between Java and javascript. Could not figure out at that time. Javascript is also an object oriented language an can be used at server side like node js. Still there are lot of differences.\n  Related Practice Problems\nTwo Mirror Trees\nLevel order traversal Line by Line\nNodes at given distance in binary tree\nLRU Cache\nSearch in a Rotated Array\nLevel order traversal in spiral form\nKadane's Algorithm\nAll Practice Problems for Hike !\n\nComment\nMore info\nCampus Training Program\nNext Article\nHike Interview Experience | Set 5"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/reverse-an-array/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:27:43.699477",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Reverse an Array",
      "difficulty": "Easy",
      "accuracy": "55.32%",
      "submissions": "189K+",
      "avg_time": "5m"
    },
    "content": {
      "problem": "You are given an array of integers arr[]. Your task is to reverse the given array.\nNote: Modify the array in place.\nExamples:\nInput: arr = [1, 4, 3, 2, 6, 5]\nOutput: [5, 6, 2, 3, 4, 1]\nExplanation: The elements of the array are 1 4 3 2 6 5. After reversing the array, the first element goes to the last position, the second element goes to the second last position and so on. Hence, the answer is 5 6 2 3 4 1.\nInput: arr = [4, 5, 2]\nOutput: [2, 5, 4]\nExplanation: The elements of the array are 4 5 2. The reversed array will be 2 5 4.\nInput: arr = [1]\nOutput: [1]\nExplanation: The array has only single element, hence the reversed array is same as the original.\nConstraints:\n1<=arr.size()<=105\n0<=arr[i]<=105"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Bloomberg",
        "Facebook",
        "TCS",
        "Adobe",
        "Google",
        "Infosys",
        "Capgemini",
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "Apple",
        "Yahoo",
        "PayPal",
        "Uber"
      ],
      "topic_tags": [
        "Arrays",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/buy-stock-2/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:27:54.642466",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Stock Buy and Sell – Max one Transaction Allowed",
      "difficulty": "Easy",
      "accuracy": "49.33%",
      "submissions": "92K+",
      "avg_time": "10m"
    },
    "content": {
      "problem": "Given an array prices[] of length n, representing the prices of the stocks on different days. The task is to find the maximum profit possible by buying and selling the stocks on different days when at most one transaction is allowed. Here one transaction means 1 buy + 1 Sell. If it is not possible to make a profit then return 0.\nNote: Stock must be bought before being sold.\nExamples:\nInput: prices[] = [7, 10, 1, 3, 6, 9, 2]\nOutput: 8\nExplanation: You can buy the stock on day 2 at price = 1 and sell it on day 5 at price = 9. Hence, the profit is 8.\nInput: prices[] = [7, 6, 4, 3, 1]\nOutput: 0\nExplanation: Here the prices are in decreasing order, hence if we buy any day then we cannot sell it at a greater price. Hence, the answer is 0.\nInput: prices[] = [1, 3, 6, 9, 11]\nOutput: 10\nExplanation: Since the array is sorted in increasing order, we can make maximum profit by buying at price[0] and selling at price[n-1].\nConstraint:\n1 <= prices.size()<= 105\n0 <= prices[i] <=104"
    },
    "complexity": {
      "time_complexity": "O(n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Bloomberg",
        "Facebook",
        "Intel",
        "Infosys",
        "Zoho",
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "Samsung",
        "Yahoo",
        "PayPal",
        "Nvidia",
        "Oracle",
        "Visa",
        "Walmart",
        "Goldman Sachs",
        "TCS",
        "Adobe",
        "Google",
        "IBM",
        "Accenture",
        "Apple",
        "Uber"
      ],
      "topic_tags": [
        "Greedy",
        "Arrays"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/add-two-numbers-represented-by-linked-lists/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:28:05.678587",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Add Number Linked Lists",
      "difficulty": "Medium",
      "accuracy": "34.52%",
      "submissions": "338K+",
      "avg_time": "30m"
    },
    "content": {
      "problem": "Given the head of two singly linked lists num1 and num2 representing two non-negative integers. The task is to return the head of the linked list representing the sum of these two numbers.\nFor example, num1 represented by the linked list : 1 -> 9 -> 0, similarly num2 represented by the linked list: 2 -> 5. Sum of these two numbers is represented by 2 -> 1 -> 5.\nNote: There can be leading zeros in the input lists, but there should not be any leading zeros in the output list.\nExamples:\nInput: num1 = 4 - > 5, num2 = 3 -> 4 -> 5\nOutput: 3 -> 9 -> 0\nExplanation: Given numbers are 45 and 345. There sum is 390.\nInput: num1 = 0 -> 0 -> 6 -> 3, num2 = 0 -> 7\nOutput: 7 -> 0\nExplanation: Given numbers are 63 and 7. There sum is 70.\nConstraints:\n1 <= size of both linked lists <= 106\n0 <= elements of both linked lists <= 9"
    },
    "complexity": {
      "time_complexity": "O(n + m)",
      "space_complexity": "O(max(n, m))"
    },
    "tags": {
      "company_tags": [
        "Flipkart",
        "Morgan Stanley",
        "Accolite",
        "Amazon",
        "Microsoft",
        "Snapdeal",
        "MakeMyTrip",
        "Qualcomm"
      ],
      "topic_tags": [
        "Linked List",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Accolite Interview Experience Set 7 On Campus",
        "url": "https://www.geeksforgeeks.org/accolite-interview-experience-set-7-on-campus/",
        "content_summary": "Accolite visited our campus for full time Software development. First round: MCQ round consists of 30 questions 30 minutes. Questions on C aptitude, four to five general aptitude, two puzzle based aptitude questions. Around 120 wrote test, 10 were selected for next round. Second round: It took around 1 and half hour two people were there. All rounds were purely technical. Questions are, Tell me about yourself. Implementation of queue using two stacks and some modification on that. Finding pair in a given array such that sum is equal to given value. Then he modified for negative numbers. Check if a given tree is binary search tree or not with full code. Child sum problem on binary tree told to write code also. One puzzle related to coin and two rooms. Third round: Only one question in this round. I have to design a dictionary of words such that if any word is entered then it should give meaning for all anagrams for that word. We discussed for one hour. First I told about using try data structure to make dictionary and generate all anagrams of that word then searching each words. But he is not satisfied. Then I came up with some modification in structure of try data structure still not satisfied. Then I come up with multilevel hashing Technique. He somewhat satisfied. Fourth round: It was final round and only two people were selected for this. Puzzle: There will be 17 buckets and some 2197(don’t remember exact number) apples. You have to put these apples in buckets such that if I ask any number of apples then just give any number of buckets such that apples in those buckets should equal to that value. Hint, arranged as bits arranged in binary representation of numbers. Finding loop in a linked list. He first asked you already know this question I told yes sir. Then he asked will it work if by changing fast pointer and slow pointer with difference of 3, 4, 5 nodes. Addition of two linked lists with full code. Numbers are in reverse order and all border conditions should be considered like, lengths are not equal. First he told to write for positive numbers I wrote using recursion. Then he told to write negative numbers. We both were told to wait outside. After few minutes they told only I am selected. Thanks geeksforgeeks.\nRelated Practice Problems\nSum of two numbers represented as arrays\nAdd two numbers represented by linked lists\nCheck for BST\nCombination Sum - Part 2\nAll Practice Problems for Accolite !\n\nComment\nMore info\nCampus Training Program\nNext Article\nAccolite Interview Experience | Set 7 (On-Campus)"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/minimum-element-in-a-sorted-and-rotated-array3611/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:28:40.621226",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Sorted and Rotated Minimum",
      "difficulty": "Easy",
      "accuracy": "40.57%",
      "submissions": "152K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "A sorted array of distinct elements arr[] is rotated at some unknown point, the task is to find the minimum element in it.\nExamples:\nInput: arr[] = [5, 6, 1, 2, 3, 4]\nOutput: 1\nExplanation: 1 is the minimum element in the array.\nInput: arr[] = [3, 1, 2]\nOutput: 1\nExplanation: Here 1 is the minimum element.\nInput: arr[] = [4, 2, 3]\nOutput: 2\nExplanation: Here 2 is the minimum element.\nConstraints:\n1 ≤ arr.size() ≤ 106\n1 ≤ arr[i] ≤ 109"
    },
    "complexity": {
      "time_complexity": "O(log n)",
      "space_complexity": "O(1)"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "Samsung",
        "Snapdeal",
        "Adobe",
        "Times Internet"
      ],
      "topic_tags": [
        "Searching",
        "Algorithms"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/count-the-numbers2359/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:28:51.595768",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Digits in a set",
      "difficulty": "Easy",
      "accuracy": "47.84%",
      "submissions": "12K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Given a number n, count the numbers from 1 to n, which comprise only digits from set {1, 2, 3, 4, 5}.\nExamples:\nInput: n = 20\nOutput: 10\nExplanation: The numbers whose digits are from the given set are: 1, 2, 3, 4, 5, 11, 12, 13, 14, 15.\nInput: n = 100\nOutput: 30\nConstraints:\n1 ≤ n ≤ 105"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley"
      ],
      "topic_tags": [
        "Arrays",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/largest-element-in-array4009/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:29:03.278605",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Largest Element in Array",
      "difficulty": "Basic",
      "accuracy": "67.48%",
      "submissions": "471K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Given an array arr[]. The task is to find the largest element and return it.\nExamples:\nInput: arr[] = [1, 8, 7, 56, 90]\nOutput: 90\nExplanation: The largest element of the given array is 90.\nInput: arr[] = [5, 5, 5, 5]\nOutput: 5\nExplanation: The largest element of the given array is 5.\nInput: arr[] = [10]\nOutput: 10\nExplanation: There is only one element which is the largest.\nConstraints:\n1 <= arr.size()<= 106\n0 <= arr[i] <= 106"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Infosys",
        "Oracle",
        "Wipro",
        "Morgan Stanley"
      ],
      "topic_tags": [
        "Arrays",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/binary-tree-to-dll/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:29:14.385774",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Binary Tree to DLL",
      "difficulty": "Hard",
      "accuracy": "53.36%",
      "submissions": "162K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Given a Binary Tree (BT), convert it to a Doubly Linked List (DLL) in place. The left and right pointers in nodes will be used as previous and next pointers respectively in converted DLL. The order of nodes in DLL must be the same as the order of the given Binary Tree. The first node of Inorder traversal (leftmost node in BT) must be the head node of the DLL.\nNote: h is the tree's height, and this space is used implicitly for the recursion stack.\nExamples:\nInput:\n1\n/  \\\n3    2\nOutput:\n3 1 2\n2 1 3\nExplanation: DLL would be 3<=>1<=>2\nInput:\n10\n/   \\\n20   30\n/   \\\n40   60\nOutput:\n40 20 60 10 30\n30 10 60 20 40\nExplanation: DLL would be 40<=>20<=>60<=>10<=>30.\nConstraints:\n1 ≤ Number of nodes ≤ 105\n0 ≤ Data of a node ≤ 105"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley",
        "Accolite",
        "Amazon",
        "Microsoft",
        "Snapdeal",
        "Goldman Sachs",
        "Salesforce"
      ],
      "topic_tags": [
        "Linked List",
        "Tree",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/nth-node-from-end-of-linked-list/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:29:25.692696",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Kth from End of Linked List",
      "difficulty": "Easy",
      "accuracy": "41.18%",
      "submissions": "420K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Given the head of a linked list and the number k, Your task is to find the kth node from the end. If k is more than the number of nodes, then the output should be -1.\nExamples\nInput: LinkedList: 1->2->3->4->5->6->7->8->9, k = 2\nOutput: 8\nExplanation: The given linked list is 1->2->3->4->5->6->7->8->9. The 2nd node from end is 8.\nInput: LinkedList: 10->5->100->5, k = 5\nOutput: -1\nExplanation: The given linked list is 10->5->100->5. Since 'k' is more than the number of nodes, the output is -1.\nExpected Time Complexity: O(n).\nExpected Auxiliary Space: O(1).\nConstraints:\n1 <= number of nodes <= 106\n1 <= node->data , x <= 106\n1 <= k <= 106"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Flipkart",
        "Morgan Stanley",
        "Accolite",
        "Amazon",
        "OYO Rooms",
        "Samsung",
        "Snapdeal",
        "FactSet",
        "Hike",
        "MAQ Software",
        "Adobe",
        "Qualcomm",
        "Epic Systems",
        "Citicorp",
        "Monotype Solutions"
      ],
      "topic_tags": [
        "Linked List",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Maq Software Interview Experience Set 8 Off Campus For Software Engineer 1",
        "url": "https://www.geeksforgeeks.org/maq-software-interview-experience-set-8-off-campus-for-software-engineer-1/",
        "content_summary": "First Round (Technical Round on Skype (45 minutes ) Q1-some Questions from my resume. Q2-Program for Factorial and how to calculate factorials of large numbers. Q3-Detect a loop in linked list and find the middle node in linked list. Q4-Given a stream of number which are added to the array A[]. find the middle element of the stream. Q5-What is indexing and hashing in DBMS. Q6-Interface in Java. Q7-Difference between Abstraction and Encapsulation. Q8-Multithreading in Java. Second Round Techincal on Skpye (1:30 Hour) Q1-Find the common element in three sorted arrays. optimized approach. Q2-Project Discussion and limitations of the project(First Project).and how you will handle the limitations. Q3-Given 100 balls in which one ball is defective.you also have a balance tell minimum number of steps to find the defective ball. Q4- Write the complexity of the Above puzzle & generalize it for n balls. Q5-Given an linked list find the nth element from the last node. Q6-What is deadlock.what are the conditions for occurring deadlock. Q7-What is Semaphore? Types of semaphore. Q8-What are joins in SQl.Difference between left outer join and right outer join? Q9-write Three commands for DDL,DML,DCL? Q10-What is Transaction in DBMS and also tell the ACID properties? Q11-What is RollBack & savepoint in Transactions. Q12-you have given a employee table in which you have their salary and employee name.      Write a query to find the nth highest salary and the employee name. Third Round Skype ( 1:30 Hour) Q1-Project Discussion Summery Generator using probabilistic model in deep.What was your role in the project.What are the advantages of the project. Q2-Why did you used probabilistic model? why did you not used Vector space model. Q3-On Which technology you have worked till now? Q4-Given a series (6+6*4+6*4*4+6*4*4*4+....so on). write a code to find the nth term of the series. Q5-Tower of Hanoi Problem & time complexity. Q6-What is polymorphism? type of polymorphism. Q7-Static Keyword in c++. Q8-Final keyword in java. Q9-What is constructor and types of constructor. Q10-Life Cycle of a Applet in Java beacuse i had used java applets in my project GUI. Q11-what is Function Overloadig & function overriding and virtual functions. Fourth Round Skpye (30 minutes) Q1-Tell me about yourself? Q2-Tell me your strength and weekness. Q3-Family background? Q4-why do you want to join? Thanks Geeksforgeeks Team.\nAll Practice Problems for MAQ Software !\n\nComment\nMore info\nCampus Training Program\nNext Article\nMAQ Software Interview Experience | Set 8 (Off Campus for Software Engineer-1)"
      },
      {
        "title": "Accolite Interview Experience Set 3 On Campus",
        "url": "https://www.geeksforgeeks.org/accolite-interview-experience-set-3-on-campus/",
        "content_summary": "Written MCQ There were 20 multiple choice questions to be done in 30 minutes time and most of the technical questions were from https://www.geeksforgeeks.org/, one blood and relation question and one simple probability question. There was no negative marking. Paper Coding round 21 students were shortlisted from the 1st MCQ round and in this round we were asked to write the codes (function only) of 3 questions in 1 hour time. Q1. You are given a matrix of size MxN and only possible values in the matrix are 0 - representing empty position 1 – representing a fresh apple 2 – representing a rotten apple A rotten apple converts all the fresh apples to rotten ones which are adjacent to it in 1 unit of time. Given an input the matrix and you have to calculate the amount of time in which all the fresh apples become rotten. Also determine whether all fresh apples could be made rotten in finite time or not. (20 marks) Input 2 1 0 2 1 1 0 1 2 1 1 0 0 2 1 After 1 time unit, the matrix will be transformed to 2 2 0 2 2 2 0 2 2 2 1 0 0 2 2 After 2 time units the matrix will look like 2 2 0 2 2 2 0 2 2 2 2 0 0 2 2 Hence output should be 2 time units. (Definition of adjacent only included the left , right, bottom and upper cell and NOT diagonal cell) Q2. You are given a Binary tree and you need to find out the maximum path sum between any 2 leaf nodes of the binary tree (The maximum path sum may or may not pass through root of tree). To be done in O(n) time (20 marks) Q3. You are given an unsorted array of integers and you need to find out whether there exists a majority element in it. (Majority element is one which appears more than n/2 times in an array of size n). To be done in O(n) time (10 Marks) The result of this round was declared late in the night. Some 7 or 8 students were called for the face to face interview rounds. I was the first one to be called and F2F rounds started at 11.30 PM and ended up in 5 AM in the morning :-p I was lucky to be free around 1.15 AM Face 2 Face Round 1 Q1. I couldn’t complete my Paper coding round question 1 (rotten apples). She (the interviewer) asked me to rectify the problem in it. I did it with the help of MxN extra space for visited[][] matrix. She said do it inplace. I did by modifying the Matrix values to 3 , 4 , etc. Q2. Find 5th from last element in a singly linked list. Firstly I gave a solution which took two traversals. She said to do it in 1 traversal only. I did it by taking two pointers and maintaining a distance of 5 nodes between them. Q3. You are given a string for example if input string is “I am abc xyz”. Output should be the modified string as “xyz abc am I” .This was to be done inplace and in O(n) time. Q4. You are given a unsorted array of both positive and negative integers. You need to find out the maximum sum subarray in O(n) time. You need to find the start and ending indexes along with the sum. Q5. You are given a BST and two keys k1 and k2. You need to find out the lowest common ancestor of the two keys Iteratively. I suggested the solution of storing the path in a vector and finding the 1st mismatch of key value in the root to k1 and root t k2 path. Face to Face round 2 Q1. Take the example of paper coding round rotten apples question and suggest some algorithm where you are allowed to change the position of rotten and fresh apples in such a way that the resultant matrix converts least number of fresh apples to rotten apples. I suggested an approach where I would first count the number of rotten and fresh apples initially and arrange all fresh apples in a sub-matrix starting from (0, 0) position and similarly arrange all rotten apples in sub-matrix from (N-1, M-1) position. He was satisfied with this approach Q2. You are given an elevator system with 3 elevators, you have to suggest some algorithm in which the amount of time that a person waiting on some x floor and has pressed the up or down button should wait for least amount of time and also the person inside the elevator also should not wait for too long to reach his destination floor. Q3. Asked some general questions as to what are tokens of a language. What is a grammar and production rules. Then he asked me to check whether a given code in some language is syntactically correct or not. You are provided the set of valid tokens for this language and also symbol table. Q4. You are given a text file storing characters or words. Suggest some way to compress the file such that there is always some amount of space compression possible. I suggested to use a trie tree as all the prefixes will share the space. He said this approach is dependent on whether the input has common prefixes or not. Suggest some other way. I then said that we can use Huffman Encoding and assign smallest code to most frequent word in the file and so on. He said again this approach also is dependent on whether your input has frequently occurring words or not. Then I suggested that since all characters can be represented in terms of 8 bits or 1 byte. We can take the XOR of prev and next character and store it in the current character position. This way I would be able to always get a n/2 size reduction in the encoded file. The idea was similar to https://www.geeksforgeeks.org/xor-linked-list-a-memory-efficient-doubly-linked-list-set-1/ He was satisfied and this was the end of my 2nd F2F round. He told me to get some sleep because you will be having a skype interview with our technical manager followed by HR round in the morning. 3rd round (Skype) Q1. He asked me to define NP and NP hard problems followed by the definition of automata and regular language. He then asked me are regular expressions. Q2. He shared a google doc with me and gave me a regular expression like abab*(a|b) and an input string s. I needed to write a code to check whether the given input string could be generated from this regular expression or not. Return a Boolean true or false value. I coded it up in 5 minutes :-p Q3. You are given a N-ary tree and a value K. You need to return true if there exists some root to leaf path having sum = k and false otherwise. I did it using recursion and in O(n) time. He told me that you’ll be having your final HR round in some time. I knew that I was going well because he seemed to be quite satisfied with my answers. Final HR round That was the round for which I’ve been waiting for hours She (the HR) started off with some general questions like tell me about yourself and your aims and goals in life. What are your hobbies. I told her that I love art and craft. She asked me what will I make for her if tomorrow is her birthday :-p She was very friendly and nice to talk to. It didn’t seem that I was talking to the HR. It was more like talking to a friend. She asked me what I liked about Accolite and why do I wish to join the company and stuff. Finally we discussed about the pay-scale and work culture in Accolite.\nRelated Practice Problems\nXOR Linked List\nMaximum path sum\nMajority Element\nn'th node from end of linked list\nLowest Common Ancestor in a BST\nReverse words in a given string\nKadane's Algorithm\nRotten Oranges\nAll Practice Problems for Accolite !\n\nComment\nMore info\nCampus Training Program\nNext Article\nAccolite Interview Experience | Set 3 (On-Campus)"
      },
      {
        "title": "Adobe Interview Experience For Mts 1 2",
        "url": "https://www.geeksforgeeks.org/adobe-interview-experience-for-mts-1-2/",
        "content_summary": "First, there was an online round on cocubes of 1 hr 30 min. 1hr was for aptitude which consisted of 60 questions(mental ability, comprehensive, reasoning) and next 30 min was for 2 coding questions that were very basic. Accuracy required in aptitude as coding questions were done by all and aptitude made all the difference. Candidates shortlisted were called for interview in their office. Round 1: \nFirst, he asked me to brief about yourself and there was a long discussion about my projects and their applications. As I mentioned the github link for all the projects, he visited my profile and checked my repositories and asked about github and the tools I have used.\nDetect the loop in the linked list and then find the point from where the loop started. he then asked to write the code. https://www.geeksforgeeks.org/problems/detect-loop-in-linked-list/1\nSearch in row-wise and column wise sorted matrix. https://www.geeksforgeeks.org/problems/search-in-a-matrix17201720/1  he emptied some cells in the matrix and asked how to insert the number in the matrix. only logic was required.\nWhat are threads and processes? Can two threads in a process communicate? Is communication possible between two threads of two different processes? https://www.geeksforgeeks.org/inter-thread-communication-java/   https://www.geeksforgeeks.org/inter-process-communication/\nRound 2:\nFirst the small introduction and then he asked to rate my favorite(java) programming language.\nAgain the same question of the linked list was asked in the 2nd round but this time he asked me to prove my solution. Proof of solution of slow and fast pointer concept to find the meeting point was asked. He wants me to answer that the point where slow and fast pointer meets is the midpoint of the whole linked list. https://www.geeksforgeeks.org/problems/detect-loop-in-linked-list/1\nFind the nth node from the end of a linked list and write the code. https://www.geeksforgeeks.org/problems/nth-node-from-end-of-linked-list/1\nPostorder traversal of a tree and code it.\nDifference between mutex and semaphore. Difference between the mutex and binary semaphore.\nAt last, a long discussion of about 45min on the implementation of hashmap was held. He made a class where hashcode method and equals method of object class was overridden. the object of the class was the key and many values were put in the hashmap and the output was asked along with the size of an array used in a hashmap and then their time complexity. He changed the implementation of the above 2 methods 4 times and then asked the same questions. For Ex, if hashcode return 1 and equals method return true always then every time value is overwritten and size of an array is 1 and complexity is O(1) as the complexity of hashcode and equals method is O(1).\nThen again discussion continued on hashmap. Given a class of city which contains all the malls in it and a class of mall which contains cities in which it is present. what should be done to make both city and mall to act as a key of the hashmap. Here runtime polymorphism was used where a base class was made with equals and hashcode method which is inherited by both city and mall class. https://www.geeksforgeeks.org/internal-working-of-hashmap-java/\nRound 3:\nhttps://www.geeksforgeeks.org/problems/rotate-by-90-degree-1587115621/1\nif you have a directory of many files then how will you find the duplicate files or which data structure is best for performing that search of duplicate files. Ans: hashmap. this technique is used by WhatsApp to remove all the duplicate messages like forwarded messages.\nHe scanned my resume and asked me to detail about my all the projects and many questions were asked related to it. All the technical problems faced etc.\nAs I was the vice-captain of volleyball so he asked about the duties of a captain. Is it possible to have a captain and a vice-captain not in playing six?\nRound 4 (HR): General discussion. The evaluation was not done in this round. Asked me about good and bad of adobe. He explained everything about Adobe its culture its spread its new technologies. My Feedback from previous interviewers was discussed. Finally, I got the offer. Thank you, Geeks For Geeks for providing study material.It helped a lot.\n\nComment\nMore info\nAdvertise with us\nNext Article\nAdobe Interview Experience (For MTS-1)"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/swap-kth-node-from-beginning-and-kth-node-from-end-in-a-singly-linked-list/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:29:44.756004",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Swap Kth nodes from ends",
      "difficulty": "Medium",
      "accuracy": "35.5%",
      "submissions": "61K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "A singly linked list and an integer of k are given. You need to swap the kth node from the beginning and the kth node from the end of the linked list. Swap the nodes through the links. Do not change the content of the nodes.\nNote: The driver code will output \"true\" if you successfully swap the nodes.\nExamples:\nInput: LinkedList: 1->2->3->4, k = 1\nOutput: true\nExplanation: Here k = 1, hence after swapping the 1st node from the beginning and end the new list will be 4->2->3->1.\nInput: LinkedList: 1->2->3->4->5, k = 7\nOutput: true\nExplanation: k > n. Swapping is invalid. Return the head node as it is.\nExpected Time Complexity: O(n)\nExpected Auxillary Space: O(1)\nConstraints:\n1 <= number of nodes <= 103\n1 <= node->data <= 106\n1 <= k <= 103"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley",
        "Amazon"
      ],
      "topic_tags": [
        "Linked List",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/clone-a-linked-list-with-next-and-random-pointer/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:29:56.074346",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Clone List with Next and Random",
      "difficulty": "Hard",
      "accuracy": "64.8%",
      "submissions": "112K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "You are given a special linked list with n nodes where each node has two pointers a next pointer that points to the next node of the singly linked list, and a random pointer that points to the random node of the linked list.\nConstruct a copy of this linked list. The copy should consist of the same number of new nodes, where each new node has the value corresponding to its original node. Both the next and random pointer of the new nodes should point to new nodes in the copied list, such that it also represent the same list state. None of the pointers in the new list should point to nodes in the original list.\nReturn the head of the copied linked list.\nNOTE : Original linked list should remain unchanged.\nExamples:\nInput: head = [[1, 3], [3, 3], [5, NULL], [9, 3]]\nOutput: head = [[1, 3], [3, 3], [5, NULL], [9, 3]]\nExplanation:\nNode 1 points to Node 2 as its NEXT and Node 3 as its RANDOM.\nNode 2 points to Node 3 as its NEXT and Node 3 as its RANDOM.\nNode 3 points to Node 4 as its NEXT and NULL as its RANDOM.\nNode 4 points to NULL as its NEXT and Node 3 as its RANDOM.\nInput: head = [[1, 3], [2, 1], [3, 5], [4, 3], [5, 2]]\nOutput: head = [[1, 3], [2, 1], [3, 5], [4, 3], [5, 2]]\nExplanation:\nNode 1 points to Node 2 as its NEXT and Node 3 as its RANDOM.\nNode 2 points to Node 3 as its NEXT and Node 1 as its RANDOM.\nNode 3 points to Node 4 as its NEXT and Node 5 as its RANDOM.\nNode 4 points to Node 5 as its NEXT and Node 3 as its RANDOM.\nNode 5 points to NULL as its NEXT and Node 2 as its RANDOM.\nInput: head = [[7, NULL], [7, NULL]]\nOutput: head = [[7, NULL], [7, NULL]]\nExplanation:\nNode 1 points to Node 2 as its NEXT and NULL as its RANDOM.\nNode 2 points to NULL as its NEXT and NULL as its RANDOM.\nConstraints:\n1 <= n <= 100\n0 <= node->data <= 1000"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Flipkart",
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "OYO Rooms",
        "Snapdeal",
        "D-E-Shaw",
        "MakeMyTrip",
        "Ola Cabs",
        "Walmart",
        "Adobe",
        "BankBazaar"
      ],
      "topic_tags": [
        "Linked List",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Bankbazaar Com Interview Experience Set 7 Senior Android Developer",
        "url": "https://www.geeksforgeeks.org/bankbazaar-com-interview-experience-set-7-senior-android-developer/",
        "content_summary": "Position : Senior Android Developer The competency would be Tech Fit (Problem Solving, Data Structures & Algorithm) First Round: Telephonic Round: 1. Clone a linked list with next and random pointer https://www.geeksforgeeks.org/a-linked-list-with-next-and-arbit-pointer/ 2. You have to design a data structure where you have a list. You need to do 3 operations 1. Insert at position. 2. Get Value from an index. 3. Update all index All in time complexity O(1). Hint : I have used count for each index and have extra variable to store value if user call Update all index. With the help of count you can determine if you have to pick value from index or from extra update variable. On-site round in banglore Second round: 1. Question related to project. 2.We have n cards with each card numbered from 1 to n. All cards are randomly shuffled. We are allowed only operation MoveCard(n) which moves the card with value n to the top of the pile. We need to sort the pile of cards with minimum number of MoveCard operations. The naive approach which i can think of is start with MoveCard(n), MoveCard(n-1), MoveCard(n-2).... MoveCard(1). This approach will solve the problem in n MoveCard operations. https://stackoverflow.com/questions/21852309/sort-a-deck-of-cards-with-minimum-number-of-moves Third Round: 1. It was the variation of tree Common Ancestor problem and linked-list Y node problem. I don't remember exactly but if you know these two you will be able to answer. 2. Longest Increasing Subsequence https://www.geeksforgeeks.org/dynamic-programming-set-3-longest-increasing-subsequence/ Fourth Round: 1. 100 people are standing in a circle with gun in their hands. 1 kills 2, 3 kills 4, 5 kills 6 and so on till we are left with only one person. Who will be the last person alive. Write code to implement this efficiently. 2. java circular dependency questions. 3. Some basic questions 4. Write a program with two threads (A and B), where A prints 1 , B prints 2 and so on until 50 is reached. Thanks GFG  \nRelated Practice Problems\nClone a linked list with next and random pointer\nSort the pile of cards\nLongest Increasing Subsequence\nAll Practice Problems for BankBazaar !\n\nComment\nMore info\nCampus Training Program\nNext Article\nBankBazaar.com Interview Experience | Set 7 (For Senior Android Developer)"
      },
      {
        "title": "Ola Cabs Interview Experience Set 2 Android 1 5 Years",
        "url": "https://www.geeksforgeeks.org/ola-cabs-interview-experience-set-2-android-1-5-years/",
        "content_summary": "First Round Written Test 1) Implement Stack Operations. Also maintain count of Largest Integer present in Stack at any given point of Time. 2) Implement Minesweeper Game. 3) Design an Android application to emulate Countdown .. Take Input from the User and start counting down from entered value till Zero with Updating App UI at every count. Show Countdown end message when reached at Zero 1st Round. Lots of Java basics Android Activity lifecycles and detailed discussions about it Services and Fragments Lifecycle. Difference methods of Creating Threads One fragment Related Coding problem where UI of Fragment B has to be updated from fragment A. How Garbage Collector Works in Android. Questions on Dalvik Virtual Machine. Different types of BroadCasts and Broadcast Receivers 2nd Round DS Questions Find Total number of leaf Nodes in B-tree Clone Linklist with random pointers. Find Missing number in AP. Print Left View of B-Tree. Some Java Questions based Exceptions 3rd Round Current Project Discussion. Few questions related to that. Questions on Telephony Class and Geofencing. Problem related to Reverse geocoding. Persistent Storage types in Android. Discussion on Content Providers and Shared Preferences. Coding on Content providers Given a rotated array 'K' times (K unknown), find a number in most efficient way. Scheduling algorithms in OS. (Implement LRU using choice of your language) BFS traversal of B Tree. Key is to Stay ultra confident, smile and try solving each problem with whatever way you know. Good Luck.\nRelated Practice Problems\nCount Leaves in Binary Tree\nLevel order traversal\nClone a linked list with next and random pointer\nArithmetic Number\nAll Practice Problems for Ola-Cabs !\n\nComment\nMore info\nCampus Training Program\nNext Article\nOLA Cabs Interview Experience | Set 2 (For Android - 1.5 Years)"
      },
      {
        "title": "Makemytrip Interview Experience Set 4",
        "url": "https://www.geeksforgeeks.org/makemytrip-interview-experience-set-4/",
        "content_summary": "Round 1 : Written : Q1. Given a stream of around billion numbers in an array, which has approximately only 1000 unique numbers. Print the unique numbers. Complexity should be less than O(n). Eg: Input: 1,1,1,1,….2,2,2,…3,4,4,4,4……1111,1111,……….. Output : 1,2,3,4,1111 Q2: Write a program to print the frequency of all words in a given paragraph. Q3: Write a program to reverse the string word wise. Eg: I/P : “I am a boy” O/P: “boy a am I” Q4: Write a program to explain producer consumer program using threads. Q5: (Only theory) What data structures will you use to design a garbage collector. Round 2: F2F Q1: Given an array in which all numbers except two are repeated once. (i.e. we have 2n+2 numbers and n numbers are occurring twice and remaining two have occurred once). Find those two numbers in the most efficient way Q 2 : Given a linked list with next and arbitrary pointers, clone it. Q 3 : A lot of questions around Spring, Hibernate, REST, Dependency Injection, AOP etc. Q4 : Reverse a linked list in groups of n. Round 3: F2F Q1: Vertical level order traversal of a tree. Q2: Reverse the second half of the linked list in the most efficient way. Q3: Find the merging point of two linked list. Q4: Write a function to generate all possible n pairs of balanced parentheses. For example, if n=1{} for n=2 {}{} {{}} Q5 : Again a lot of drilling questions on Java, Spring, MVC, Singleton, Hibernate, REST. Round 4 : F2F (Manager/Architect) This round had questions more around various technology stacks, Design Patterns ( Interceptor, Singleton, Publisher Subscriber, MVC etc etc ) UI Templates REST Spring Java In memory database Log appenders Round 5: F2F ( H.R. ) Generic questions like why do you want to join Makemytrip. What are your career aspirations. How do you think it aligns with MMT. Thanks to geeksforgeeks for the awesome database of questions, that helped me clear the interview.\nAll Practice Problems for MakeMyTrip !\nRelated Practice Problems\nPrint a Binary Tree in Vertical Order\nIntersection Point in Y Shapped Linked Lists\nClone a linked list with next and random pointer\nReverse a Linked List in groups of given size.\nFinding the numbers\n\nComment\nMore info\nCampus Training Program\nNext Article\nMakeMyTrip Interview Experience | Set 4"
      },
      {
        "title": "Makemytrip Interview Experience Set 8 On Campus",
        "url": "https://www.geeksforgeeks.org/makemytrip-interview-experience-set-8-on-campus/",
        "content_summary": "MakeMyTrip recently visited our campus. There were 4 rounds. Online Round ( 1 Hour ) This round consisted of 20 aptitude questions and 3 coding Questions. Coding Questions: 1. Find ‘x’ in the equation. The input is in the form of a string. Equation consisted of addition operator only and 2 integers and a variable ‘x’. Sample Input Case: x+3=5 output=2 Decoding the string into 2 numbers and an unknown variable took a lot of time. 2. Given two numbers x and y find x^y in log y time. 3. Find the next palindromic number greater than the current number. Had solved all 3 questions and around 15 questions in aptitude. Was shortlisted for the next round. Technical Interview 1 ( 1 Hour 20 mins ) Firstly the interviewer asked me to introduce myself, asked me about my projects. Then he moved on to coding questions and puzzles and some basic object oriented fundamentals: All the questions below were in random order. 1. Questions related to collections, interfaces, JBM, JDE, Polymorphism and Abstraction. 2. Coding question : Full codes to be written a> Given an array comprising of only 1’s and 0’s , find the maximum length along with the starting indexand ending index which consisted equal number of 1’s and 0’s. I could not do it, the interviewer gave me another question: Given an array comprising of any number ( both positive and negative), find the maximum length alongwith starting and ending index which had sum equal to 0. I was able to do this one. The interviewer told me to solve the previous question now. I told him that replace all the 0’s with -1’s and the question becomes entirely the same. b> To Check whether a binary tree is a BST or not? 3. Puzzles: 1. There are 3 switches outside a room. Inside the room there is only 1 bulb. You could go inside the room only once, how will you know with which bulb the switch is associated with. 2. There are 100 coins in a table. 20 coins are heads and others are tails (facing upwards). Find the optimal cut(2 piles) such that both have equal number of heads facing up.Technical Interview 2 ( 1 hr ) Technical Interview 2 ( 1 hr ) Coding Questions: 1. Cloning Linked List with every node comprising of next and (random pointer to any other node). 2. Detect Loop in a Linked List and remove it. 3. In-place reversing of a string. Questions about abstract data type, abstract keyword, difference between C++ and Java, garbage collection in Java and OOPS concepts were asked. HR Round ( 20 mins ) Basic details, family background and why do you want to join this company? Where do you see yourself after 5 years and questions about weakness and strengths.\nAll Practice Problems for MakeMyTrip !\nRelated Practice Problems\nPower of Numbers\n\nComment\nMore info\nCampus Training Program\nNext Article\nMakeMyTrip Interview Experience | Set 8 (On-Campus)"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/remove-loop-in-linked-list/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:30:16.118726",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Remove loop in Linked List",
      "difficulty": "Medium",
      "accuracy": "27.66%",
      "submissions": "515K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Given the head of a linked list that may contain a loop.  A loop means that the last node of the linked list is connected back to a node in the same list. The task is to remove the loop from the linked list (if it exists).\nCustom Input format:\nA head of a singly linked list and a pos (1-based index) which denotes the position of the node to which the last node points to. If pos = 0, it means the last node points to null, indicating there is no loop.\nThe generated output will be true if there is no loop in list and other nodes in the list remain unchanged, otherwise, false.\nExamples:\nInput: head = 1 -> 3 -> 4, pos = 2\nOutput: true\nExplanation: The linked list looks like\nA loop is present in the list, and it is removed.\nInput: head = 1 -> 8 -> 3 -> 4, pos = 0\nOutput: true\nExplanation:\nThe Linked list does not contains any loop.\nInput: head = 1 -> 2 -> 3 -> 4, pos = 1\nOutput: true\nExplanation: The linked list looks like\nA loop is present in the list, and it is removed.\nConstraints:\n1 ≤ size of linked list ≤ 105"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "VMWare",
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "Snapdeal",
        "MakeMyTrip",
        "Oracle",
        "Walmart",
        "Goldman Sachs",
        "Adobe",
        "Qualcomm",
        "Kuliza",
        "Netskope"
      ],
      "topic_tags": [
        "Linked List",
        "two-pointer-algorithm",
        "Data Structures",
        "Algorithms"
      ]
    },
    "interview_experiences": [
      {
        "title": "Vmware Interview Experience Set 9 Internship Rd",
        "url": "https://www.geeksforgeeks.org/vmware-interview-experience-set-9-internship-rd/",
        "content_summary": "Vmware conducted their online exam via hirepro. Round 1 : There were 3 sections quants, Technical questions and OOPs based questions, no section had negative marks and all questions were MCQs. The quantitative section had 10 questions and we were given 15 minutes, the questions covered all the typical quants topics (like time and work, mixtures & allegations etc.). The questions were hard and were time consuming the trick was to identify the questions you could solve(I could solve only 4). Next there were 23 technical questions, they were easy and medium level, from all topics(OS, CN, Computer Architecture etc.). Then we had a choice before the OOPs section to opt for either Java or C++, I chose java and had to answer 7 tricky questions mostly focusing on inheritance and how constructors work with inheritance. Around 150 students gave the first round from which 42 progressed. Round 2: This was a face to face technical round. I introduced myself and then the interviewer directly jumped onto my projects and asked me to talk about them. I had made an android app which I showed him(I carried my phone) my second project particularly took his attention which was based on Machine Learning I had to explain my project in detail for about 15-20 minutes. He asked me questions on all topics like OOPS, Data Structures, OS, CN. Before beginning he asked me to rate my proficiency in c,c++& JAVA on a scale from 1 to 10. To the best of my memory the questions were: 1) Explain properties of OOPS. (tried to confuse me) 2) Types of constructors. (wanted to hear copy constructor and how it is defined in different ways in c++ and java.) 3) Gave me a typical inherent scenario and asked me how parent class and child class default constructors are called. 4) Asked me to detect& remove loop in a linked list. (I told him I already knew the algo. so we moved on) 5) Asked me to write the expression for height of a complete binary tree. 6) Array to BST (tried to convince me a solution which could give a skewed tree was better) 7) Asked me about different CPU scheduling algo and made me solve a given scenario for wait time and turn around time using different scheduling algos. 8) Asked me about gateway routers and asked me to calculate subnet mask for a given range of IPs. The interviewer tried to pressure me into changing my answers being confident was the key. Round 2 : This was the second technical face to face round. My interviewer was problem-solvingmmediately made me comfortable. After talking about my project in detail, he moved on to problem solving and asked me just 2 questions. 1) Given a sparse 2D matrix (containing 0s and 1s) I had to make all entries of a row and column '1' which had at least one entry as '1'. I gave a O(n^2) solution using hashing he asked me to write down the complete code. 2) In a binary tree find the the level with maximum number of nodes. A typical solution would be Level order traversal but I gave a different solution by connecting all the nodes in a particular level. 6 students cleared the 2nd technical round. Round 3: It was a managerial discussion round, which was basically a telephonic interview with the manager. Other students were asked few technical questions , the interview was more focused on judging your attitude and if you were a good fit for the team. My telephonic interview was mostly about my Machine Learning project, mild business acumen and why I wanted to do an internship at Vmware. Round 4: The final round was the hr round, I was asked about my family background and what would be my reaction if I don't get this internship. Finally all 6 who cleared the technical rounds were selected for a 6 months internship at Vmware, Bangalore. Also we were given vmware bottles :p\nRelated Practice Problems\nMaximum Width of Tree\nRemove loop in Linked List\nHeight of Binary Tree\nArray to BST\nBoolean Matrix Problem\nAll Practice Problems for VMWare !\n\nComment\nMore info\nCampus Training Program\nNext Article\nVmware Interview Experience | Set 9 (Internship (R&D))"
      },
      {
        "title": "Walmart Labs Interview Experience Set 2 On Campus",
        "url": "https://www.geeksforgeeks.org/walmart-labs-interview-experience-set-2-on-campus/",
        "content_summary": "1st round (Written Test) It was an online test of 90 minutes and was conducted on Hackerearth. It consisted of 10 MCQ’s and 3 coding questions. MCQ’s consisted of general aptitude questions, questions related to networking, programming etc and very easy. The coding questions were as follows: 1. http://www.spoj.com/problems/FARIDA/. The question was exactly this. (standard dp problem). (35 marks for this question). 2. Given arrival and departure time of employees in an office. Find the maximum no of chairs needed so that at no instance, an employee has to stand. (30 marks question). Example- Input- 5.00 6.00 7.00 6.30 7.00 8.00 Output-2 It is similar to this. The main thing in this question was reading the input as number of employees was not given beforehand. It was also asked to check for all INVALID inputs and return -1 in those cases. 3. Given a 2D matrix of n x m. The matrix contained integers. Given a source position of a person and a destination position, find the number of ways in which that person can reach destination from source fulfilling the following conditions- (i) Movement can be only in north, south, east or west direction. (ii) A person can move from one cell to other if and only if that cell has value less than the value in current cell. (standard bfs problem). (25 marks question). 2nd round (Technical Interview)- 1. Given a binary tree, print its bottom view. She asked me to write the code on paper. 2. Given a character array and a dictionary, find the no. of valid sentences that can be made by putting space after any character in this array. A valid sentence is the one whose all the words are present in the dictionary. Write code on paper. Example- Input- catsanddog Output- 2 (cat sand dog & cats and dog) 3. Given an array of random integer, find the maximum length of subsequence in it such that the elements of subsequence are consecutive. Example- input [25,1,26,2,27,3,29,28] Ans=5 (subsequence 25,26,27,29,28} I told her a brute force method of O(n^2) and a O(nlogn) solution but she was looking for a O(n) dp solution. This round lasted for about 1 hour. 3rd round (Technical Interview)- 1. Given an array and a frog, there can be a bridge from any index to any index in forward direction and a tunnel from any index to any other index in backward direction. Frog is initially at -1 index. Given an integer k, from can hop at most k-1 times. i.e. if k=4 and frog initially is at -1, then it can reach cell 0,1,2 (3 hops at max). A frog on landing on a cell containing a bridge or a tunnel can avoid using that bridge or tunnel and stay there only. Find the minimum no. of steps in which the frog can reach a given destination ‘D’. I converted the whole problem into a graph where each node will have connections to its next k-1 nodes and also connection to a node to which a bridge or tunnel on that node leads (if any bridge or tunnel is there at that node) and then Applied BFS. He then asked me to write code on paper. Complexity-O(n*k) 2. Given a linked list having loop, detect the loop and return the starting point of that loop. 3. He asked me about what is map (general concept of map not language specific as in c++ or java). He then told me to design a data structure using the basic data structures such that searching in that can be done in O(1) in 95% cases and in 5% cases searching can take more than O(1) and the element to be searched can be an integer or a string. I told him to take hash of string in any way (multiplying by prime nos etc.) and then take modulo 10^6 as maximum size of array can be 10^6. He then asked me how will I remove collisions occurring due to same hash value. I told him to use chaining with a balanced BST at the collision index in order to achieve minimum complexity (o(logn)). He then asked me that if suppose during 1 year only 100 elements were required to be stored in array and searched in above problem and after 1 year elements become 10^6, then during 1 year a lot of memory will be wasted if I allocate 10^6 initially; he asked me how would I do this. I told him that initially allocate memory of array of 100 size and then after 1 year, allocate a new memory of 10^6 elements and copy elements from original array to new array. This round lasted for about 1 hour. 4th round (Managerial Round)- It was a short round of nearly 10-15 minutes. The interviewer asked me to introduce myself. He then asked me why do I want to join Walmart. Why don’t I want to pursue higher studies, difference between job and career and what does I want, job or a career? He then asked me what do I want to achieve in the next 5 Years. He then asked a brief description about the project mentioned in my resume. 5th round (HR Round)- It was also a short round of nearly 5-10 minutes. HR asked me to introduce myself. Asked me about my hobbies. One of my hobbies mentioned was reading newsfeed on quora so she asked whether Iwas active on quora and what all topics do I follow on quora. She then asked me why do I want to join Walmart, where do I see myself in 2 years. She asked me if I had interest in programming and on what websites do I take part in coding competition. I mentioned codeforces, codechef, hackerrank. She then told me about work at Walmart and asked me whether I would like to work on web development front and back end or back end of logistics. Advice: Prepare all the data structures from geeksforgeeks, maximum question asked were from geeks only. Think aloud in the interview. The interviewer will help by giving hints whenever u will be stuck at any problem.\n\nAll Practice Problems for Walmart !\nRelated Practice Problems\nBottom View of Binary Tree\nLongest consecutive subsequence\nWord Break\nRemove loop in Linked List\nMinimum Platforms\n\nComment\nMore info\nCampus Training Program\nNext Article\nWalmart Labs Interview Experience | Set 2 (On-Campus)"
      },
      {
        "title": "Makemytrip Interview Experience Set 8 On Campus",
        "url": "https://www.geeksforgeeks.org/makemytrip-interview-experience-set-8-on-campus/",
        "content_summary": "MakeMyTrip recently visited our campus. There were 4 rounds. Online Round ( 1 Hour ) This round consisted of 20 aptitude questions and 3 coding Questions. Coding Questions: 1. Find ‘x’ in the equation. The input is in the form of a string. Equation consisted of addition operator only and 2 integers and a variable ‘x’. Sample Input Case: x+3=5 output=2 Decoding the string into 2 numbers and an unknown variable took a lot of time. 2. Given two numbers x and y find x^y in log y time. 3. Find the next palindromic number greater than the current number. Had solved all 3 questions and around 15 questions in aptitude. Was shortlisted for the next round. Technical Interview 1 ( 1 Hour 20 mins ) Firstly the interviewer asked me to introduce myself, asked me about my projects. Then he moved on to coding questions and puzzles and some basic object oriented fundamentals: All the questions below were in random order. 1. Questions related to collections, interfaces, JBM, JDE, Polymorphism and Abstraction. 2. Coding question : Full codes to be written a> Given an array comprising of only 1’s and 0’s , find the maximum length along with the starting indexand ending index which consisted equal number of 1’s and 0’s. I could not do it, the interviewer gave me another question: Given an array comprising of any number ( both positive and negative), find the maximum length alongwith starting and ending index which had sum equal to 0. I was able to do this one. The interviewer told me to solve the previous question now. I told him that replace all the 0’s with -1’s and the question becomes entirely the same. b> To Check whether a binary tree is a BST or not? 3. Puzzles: 1. There are 3 switches outside a room. Inside the room there is only 1 bulb. You could go inside the room only once, how will you know with which bulb the switch is associated with. 2. There are 100 coins in a table. 20 coins are heads and others are tails (facing upwards). Find the optimal cut(2 piles) such that both have equal number of heads facing up.Technical Interview 2 ( 1 hr ) Technical Interview 2 ( 1 hr ) Coding Questions: 1. Cloning Linked List with every node comprising of next and (random pointer to any other node). 2. Detect Loop in a Linked List and remove it. 3. In-place reversing of a string. Questions about abstract data type, abstract keyword, difference between C++ and Java, garbage collection in Java and OOPS concepts were asked. HR Round ( 20 mins ) Basic details, family background and why do you want to join this company? Where do you see yourself after 5 years and questions about weakness and strengths.\nAll Practice Problems for MakeMyTrip !\nRelated Practice Problems\nPower of Numbers\n\nComment\nMore info\nCampus Training Program\nNext Article\nMakeMyTrip Interview Experience | Set 8 (On-Campus)"
      },
      {
        "title": "Adobe Interview Experience Shecodes Software Engineer",
        "url": "https://www.geeksforgeeks.org/adobe-interview-experience-shecodes-software-engineer/",
        "content_summary": "Recently, I gave an interview for Adobe for the position of Software Engineer. Hiring was done underAdobe Shecodes Hiring 2020 Batch so as the name suggests only female candidates from the Circuit Branches were eligible. There were 6 rounds in total.\nFirst Round -ONLINE TEST - (120 students) :\nSection I: Aptitude and Logical Section Number of Questions: 60 Time Duration: 60 min Level of Difficulty: Medium-High\nType of Questions No. of  Questions\nQuantitative 20\nLogical and Reasoning 20\nVerbal 20\nSection II: Coding Section Number of Questions: 2 Time Duration: 60 min Level of Difficulty: Easy-Medium Type of Questions:  String Manipulation and Tree-based Question. Only 20 students were shortlisted for further rounds.\n**The further mentioned rounds were held in ADOBE  Noida Campus.**\n  Second Round –PEN PAPER ROUND –(20 students*): It was a non-eliminatory round comprising of 3 sections with a total time of 30 minutes.\nSection I: Technical MCQ’s Number of Questions: 20 Level of Difficulty: Medium-High Programming Output questions and questions from CN, DBMS, OS, and DS were asked. Section II: Aptitude and Logical Section Number of Questions: 10 Level of Difficulty: Easy Section III: Coding Section Number of Questions: 2 Level of Difficulty: Easy-Medium Question 1: https://www.geeksforgeeks.org/problems/leaders-in-an-array-1587115620/1 Question 2: https://www.geeksforgeeks.org/problems/spirally-traversing-a-matrix-1587115621/1 *Candidates from other colleges were also there. 20 Students were shortlisted from my college.\nThird Round –TECHNICAL INTERVIEW 1\nThe interview went for about 75-80 minutes. I was not able to answer almost all the answers correctly but gave almost 75% correct answers. The interviewer mainly focused on the problem-solving ability and the quality of conceptual knowledge. We were judged on 5 criteria in all the technical Interviews- DSA, Coding, Puzzles, Testing Questions and Operating system. 1: Basic Introductory Questions 2: 2-3 Puzzle Questions which we can easily find on https://www.geeksforgeeks.org/puzzles/ i: You have a birthday cake and have to cut it into 8 equal pieces by making 3 cuts only. How do you do it? ii: You are standing before two doors. One of the paths leads to heaven and the other one leads to hell. There are two guardians, one by each door. You know one of them always tells the truth and the other always lies, but you don’t know who the honest one is and who the liar is.You can only ask one question to one of them in order to find the way to heaven. What is the question? 3: Some basic Questions on DSA- about stacks, queue, arrays, memory storage accessing, Advantages and Dis of the Linked list over arrays, 4: Operating System: In all the rounds, Operating System questions were asked in abundance. Though the questions were basic, they focused more on our concepts like how easily we were able to explain it to them. Questions on Kernels, Types of Kernel, Why OS, memory allocation in OS were asked. 5: Test Cases Question: We have to think and answer the possible questions while testing the cases. i: Test cases for a login page window. 6: Heavy discussions on the projects I have done. Why we preferred to use a particular technology. What was my role in the project and so on. 7: I was asked to code some questions. i: https://www.geeksforgeeks.org/problems/mirror-tree/1 ii: https://www.geeksforgeeks.org/problems/find-second-largest-element2406/1 iii: https://www.geeksforgeeks.org/problems/remove-loop-in-linked-list/1 After a wait of about 15 minutes, I was called for my second round of Interview.  \nFourth Round -TECHNICAL INTERVIEW 2\nThis round of interview was taken by a senior person of the company. It was a bit lengthy as we had more of a discussion rather than just a QnA round. The interview went for more than 90 minutes and was tougher than the first round. 1: There was a long discussion on what I have written in my resume. The projects I had done, Extracurricular and co-curricular activities I had written on the resume, the skills I have mentioned. All of it. So be careful of whatever you mention in the resume. 2: Next he asked me a bunch of coding questions which were some very popular ones i: https://www.geeksforgeeks.org/problems/anagram-1587115620/1 ii: Implementation of Merge Sort https://www.geeksforgeeks.org/merge-sort/ iii: Implementing Queue using stacks and Stack using queues. iv:  https://www.geeksforgeeks.org/problems/find-first-repeated-character4108/1 I was asked to code in my preferred language. So there wasn’t any language barrier and for all the questions the interviewer asked for the most optimized approach. As I was able to answer all the questions, I wasn’t asked any more questions. 3: After the coding questions, I was asked a lot of questions about Operation System and OOPS. i:   Fragmentation- Internal and External ii:  Concepts of Kernel iii:  File Management iv:  Virtual functions and Friend Functions v:  Function Overloading And Overriding vi: What is paging and Demand Paging? 4: Interview puzzles: i: The mislabeled Jar puzzle https://www.geeksforgeeks.org/puzzle-mislabeled-jars/ ii: Maximize probability of White Ball https://www.geeksforgeeks.org/puzzle-12-maximize-probability-of-white-ball/ iii:  100 Prisoners with Red/Black Hats https://www.geeksforgeeks.org/puzzle-13-100-prisoners-with-redblack-hats/ 5:  Testing Based Questions- i: Five new inventions in a glass frame and the test cases to test the working a frame. ii: Design test cases for a shopping application. The interviewer was quite satisfied with the test cases I answered. As the main trick to solve these kinds of interview questions is to design the test cases by giving every small function an eye and then forming all possible scenarios for the same.  \nFifth Round -TECHNICAL INTERVIEW 3 + MANAGERIAL ROUND\n  This was also similar to the last two Technical Interviews and was also easier from them. The interview went for about 70 minutes and It was tilted more towards the managerial side and less Technical was asked. 1: Program to Count set bits in an integer. (I answered 4 possible solutions to him and he was satisfied)  https://www.geeksforgeeks.org/problems/set-bits0143/1 2: Working of Bubble Sort and Insertion Sort ( I was asked to dry run the solution mainly to check the internal working of swapping and comparison) 3: Torch and Bridge https://www.geeksforgeeks.org/puzzle-18-torch-and-bridge/ 4:  Some Mathematical Puzzles 5: Design test cases for OLA Application 6: Design test cases for GMAIL Application 7: Situation based questions 8: What is a Semaphore and operations on a semaphore? 9: What is context switching?  \nSixth Round - HR INTERVIEW\nIt was the last round and an eliminatory round as well.  The interviewer was pretty cool. After the introduction, I was asked questions like where are you from? What is special about you?  Why should we select you? Which was your favorite subject last semester? Which Adobe products you liked the most and why? It was a 20 minutes long discussion round about college life, interests, and hobbies. The HR also asked our preferred joining location between Noida and Bangalore which gave us many hopes of our selection. Three candidates from our college went to the HR Round. Two days later we received the confirmation mail that two students are selected. HOPE THIS INTERVIEW EXPERIENCE HELPS YOU!!!\n\nComment\nMore info\nAdvertise with us\nNext Article\nAdobe Interview Experience | SHECODES-Software Engineer"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/finding-middle-element-in-a-linked-list/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:30:37.411555",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Middle of a Linked List",
      "difficulty": "Easy",
      "accuracy": "57.93%",
      "submissions": "372K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Given the head of a linked list, the task is to find the middle. For example, the middle of 1-> 2->3->4->5 is 3. If there are two middle nodes (even count), return the second middle. For example, middle of 1->2->3->4->5->6 is 4.\nExamples:\nInput: Linked list: 1->2->3->4->5\nOutput: 3\nExplanation: The given linked list is 1->2->3->4->5 and its middle is 3.\nInput: Linked list: 2->4->6->7->5->1\nOutput: 7\nExplanation: The given linked list is 2->4->6->7->5->1 and its middle is 7.\nExpected Time Complexity: O(n)\nExpected Auxiliary Space: O(1)\nConstraints:\n1 <= no. of nodes <= 105"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "VMWare",
        "Zoho",
        "Flipkart",
        "Morgan Stanley",
        "Amazon",
        "Microsoft",
        "Samsung",
        "Hike",
        "Payu",
        "MAQ Software",
        "Adobe",
        "Wipro",
        "SAP Labs",
        "Qualcomm",
        "Nagarro",
        "GE",
        "Veritas",
        "IgniteWorld",
        "Netskope"
      ],
      "topic_tags": [
        "Linked List",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Vmware Interview Experience Set 4 Campus",
        "url": "https://www.geeksforgeeks.org/vmware-interview-experience-set-4-campus/",
        "content_summary": "Recently, VMWare has visited our campus for hiring interns and they have put a CGPA cut off of 7/10. There were 2 rounds in total. An objective round initially which is then followed by a skype interview round. Round 1 : Online objective round This round was quite similar to the Set-3 VMWare Experience wherein we had 42 objective questions to be solved in 65min with no negative marking. There were 3 sections in total. First section was Logical and Aptitude and there were 15 questions in total. Difficulty : High (There was also a time limit of 15min to solve these 15 questions) Second section was Technical which included 20 questions on Networking (High level questions on SSH, TelNet, TCP/IP etc)& OS concepts (like Memory management and Scheduling algorithms ) Difficulty : High (There was a time limit of 35min to solve these 20 questions) For third section, I was asked to choose between C++/JAVA and there were 7 output based questions Difficulty : Medium (There was a time limit of 15min for these 7 questions) These were mainly based on concepts of OOPS like polymorphism, Inheritance. Round 2 : Skype Interview(Technical) This was a bit easier. The interviewer has asked me to code some basic questions like : Algorithmic : 1) Mirror tree 2) Validity of BST 3) Height of a tree 4) Cycle in a linked list 5) Middle node in a linked list in one traversal (Use 2 pointers) 6) kth largest element in an array Networking and OS : Demand paging, Interpreter vs Compiler, Virtual memory s Real Memory, DHCP vs Static IP. Puzzle : 2 eggs, 100 floor puzzle Then we had a discussion on my previous interns and my projects. He seemed to be highly focused on my Data Mining and Machine Learning projects as he asked me to dive deep into them. A big thank you to GeeksforGeeks for providing such invaluable material for preparation.  \nRelated Practice Problems\nMirror Tree\nHeight of Binary Tree\nCheck for BST\nDetect Loop in linked list\nFinding middle element in a linked list\nK’th smallest element\nAll Practice Problems for VMWare !\n\nComment\nMore info\nCampus Training Program\nNext Article\nVMware Interview Experience | Set 4 (On-Campus)"
      },
      {
        "title": "Veritas Interview Experience Set 2 Campus",
        "url": "https://www.geeksforgeeks.org/veritas-interview-experience-set-2-campus/",
        "content_summary": "Veritas\nvisited our college for campus hiring. The CTC offered was 9.26 LPA. There were a total of 105 candidates eligible for the recruitment test. The selection process included an aptitude test, 2 tech interviews, and HR interview.\nROUND 1:(Aptitude+Technical test)\nThe aptitude test was on HackerRank. It had 20 MCQs based on CS concepts, C/C++ output questions, oops concepts(constructor, inheritance, overloading, overriding), etc. There were also 2 coding questions:- Q.1 Write a function to detect a loop in the linked list. return \"YES\" or \"NO\".\nDetect loop in the linked list\nQ.2 Write a function to delete all those nodes in the linked list which contain data greater than a value k. return head node. My approach was to 1) Traverse the LinkedList using two pointers prev & curr. 2) When curr value is greater than k, make prev->next point to curr->next. 3) Delete curr node. 4) Make new curr point to prev->next. 5) Repeat till curr is not NULL. There were some more edge cases to be covered. Round 1 was easy. Around 30 students out of 105, were shortlisted for the Tech interview. All those who passed all the test cases of both the coding questions easily were selected, few with partial submission were also selected.\nROUND 2: Technical Interview\nQ.1 Tell me about yourself. (Just a formality, interviewer is thinking about questions to ask) Q.2 Rate yourself out of 10 in following subjects: C,\nC++\n, OOPS,\nOS\n, System programming / Compiler Design, Quality Testing. Q.3\nStorage Classes\nQ.4\nStack and Heap memory representation\nQ.5 Bombarding of OOPS Concepts Inheritance in depth, access specifiers, difference between privately, publicly, protected inherited Output questions Q.6 Pointers in depth. much attention paid to syntax. dereferencing double pointers Q.7\nThis question on ternary search\nQ.8\nMiddle element in linked list\nQ.9 Explain all sorting techniques you know. Q.10 Write code for\nInsertion sort\nQ.11\nMerge sort linked list\n ROUND 3: Technical Interview-II\nQ.1 Tell me about yourself. Q.2 Projects Discussion. Q.3 Booting process in OS. Q.4 Linux commands. Q.5\nProcess vs Threads\nQ.6\nMutex vs Semaphore\nQ.7\nPaging in OS\nin depth Q.8 Practical use of paging and segmentation. Q.9\nReverse words in a sentence\nwithout using any extra space.\n ROUND 4: HR Interview\nQ.1 Tell about yourself. Q.2 Extracurriculars. Q.3 Why Veritas? Q.4 Areas who need to improve? Q.5 Where do you see yourself after 5 years? Q.6 Strengths and weaknesses. Some more typical HR questions. Then they say \"YOU ARE SELECTED\" All of the students who made it till the HR Round were selected. Overall, 7 were selected from 30.\n\nComment\nMore info\nCampus Training Program\nNext Article\nVeritas Interview Experience | Set 2 ( On Campus )"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/swap-kth-elements5500/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:30:52.991690",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Swap kth elements",
      "difficulty": "Basic",
      "accuracy": "52.76%",
      "submissions": "77K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Given an array arr[], swap the kth element from the beginning with the kth element from the end.\nNote: 1-based indexing is followed.\nExamples :\nInput: arr[] = [1, 2, 3, 4, 5, 6, 7, 8], k = 3\nOutput: [1, 2, 6, 4, 5, 3, 7, 8]\nExplanation: 3rd element from beginning is 3 and 3rd element from end is 6, so we replace 3 & 6.\nInput: arr[] = [5, 3, 6, 1, 2], k = 2\nOutput: [5, 1, 6, 3, 2]\nExplanation: 2nd element from beginning is 3 and from end is 1.\nConstraints:\n1 ≤ arr.size(), k ≤ 106\n-109 ≤ arr[i] ≤ 109"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley",
        "Rockstand"
      ],
      "topic_tags": [
        "Arrays",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/delete-alternate-nodes/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:31:04.411168",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Delete Alternate Nodes",
      "difficulty": "Easy",
      "accuracy": "56.09%",
      "submissions": "87K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Given a Singly Linked List, Delete all alternate nodes of the list ie delete all the nodes present in even positions.\nExamples :\nInput: LinkedList: 1->2->3->4->5->6\nOutput: 1->3->5\nExplanation: Deleting alternate nodes ie 2, 4, 6 results in the linked list with elements 1->3->5.\nInput: LinkedList: 99->59->42->20\nOutput: 99->42\nExpected Time Complexity: O(n)\nExpected Auxiliary Space: O(1)\nConstraints:\n1 <= number of nodes <= 105\n1 <= node->data <= 103"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley"
      ],
      "topic_tags": [
        "Linked List",
        "Data Structures"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/remove-duplicate-elements-from-sorted-array/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:31:15.720295",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Remove Duplicates Sorted Array",
      "difficulty": "Easy",
      "accuracy": "38.18%",
      "submissions": "293K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "Given a sorted array arr. Return the size of the modified array which contains only distinct elements.\nNote:\n1. Don't use set or HashMap to solve the problem.\n2. You must return the modified array size only where distinct elements are present and modify the original array such that all the distinct elements come at the beginning of the original array.\nExamples :\nInput: arr = [2, 2, 2, 2, 2]\nOutput: [2]\nExplanation: After removing all the duplicates only one instance of 2 will remain i.e. [2] so modified array will contains 2 at first position and you should return 1 after modifying the array, the driver code will print the modified array elements.\nInput: arr = [1, 2, 4]\nOutput: [1, 2, 4]\nExplation: As the array does not contain any duplicates so you should return 3.\nConstraints:\n1 ≤ arr.size() ≤ 105\n1 ≤ ai ≤ 106"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Zoho",
        "Morgan Stanley",
        "Microsoft",
        "Samsung",
        "Google",
        "Wipro",
        "Xome"
      ],
      "topic_tags": [
        "two-pointer-algorithm",
        "Arrays",
        "Data Structures",
        "Algorithms"
      ]
    },
    "interview_experiences": []
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/stock-buy-and-sell2615/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:31:27.179471",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Stock Buy and Sell – Multiple Transaction Allowed",
      "difficulty": "Medium",
      "accuracy": "13.43%",
      "submissions": "174K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "The cost of stock on each day is given in an array price[]. Each day you may decide to either buy or sell the stock i at price[i], you can even buy and sell the stock on the same day. Find the maximum profit that you can get.\nNote: A stock can only be sold if it has been bought previously and multiple stocks cannot be held on any given day.\nExamples:\nInput: prices[] = [100, 180, 260, 310, 40, 535, 695]\nOutput: 865\nExplanation: Buy the stock on day 0 and sell it on day 3 => 310 – 100 = 210. Buy the stock on day 4 and sell it on day 6 => 695 – 40 = 655. Maximum Profit = 210 + 655 = 865.\nInput: prices[] = [4, 2, 2, 2, 4]\nOutput: 2\nExplanation: Buy the stock on day 3 and sell it on day 4 => 4 – 2 = 2. Maximum Profit = 2.\nConstraints:\n1 <= prices.size() <= 105\n0 <= prices[i] <= 104"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Paytm",
        "Flipkart",
        "Morgan Stanley",
        "Accolite",
        "Amazon",
        "Microsoft",
        "Samsung",
        "D-E-Shaw",
        "Hike",
        "MakeMyTrip",
        "Ola Cabs",
        "Oracle",
        "Walmart",
        "Goldman Sachs",
        "Directi",
        "Intuit",
        "SAP Labs",
        "Quikr",
        "Facebook",
        "Salesforce",
        "Pubmatic",
        "Sapient",
        "Swiggy"
      ],
      "topic_tags": [
        "Arrays",
        "Data Structures"
      ]
    },
    "interview_experiences": [
      {
        "title": "Ola Interview Experience Set 7 For Sde 1",
        "url": "https://www.geeksforgeeks.org/ola-interview-experience-set-7-for-sde-1/",
        "content_summary": "I was recently interviewed by OLA, I could not make it after the last round. All rounds I had were telephonic, in the last round I was asked to code on collabedit. Round 1 (around 35 min): 1. Given a matrix containing 0's and 1's. Find all the rows which are having 1's at same position. Give all sets satisfying this. 2. In a stock market given are price of shares spread over a week. On what day should I buy and what day should i sell to get maximum profit. 3. Being a computer engineer why did I not opt for system side programming than web domain. (I had expr in web domain) 4. I had expr in web domain so he asked: What is the difference between web browser request and ajax call request. -- It is simple, by ajax call partial web page can be loaded. 5. Have you worked on ruby on rails? Round 2 : 1. Given a matrix containing numbers. Find the 0's and make all the rows and columns corresponding to that index as 0. 2. Design a structure for a File Uploader service (eg. Dropbox, google drive). It is a service where multiple people can upload data at the same time and it also lists the top five uploaders (who uploaded the maximum number of files). 3. Puzzle: There is an employer and a worker, the employer has a gold bar of 7 units and he has to give 1unit each on a day for 7 days. The employer has a magical knife which doesn't work once it performs two cuts(1 cut divides the bar into two parts) on the bar. How will you cut so that 1 unit on each day can be given to the worker. 4. Print left view of binary tree. Round 3 : 1. He discussed what things they work on Ola. How these things are implemented. Like he mentioned of bar code a product has and catalog kind of thing. 2. I had to explain what project I am working on currently, what is the team size. 3. a)Since I had worked on SQL and databases, so he asked me what data structure will I use to implement a database. --I gave hashmap as a soln (the key is our primary key and other fields we can store in an object which will be value for hashmap) b)Now, If in case you want to find all names starting with a particular word (eg. ram....).How will you do that? -- gave trie structure as soln. c)Now you need to find students whose marks are between a range i.e. between two numbers. How will you do, what data structure will you take in this case? -- a simple solution was that, take binary search tree and do inorder traversal of that (I couldn't answer this, not clicked me) 4. Do you want to ask anything? Round 4 : 1. The server receives a ping every 30 secs. The ping is load avg on the machine at that time. Find 90% percentile of the load average on the machine at any time instant. 2. Find missing number in an AP.\nRelated Practice Problems\nStock buy and sell\nMaximum Difference\nAll Practice Problems for Ola-Cabs !\n\nComment\nMore info\nCampus Training Program\nNext Article\nOLA Interview Experience | Set 7 (For SDE-1)"
      },
      {
        "title": "Accolite Interview Experience Set 4 On Campus",
        "url": "https://www.geeksforgeeks.org/accolite-interview-experience-set-4-on-campus/",
        "content_summary": "Round 1 (Written) \nAround 140 students appeared for the offline test. \n\n\nThere were 20 MCQs that to be done in (30 minutes), questions were from OS,DBMS,Datastructures. \nAfter that coding round was there (paper coding) in which 3 questions were given and we have to attempt any 2 (1 hour) \n\n1. Write your own sqrt() function. the function should return square root if it is a perfect square else return floor(sqrt(x)) \n2. Given an array containing positive and negative integers. you have to find the smallest missing positive number. your code should run in O(n) time and O(1) space. \n3. Given an array of strings, find whether the strings can be chained or not to form a circle. A string x can be put before another string y if last character of x is same as first character of y. \n\nAfter round-1 , 19 people were shortlisted for the interviews. \n\n\n\n\nRound 2 (Technical) (1:30 hr) \n1. Tell me about yourself. Meanwhile he(interviewer) looked into my CV and asked about my projects. \nI have done 3 projects so he started discussion CUDA and parallel programming and how you implemented over images to detect edges and how much gain factor achieved. \nsecondly,I have made an project on online voting system so he asked me to draw E-R diagram, schemas and the relationship between them and their functionalities.About (25-30) minutes discussion. \n\n2. Given a BST, you have to find the kth smallest element in it in O(n) time and O(1) space. \n\n3. Suppose you have server where multiple requests are coming at time to,t1,t2...Now suppose a user hits at any particular time t on the server then server should return the last request. you have to design the datastructure for the same. \nI suggested that we can use stack that will return the last request, he then asked me to do for last 10 requests then I suggested to use array of structures which will store request no. and timestamp along with them.Now at any time t we can move 10 elements back but he said that suppose user hits frequently then every time i will have to traverse back again and again so time complexity will be much high, I agreed and suggested another solution similar to LRU implementation so that the requests which are coming frequently can be processed faster. then he modified question that user wants requests of last 1 minute and he gave a hint that is it necessary to store all requests can we not just store requests of every 1 min only,then suddenly it clicked to me, I suggested to use deque for 60 secs now suppose request arrives at 61st sec then we can just add that at rear and remove one from front maintaining a window of 60 seconds.He was satisfied but he want that no deletion should be there so I told him to use circular deque so that we can replace previous elements.He was completely satisfied now with the approach.(About 35 min. discussion) \n\n4. Given an array containing prices of a share of 30 days.A person has 1 share which he can buy and sell any number of times, you have to find the maximum profit which can be earned. \nI suggested one approach to create two auxiliary array MIN from left and MAX from right and traverse both simultaneously if difference between MAX[i] and MIN[i] is greater than maxDiff then update maxDIff and store current index and add to sum if index+1 is not equal to current iteration index and finally return sum.He tried some test cases over my code and found that for some cases it was giving wrong answer,then he asked me that how is my command over dynamic programming,I told I know only the standard ones and no other experience,then he said this question is of DP but he was happy to see my approach.(About 20-25 min.) \n\n\n\n\nRound 3 (Technical) (1:30 hr) \n1. She(interviewer) asked me if I attempted 3rd question in written test, I said I attempted only 1st and 2nd, then she gave me paper and told to implement the 3rd question. \nI suggested an approach to use two arrays of structures(for first characters and last characters) which will contain boolean value to mark presence of character in string and also its index. Now compare two arrays and see that if both arrays have same boolean value and different indices for all first and last characters. If so then strings can form a chain else not.She was in doubt for my solution so she found a testcase where my code was giving wrong answer,so she told me to look for another solution,I came up with another approach and told her that we can make a directed graph from first and last characters and then traverse it in DFS, now suppose if the visited node is visited again and count of total visited nodes is same as total nodes then we can say that strings will form a chain, now she was satisfied with approach and asked me to write code, now as my graph was weak i was in shock,so she said to just write the pseudocode. \n\n2. Given a BST, you have to find the kth largest element in it in O(n) time and O(1) space. \nI suggested to declare a static variable count which will increment count if node visited in inorder and if count becomes k, I will print that node's data and return. Then she asked me how static works and difference between global and static. \n\n3. Given a mobile keypad of say nokia phone and a dictionary which has all the meaningful words which can be formed, suppose now user types some number(input) then your program must suggest all the meaningful words which are present in dictionary.Before implementing this she asked me the datastructure to store the dictionary efficiently and then how will you use this datastructure to make code. \nAt first, I suggested I will store dictionary in 2-D array and lexicograpphically sort it, now suppose user types a number the string starting with that character is searched in the array. she said to reduce complexity because dictionary may contain 1000s of words,then I suggested to use trie datastructure to store and search the string, she was satisfied now and asked me to explain the concept. \n4.Given preorder and postorder of a graph, how can you construct the graph. \nAs I heard this question, i was stuck for 2 minutes but then I said as far as graph is concerned I dont know about it but a unique tree cannot be constructed with preorder and postorder so as graph,so inorder is needed, she was happy and agreed on answer. \n\n\n\n\nRound 4 (Technical) (2:30 hr) \n1. Suppose a linked list is given and there is a loop, you have to find orphan nodes in O(n) time. orphan nodes are the nodes outside the loop. \n\n2. Design a BRTS traffic signalling system such that no two vehicle clashes. Note that BRTS bus will follow the BRTS traffic lights B1,B2,B3,B4 in 4 directions and regular traffic will follow regular traffic lights R1,R2,R3,R4 only. In input only maximum cycle time was given(time after which the process repeates) check for all corner cases (traffic lights have two states only (RED and GREEN)).you have to tell any one possible combination of traffic lights under maximum cycle time. (About 1hr discussion). \n\n3. Suppose a linked list is given but we dont know the count of nodes, you have to find the kth node from last without counting the nodes. \n4. Given an array of n integers such some elements are in the range 0 to n-1 and some out of range may be negative.You have to rearrange array such that all elements which are in range appear on their index and rest appear in sorted manner for indexes not present.This should be done in O(n) time and O(1) space. \nEg- suppose n=6 ,4 5 2 3 6 -3 output= -3,6,2,3,4,5 \n\n5. How can you implement stack using queue/queues. \n6. How can you sort the elements with the help of queue. \nI suggested one O(n) time solution along with O(n) extra space.He asked to do in O(1) space so I suggested deque, he seemed satisfied. \n\nonly 4 were selected till this round (I was one of them) \n\nRound 5 (Bar Raiser) (30 minutes) \n\n1. find the length of longest palindrome in a string starting from index 0. \n2. find if a string A is present in string B or not. \n3. find the length of longest prefix in a string \n\nAfter this 2 were selected finally and unfortunately I was not amongst them as they might have thought i was little stress out. At last I would suggest that your approach and concepts must be strong as they always give questions with some variations. \n\nRelated Practice ProblemsSmallest Positive missing numberCount SquaresCircle of stringsCheck for subsequenceStock buy and sellLongest Palindrome in a String\n\n \n\n\nAll Practice Problems for Accolite ! \n\n\n \n \nComment\nMore info\nCampus Training Program\nNext Article\nAccolite Interview Experience | Set 4 (On-Campus)"
      },
      {
        "title": "One97paytm Interview Experience",
        "url": "https://www.geeksforgeeks.org/one97paytm-interview-experience/",
        "content_summary": "Written 1: Technical and Aptitude. Written 2: Written Coding\nWritten 1 was Normal Written exam based on fundamentals of Aptitude and Computer Science.\nWritten 2: Few Questions I remembered : Q1:\n \n     char a;\n     int i = 300;\n     a = &i;\n     a++;\n     *a=2;\n     printf(\"%d\",i); \nQ2:\n Imagine you have a special keyboard with the following keys:\n        A\n        Ctrl+A\n        Ctrl+C\n        Ctrl+V \nwhere CTRL+A, CTRL+C, CTRL+V each acts as one function key for “Select All”, “Copy”, and “Paste” operations respectively. If you can only press the keyboard for N times (with the above four keys), please write a program to produce maximum numbers of A. If possible, please also print out the sequence of keys. That is to say, the input parameter is N (No. of keys that you can press), the output is M (No. of As that you can produce). Q3: Consider a Binary Tree not necessarily BST, Remove all nodes which don’t lie in any path with sum>= k. Q4: Given an array arrange it in the form a<b>c<d>e<f>g.......... Q5: Given an array of numbers arrange it in the form of a single number such that the concluded number is the maximum. e.g. given : 99, 8, 76, 45, 66, 9, 7, 33, 5, 42 O/P : 99987766654233 Sectional Cut-off for O/P and Coding Questions. Marking was done against the correct approach, not the exact answers.\nRound 1 (Technical): Q1: How will you store 800 Million records in database. Q2: Data storage of double and float differs in C/C++ and Java How is it ??? Q2: Transfer data between a program written in Java and C#. Q3: I need to establish a network in which I will be sure of security, How will you proceed Q4: A and B are two sets Write a non-nested query so that I can get the data in B but not in A. Q5: 000..............? 11111111111111111111................? Write a Program which finds the index of the start of series 11111111.....?.\nRound 2 (Technical): Q1: Give your introduction along with your technical skills. Q2: Explain your project \"Stock Prediction\" Q3: I want to retrieve records from a table from date 1 - 15. I don't want to use range Queries Suggest optimal solutions... I suggest Indexing on the date column. He insisted on alternate ways. \"he said what you think you can do......\" Q4: What is Unique and NULL Constraint? Difference between Primary Key and Unique. How many maximum records in Unique can be NULL? Q5: Write the Most optimized algorithm for finding a Word in the sentence. (I used the Trie approach, he scolded me for not asking the sentence is sorted or not. the used Binary search.) Q6: Difference between thread and process. What is PCB? What is synchronization ?? What is Semaphore? Explain and solve the Producer-Consumer Problem using Semaphore? What is Drawback here What is the monitor? Solve Producer-Consumer Problem using Monitor and explain the pros and cons. Final 8 candidates from Delhi region selected.\nRound 3(Final Round Managerial and Technical): Q1: What you want to do in your Life ?? Discussion life as a placement coordinator? What you did ? your duties? differences you made ... Q2: Doing Post Market Analysis of a Stock Market of Previous Month. Write a Program of Stock Buy Sell to Maximize Profit. Q3: Explain Cursor ? its types? differences between them? What to use when? Q4: Explain Matrix? Matrix Multiplication? Difference ways of Matrix Multiplication? Explain Both. Q5: What are you doing right now ??? will you join us ?? Why ??\nStudents from 30 Colleges of India are evaluated and Top 25 are offered the JOB. I was not one of them.\nAll Practice Problems for Paytm !\nRelated Practice Problems\nConvert array into Zig-Zag fashion\nStock buy and sell\nLargest Number formed from an Array\n\nComment\nMore info\nCampus Training Program\nNext Article\nOne97(Paytm) Interview Experience"
      },
      {
        "title": "Paytm Interview Experience Set 4 Walk In Drive",
        "url": "https://www.geeksforgeeks.org/paytm-interview-experience-set-4-walk-in-drive/",
        "content_summary": "I got a chance to participate in walk-in drive at Paytm Headquarters. Went through the following process.\nWritten test: It contained 20 objective questions having a mix of C, networking and Database questions and 2 subjective questions. Subjective questions: Stock buy sell maximum profit and Find sub string in a string\nTech round conducted by SE: Ques 1: Reverse a given linked list Ques 2: Reverse linked list in group of size 3 Ques 3: Minimum distance between two given characters of a string\nTech round conducted by tech lead: Ques 1: Tell me about yourself. Technology stack which you used while working. Ques 2: Matrix multiplication (buy c++ book from Sumita Arora class XII level for answer :P) Ques 3: Coin change problem (solved it using DP)\nInterviewer was impressed with solution of coin change and later he discussed what were the most difficult data structure problems which I had solved. I told some like phone number keypad problem, sudoku solver etc. I was only possible because of all the stuff I prepared regularly from geeksforgeeks which I could not have found anywhere else. Thanks to geeks for geeks.\nAll Practice Problems for Paytm !\nRelated Practice Problems\nCoin Change\nMultiply Matrices\nMinimum distance between two numbers\nReverse a Linked List in groups of given size.\nReverse a linked list\nStock buy and sell\n\nComment\nMore info\nCampus Training Program\nNext Article\nPaytm Interview Experience | Set 4 (Walk-in Drive)"
      },
      {
        "title": "Walmart Lab Interview Experience Set 8 Off Campus 3 Years Experience",
        "url": "https://www.geeksforgeeks.org/walmart-lab-interview-experience-set-8-off-campus-3-years-experience/",
        "content_summary": "Round 1 (Coding round): 1) Range [L, R] is given. Need to find what is the maximum repeating digit in prime numbers between L and R (both inclusive). If more number of digits is repeated max times, return whichever digit is maximum Eg: [2, 13] - maximum repeating digit is 1 among {2, 3, 5, 7, 11, 13} [2, 9] - answer 7 2) Given a number \"S\", find out how many number of ways a, b, c, d (all > 1) can exist such that a+b+c+d = S; Round 2: 1) OOPS Concepts 2) Reverse alternate nodes in linked list Eg: 1->2->3->4->5 ahould become 2->1->4->3->5 3) Iterative post order traversal of binary tree 4) Queue implementation using stacks Round 3 (Java): 1) Arraylist, Linkedlist - when to use what 2) Hashmap, Hashtable, concurrent hash map 3) Hashcode, Equals, Hashmap implementation 4) Serializable interface 5) AbstractClass Vs Interface 6) Multi threading, Difference between extends thread, implements runnable 7) Callable interface, Executor framework 8) Collections sorting, comparable interface 9) Best thing I have done so far what I proud of Round 4: 1) Given NxN matrix, (X,Y) position. Find how many ways You can reach from (X,Y) to (N,N). You are allowed to traverse in 2 directions - Right, Down 2) Find loop in linked list. Find starting node of loop 3) Binary tree zigzag traversal 4) Given list of stock prices. You are allowed to buy and sell only once. a) Find the maximum gain you can get b) Find the maximum loss you can get 5) Binary tree is height balanced or not. (Every node in tree should be height balanced) 6) Implement String trim algorithm 7) Write a multi-threaded program - launch 10 threads and exit from main thread after all those threads completed Round 5 (Manager): 1) Given a number in form of array, maximize the number w.r.t allowed number of swaps (can swap only adjacent elements) - maximize(int[] data, int numSwaps) Eg: 1265 is number - if 1 swap allowed - maximum number we can get out of it is 2165 1265 is number - if 3 swaps allowed - maximum number we can get out of it is 6215 2) Questions on my projects 3) So many behavioural questions Round 6 (HR): Why do you want to change? What You are expecting? and some other HR questions.\nAll Practice Problems for Walmart !\nRelated Practice Problems\nCount all possible paths from top left to bottom right\nCheck for Balanced Tree\nStock buy and sell\nLargest number in K swaps\nDetect Loop in linked list\nQueue using two Stacks\nFind the highest occurring digit in prime numbers in a range\nFind the highest occurring digit in prime numbers in a range\n\nComment\nMore info\nCampus Training Program\nNext Article\nWalmart Lab Interview Experience | Set 8 (Off-Campus 3 Years Experience)"
      },
      {
        "title": "Makemytrip Interview Experience Set 7 On Campus",
        "url": "https://www.geeksforgeeks.org/makemytrip-interview-experience-set-7-on-campus/",
        "content_summary": "Recently makemytrip visited our Campus and I got selected in recruitment drive.The placement drive consisted of 4 rounds. Round1: MCQ and coding round It was an online test of 60 minutes consisting of 20 aptitude question and 3 coding question. Platform used for the test was of makemytrip and slightly difficult to understand. Question1: Calculate the power of a ^ b mod c using logn approach.The thing that was to be taken care of was that you did not needed to return or print your answer but you had to store it in their predefined global variable. You could easily find the solution on geeksforgeeks site. Question2: Given a sentence you were supposed to calculate the count of Capital , small letter and number.Question seemed to be quite easy but the pick was that you needed to store the answer in char* output variable in the form of c1:c2:c3 where c1 represent count of capital letter c2 represent count of small letter and c3 represent count of number. (Hint use sprintf to store your answer in formatted way in the variable sprintf(output,\"%d:%d:%d\",c1,c2,c3); ) Question3: Activity Scheduling problem You are given 2 arrays representing the starting and finishing time of activities . Determine the maximum number of non conflicting activities that you can achieve. (Hint : make a structure of start and finish time and sort according to finishing interval) I solved 2 completely and 1 partially Tip:Since they have only one sample test case so even you are not able to solve the coding question just store the hard coded answer in that variable. I did that in last :P) Out of 110 students 30 students got selected for Personal Interview round. Round 2: Personal Interview Since I was last candidate in that list waiting from 10:30 am My turn came at 10:30 PM.The interviewer was very cool and friendly.He started with asking tell me about yourself and what projects I have done.After half hour rigerous discussion over my project and making schema of databases I used in project He started asking question on ds. Question1: Sort a linklist consisting of 0,1,2's. (Hint: I used hashmap of stl in c++ to store the count of 0,1 and 2) Question 2: Given a stock You need to find the maximum profit you can earn .You are allowed to buy and sell as many number of time you can.) Question 3:Design a treeset in java. (Hint:I told him to use BST but he told to think of more optimized way so Ii told AVL and wrote functions for insertion in AVL tree) Question4:Diffrentiate between method overloading and method overriding.What are static blocks in java. Question5: Drilling question on deployment descriptor,struts,mysql. Round3: Personal Interview The interviewer seemed to be exhausted . He asked me that Since you are the last person so all the question you would have asked. So tell me what all question you have asked. I told him distinct palindromic substring in string, LIS, LCS etc students told that you are asking.He thought for a while and told me to write standard bfs code for graph traversal. Question2: You have been given a matrix of character and a dictionary.You need to find the valid words that you can obtain from it and print it. (Hint:I used dfs to find the valid sequence and assumed that all words are stored in a hashmap) After these He asked 6 puzzles to be solved in a given time. Puzzle 1 : 1.5 hen give 1.5 egg in 1.5 day. How many hens are required to have 4 dozen of egg in 6 days. Puzzle 2: 2 ropes and take 1hr to burn. Calculate 45 min Puzzle 3:10 jar with 10gm marble in each jar.One jar contain 9gm marbles only.Find the defective jar in one turn. Puzzle4:150 person are standing in a queue in sorted order.A blind person comes and wants to be at right position in queue.So he asks any person whether he can stand in front of him.He will reply in Yes or No . You have to find the right place after 2Yes. Give a strategy to find the correct place. (Hint:This puzzle can be reduced to egg drop puzzle) Puzzle 5:25 horse having race find top 3 Puzzle 6:A person is riding a car and he sees a milestone A. After 1hr he sees milestone B which has digits reversed of A.After one hour more he finds a milestone C which contains all the digits of A and B . Given that A < B < C find the speed of car. (Other question that were asked from my friend 1.Distinct Palindrome in string 2.Transaction minimize problem 3.LCS and LIS (dp approach) 4.Diameter of tree 5.Pattern Matching Algorithm (KMP)) HR round: He asked me about my family background,what I do ,hobbies.What I know about makemytrip.What location I would prefer , whether I am satisfied with package or not,Working environment etc, It lasted for half hour. Tip:(Be expressive,Think out loud,Be confident. They need to know your approach not the solution)\nAll Practice Problems for MakeMyTrip !\nRelated Practice Problems\nN meetings in one room\nStock buy and sell\nWord Boggle\nDistinct palindromic substrings\nDiameter of Binary Tree\nLongest Prefix Suffix\nPower of Numbers\nGiven a linked list of 0s, 1s and 2s, sort it.\nLongest Common Subsequence\n\nComment\nMore info\nCampus Training Program\nNext Article\nMakeMyTrip Interview Experience | Set 7 (On-Campus)"
      }
    ]
  },
  {
    "metadata": {
      "url": "https://www.geeksforgeeks.org/problems/find-minimum-number-of-laptops-required--170645/1?page=1&company=Morgan%20Stanley&sortBy=latest",
      "scraped_at": "2025-06-11T12:31:53.143307",
      "source": "GeeksforGeeks"
    },
    "basic_info": {
      "title": "Find minimum number of Laptops required",
      "difficulty": "Medium",
      "accuracy": "51.13%",
      "submissions": "22K+",
      "avg_time": "Not available"
    },
    "content": {
      "problem": "There are N jobs and the start and finish time of the jobs are given in arrays start[] and end[] respectively. Each job requires one laptop and laptops can't be shared. Find the minimum number of laptops required given that you can give your laptop to someone else when you are not doing your job.\nExample 1:\nInput:\nN = 3\nstart[] = {1, 2, 3}\nend[] = {4, 4, 6}\nOutput:\n3\nExplanation:\nWe can clearly see that everyone's supposed to\nbe doing their job at time 3. So, 3 laptops\nwill be required at minimum.\nExample 2:\nInput:\nN = 3\nstart[] = {1, 5, 2}\nend[] = {2, 6, 3}\nOutput :\n1\nExplanation:\nAll jobs can be done using 1 laptop only.\nYour Task:\nYou don't need to read input or print anything. Your task is to complete the function minLaptops() which takes an integer N and two arrays start and end denoting starting and ending time of N jobs and returns minimum laptops required.\nExpected Time Complexity: O(N*logN)\nExpected Auxiliary Space: O(N)\nConstraints:\n1 ≤ N ≤ 105\n1 ≤ start[i] < end[i] ≤ 109"
    },
    "complexity": {
      "time_complexity": "Not specified",
      "space_complexity": "Not specified"
    },
    "tags": {
      "company_tags": [
        "Morgan Stanley"
      ],
      "topic_tags": [
        "Sorting",
        "Algorithms"
      ]
    },
    "interview_experiences": [
      {
        "title": "Morgan Stanley Interview Experience For Summer Internship 2021 Off Campus",
        "url": "https://www.geeksforgeeks.org/morgan-stanley-interview-experience-for-summer-internship-2021-off-campus/",
        "content_summary": "I applied through the career section of Morgan Stanley Official Website. There were three rounds:\nRound 1 (Online Aptitude and Coding test on AMCAT) (90 minutes): There were 3 sections:\nAptitude Section: 10 questions in 20 minutes. These questions were easy-to-medium level MCQs\nDebugging Section:  There were 7 questions based on C/C++ for debugging. (easy) (20 minutes)\nCoding Section: This section had 3 questions to be done in 60 minutes. I don't exactly remember the questions but\n1st was related to Arrays (medium)\n2nd was related to DP (medium)\n3rd was related to DSU (medium)\nI was able to solve 6-7 aptitude questions, all debugging questions, first 2 coding problems.\nI was confident about my test and got results via email after one week.\nRound 2 (Face 2 Face Technical Interview on Zoom) (50-60 minutes):\nFirst of all, I was asked to introduce myself, then I had to share the screen and open Notepad where I had to solve the problems.\nI was first asked What I know about OOPs (so I told the fundamental OOPs concepts)\nTypes of polymorphism, Run time Polymorphism, and Virtual functions\nThen I was asked to Design Netflix using Object Oriented Principles (The interviewer was helpful and gave me hints)\nThen I had to code the problem: Find Kth largest element in an unsorted array\nThen I had to code: Delete a node in LinkedList without head pointer\nThen I had to code the problem: Given the start and Finish time of multiple jobs, find the minimum number of Laptops required. Each Job requires one Laptop. Laptops cannot be shared.\nTip: Give answers confidently. If you don't know the answer -try to think of the solution (even if it is brute-force) otherwise just say confidently 'Sorry, I can't think of the solution right now'.\nI received a call about 1 week later that I had been selected for the Final Round.\nRound 3 (Face 2 Face HR + Technical Round on Zoom) (45 - 50 minutes): The Interviewer was very friendly (very very much). This round was supposed to be HR + Technical round (as I had read in many past experiences), but surprisingly for me It was only HR round.\nFirst I had to Introduce myself.\nI had a Team Project ( I recommend you should also have at least one team project ).\nHe asked questions like: How did it feel working in a team?, How team members used to contact each other for development and discussions? How did you manage your team?\nThen we did a discussion about my Individual project (This was my Main project) (for about 30 minutes): Why I chose that project, Why I used specific technology, What if I had to make it a big scale - how will I raise funds 'n all.\nThen he asked some situational questions like What will you do if you think your approach to doing a task is better than your manager's, but Manager is not agreeing?\nThen He asked me what all subjects I have this semester and what subjects I have studied so far.\nFinally, he asked me if I had any queries (I asked him which technology we will be working on and what is actually the role of an Intern).\nSuggestions:\nRead all the Interview Experiences 2-3 times, you will get an exact idea of what topics you need to focus on.\nRead OOPs and OS\nCoding Questions are only a part of the Interview, Focus on other topics, and your way of answering them also.\nObject-Oriented Design questions are easy, go through Movie-ticket Booking, Snake-n-Ladders, and Parking-lot Object-Oriented design questions to get an Idea.\nMy personal advice: Wear a shirt and sit in nice lighting to create an impact.\nFor Off-campus aspirants: Be patient, results usually come after 1 week.\nI got an E-mail after 1 week That I had been Selected.\n\nComment\nMore info\nAdvertise with us\nNext Article\nMorgan Stanley Interview Experience for Summer Internship 2021 (Off-Campus)"
      }
    ]
  }
]